[{"category": "nature", "definition": "Said about a new and imaginative approach, a change that feels good.", "example": "The president says that the country needs a breath of fresh air.", "frequency": 1206, "id": 2, "text": "a breath of fresh air"}, {"category": "health", "definition": "Said when you examine someone or something and state that they are healthy, in good condition, or legal.", "example": "The president was given a clean bill of health by his doctors.", "frequency": 16, "id": 3, "text": "a clean bill of health"}, {"category": "money", "definition": "An insignificant amount", "example": "At best, he'll make a dime's worth of difference with his interference in the affair.", "frequency": 8, "id": 4, "text": "a dime's worth"}, {"category": "life", "definition": "This idiom is used to refer to something which is unpleasant and which people accept because they cannot change it.", "example": "Violence has become a fact of life among teenagers these days.", "frequency": 97, "id": 5, "text": "a fact of life"}, {"category": "money", "definition": "this means that stupid people spend money without thinking about it enough.", "example": "John likes his extravagant lifestyle - but then a fool and his money are soon parted.", "frequency": 1, "id": 11, "text": "a fool and his money are soon parted"}, {"category": "life", "definition": "This phrase is used to refer to something or someone that saves a person in a difficult situation or critical moment.", "example": "Thank you so much for your help. You're a real lifesaver!", "frequency": 61, "id": 12, "text": "a life-saver"}, {"category": "animals", "definition": "said when you don't want reveal the source of your information.", "example": "How did you know the news? Oh, a little bird told me.", "frequency": 0, "id": 13, "text": "a little bird told me"}, {"category": "sport", "definition": "This phrase refers to a person who is completely lost or confused and does not know what they are doing, how to do it or possibly even where they are.", "example": "I got confused as to what I should do. I was a lost ball in the weeds.", "frequency": 0, "id": 14, "text": "a lost ball in the weeds"}, {"category": "men and women", "definition": "a man who is inclined to act first rather than think about things and discuss them.", "example": "Bill is really a man of action. Since he arrived at the top of the association, he has done so many things.", "frequency": 69, "id": 15, "text": "a man of action"}, {"category": "men and women", "definition": "Someone who doesn't speak much.", "example": "He is a man of few words. But when he speaks, he makes a lot of sense.", "frequency": 38, "id": 16, "text": "a man of few words"}, {"category": "men and women", "definition": "This phrase refers to someone known for traditionally masculine interests and activities.", "example": "Alex is what you would call a man's man.", "frequency": 65, "id": 17, "text": "a man's man"}, {"category": "life", "definition": "This idiom is used to refer to an occasion when something gives you the chance to become happy or healthy and makes you more energetic than before.", "example": "His new job has given him a new lease of life.", "frequency": 8, "id": 18, "text": "a new lease of life"}, {"category": "numbers", "definition": "This idiom refers to someone whose job is to work with numbers and mathematics. It may also refer to a computer that is able to solve complicated problems of mathematics.", "example": "He's a number cruncher. He works for a big firm of accountants.", "frequency": 1, "id": 19, "text": "a number cruncher"}, {"category": "home", "definition": "A place to live.", "example": "He was so poor that he didn't have a roof over his head.", "frequency": 5, "id": 20, "text": "a roof over your head"}, {"category": "crime", "definition": "This idiom refers to a good deal.", "example": "it's almost like you stole it.", "frequency": 565, "id": 21, "text": "a steal"}, {"category": "furniture", "definition": "This expression is used to mean that things appear to go more slowly if one waits anxiously for it.", "example": "There's no point running downstairs for every mail delivery. A watched pot never boils.", "frequency": 0, "id": 22, "text": "a watched pot never boils"}, {"category": "sport", "definition": "A completely different situation.", "example": "He has written so many short stories but writing a novel is a whole new ball game.", "frequency": 2, "id": 23, "text": "a whole new ball game"}, {"category": "men and women", "definition": "Someone who doesn't speak much.", "example": "She is a woman of few words, but she always gets things done.", "frequency": 0, "id": 24, "text": "a woman of few words"}, {"category": "food", "definition": "This idiom means that something is totally useless.", "example": "A car in a heavy traffic jam is as useful as a chocolate teapot. Use a bike instead!", "frequency": 0, "id": 25, "text": "about as useful as a chocolate teapot"}, {"category": "law", "definition": "This phrase is used to describe a person who is honest enough that no one would suspect.", "example": "That guy is a peaceful man, he is above suspicion.", "frequency": 9, "id": 26, "text": "above suspicion"}, {"category": "law", "definition": "Not subject to the law, exept from the laws that apply to everyone else.", "example": "Nobody is above the law.", "frequency": 100, "id": 27, "text": "above the law"}, {"category": "food", "definition": "This idiom means they are of high standing or honor.", "example": "In medieval times lords used to sit above the salt.", "frequency": 0, "id": 28, "text": "above the salt"}, {"category": "parts of the body", "definition": "said about a strong situation which contains an element of vulnerability.", "example": "Journalists considered that minister as the government's Achilles heel.", "frequency": 12, "id": 29, "text": "achilles heel"}, {"category": "love", "definition": "This phrase is an idiomatic expression that refers to the feeling of pain because of love.", "example": "My aching heart is telling me that he doesn't love me.", "frequency": 16, "id": 30, "text": "aching heart"}, {"category": "technology and science", "definition": "This idiom refers to a decisive test whose findings show the worth or quality of something.", "example": "Our team's next match will be the first real acid test in this competition.", "frequency": 70, "id": 31, "text": "acid test"}, {"category": "religion", "definition": "something that ooccured, such as an accident, for which no human is responsible. A natural disaster such as a storm, earthquake...", "example": "The Haiti earthquake was really an act of God.", "frequency": 84, "id": 32, "text": "act of God"}, {"category": "age", "definition": "To be mature and not childish.", "example": "Stop being childish and act your age.", "frequency": 0, "id": 33, "text": "act one's age"}, {"category": "religion", "definition": "(old-fashioned) water.", "example": "Take a glass of adam's ale if you are thirsty.", "frequency": 0, "id": 34, "text": "adam's ale"}, {"category": "nature", "definition": "To make a problem worse, to say or do something that makes a bad situation worse.", "example": "Don't add fuel to the fire by laughing at him. He is furious about what you have already done", "frequency": 11, "id": 35, "text": "add fuel to the fire"}, {"category": "relationship", "definition": "said about you have attraction , preference or sympathy for something or someone.", "example": "He has an affinty for classical music.", "frequency": 371, "id": 36, "text": "affinity for"}, {"category": "time", "definition": "This idiom means to do something as fast as possible and try to finish it before a deadline.", "example": "The students were racing against the clock to finish the paper before the deadline.", "frequency": 96, "id": 37, "text": "against the clock"}, {"category": "time", "definition": "An attempt to finish something quickly within a time limit.", "example": "It's going to be a race against the time to finish the project before the deadline.", "frequency": 234, "id": 38, "text": "against time"}, {"category": "age", "definition": "A phrase said to allow older people to go before younger ones. Now most often used humorously or lightheartedly, and usually said by a younger person to an older friend or relative out of mock pity for being so much older and unattractive.", "example": "Please, you first. Age before beauty, you know.", "frequency": 0, "id": 39, "text": "age before beauty"}, {"category": "time", "definition": "in advance of concurrent commonly accepted ideas, showing characteristics of changes yet to be, present in one's work before later advances in the field.", "example": "With his new scientific discoveries, he was ahead of his time.", "frequency": 3, "id": 41, "text": "ahead of one's time"}, {"category": "health", "definition": "To continue to be well, healthy or successful.", "example": "Don't worry about your grandfather, he is alive and kicking.", "frequency": 105, "id": 42, "text": "alive and kicking"}, {"category": "colors", "definition": "This idiom means that in the dark, physical appearance is unimportant.", "example": "I really don't care if she is ugly. All cats are gray in the dark.", "frequency": 0, "id": 43, "text": "all cats are grey in the dark"}, {"category": "clothes", "definition": "This idiom means getting ready for something and then it never happened.", "example": "She was waiting for him but he never showed up. As usual, she was all dressed up and nowhere to go.", "frequency": 0, "id": 44, "text": "all dressed up and nowhere to go"}, {"category": "clothes", "definition": "Describing someone who is full of big talk but lacking action, power, or substance, pretentious.", "example": "We expect our president to be effective in his job, not a person who is all hat and no cattle.", "frequency": 4, "id": 45, "text": "all hat and no cattle"}, {"category": "work", "definition": "What is normal, typical or expected.", "example": "Grading my students' papers is all on a day's work for me.", "frequency": 15, "id": 46, "text": "all in a day's work"}, {"category": "food", "definition": "the state of having invested heavily in just one area or of having devoted all of one's resources to one thing.", "example": "The stock market decline wouldn't have hurt him so badly if he hadn't had all his eggs in one basket", "frequency": 0, "id": 47, "text": "all one's eggs in one basket"}, {"category": "money", "definition": "appearance is sometimes misleading. Things that appear valuable or worthwhile might not be as good as they look.", "example": "The house looks beautiful from the outside but the inside part of the house looks terrible, all that glitters is not gold.", "frequency": 3, "id": 48, "text": "all that glitters is not gold"}, {"category": "music", "definition": "Everything else related to something, and other similar things.", "example": "They enjoyed the party: cocktails, dancing, and all that jazz.", "frequency": 48, "id": 49, "text": "all that jazz"}, {"category": "general", "definition": "Even more.", "example": "Her family didn't want her to get married to her new boyfriend, but that just made her all the more determined.", "frequency": 3021, "id": 50, "text": "all the more"}, {"category": "life", "definition": "Occupations, roles, social class, or lifestyle.", "example": "Those who attended the wedding represented all walks of life.", "frequency": 439, "id": 51, "text": "all walks of life"}, {"category": "work", "definition": "This idiom means that it is not good to work all the time and that people may get bored if they don't get some time off from work.", "example": "I think you need to go out and have some fun. You know all work and no play makes Jack a dull boy.", "frequency": 0, "id": 52, "text": "All work and no play makes Jack a dull boy"}, {"category": "war", "definition": "This idiom means you are allowed to be deceitful in order to get what you want.", "example": "To get her to go out with him, he lied and told her that is very rich. All's fair in love and war.", "frequency": 5, "id": 53, "text": "all's fair in love and war."}, {"category": "general", "definition": "In a general direction or manner.", "example": "I was thinking along the lines of a vegetable garden, but I could be persuaded to include some perennials.", "frequency": 1207, "id": 54, "text": "along the lines"}, {"category": "nature", "definition": "This idiom means you are trying to do something that you will never achieve.", "example": "Although he is 48 years old, he is still dreaming of becoming a famous singer. He's always chasing rainbows.", "frequency": 0, "id": 55, "text": "always chasing rainbows"}, {"category": "parts of the body", "definition": "A lot of money.", "example": "These glasses cost me an arm and a leg.", "frequency": 75, "id": 56, "text": "an arm and a leg"}, {"category": "parts of the body", "definition": "Said to suggest that punishment should equal the crime. At the root of this principle is that one of the purposes of the law is to provide equitable retribution for an offended party.", "example": "In some countries, justice operates on the principle of an eye for an eye. That is, if you kill someone, you desrve to die.", "frequency": 52, "id": 57, "text": "an eye for an eye"}, {"category": "death", "definition": "One in a series of events which lead to downfall or inevitable failure.", "example": "After the bankruptcy and the death of his only son, divorce is just another nail in his coffin.", "frequency": 0, "id": 58, "text": "another nail in one's coffin"}, {"category": "time", "definition": "Very soon.", "example": "The news about the president's resignation will be broadcasted on TV any moment now.", "frequency": 0, "id": 59, "text": "any minute soon now"}, {"category": "travel", "definition": "An unfavorable option which might well be avoided in good times but which nevertheless looks better than the alternatives at the current time.", "example": "That horrible hotel was a case of any port in a storm as we couldn't find any place to spend the night.", "frequency": 0, "id": 60, "text": "any port in a storm"}, {"category": "food", "definition": "said about someone whom you love the most and you are very proud of.", "example": "His son is the apple of his eye.", "frequency": 0, "id": 62, "text": "apple of somebody's eye"}, {"category": "parts of the body", "definition": "Said about someone who was not present but was the topic of discussion.", "example": "We were just talking about you. Are your ears burning?", "frequency": 0, "id": 63, "text": "are your ears burning?"}, {"category": "furniture", "definition": "This idiom is about person who knows or pretends to know a lot about something in theory rather than practice.", "example": "He is such an armchair critic, he has no experience in the subject but he is ready to give plenty of advice.", "frequency": 18, "id": 64, "text": "armchair critic"}, {"category": "war", "definition": "This idiom means heavily armed with deadly weapons.", "example": "He was caught armed to the teeth and was a danger to himself and the community.", "frequency": 25, "id": 65, "text": "armed to the teeth"}, {"category": "war", "definition": "This idiom is used when talking about one of a number of resources or strategies that can be used to achieve a goal.", "example": "If you are having a job interview, improving your communication skills can be another arrow in your quiver.", "frequency": 1, "id": 66, "text": "arrow in the quiver"}, {"category": "sport", "definition": "Completely without hair.", "example": "His father was as bald as a cue ball!", "frequency": 0, "id": 68, "text": "as bald as a cue ball"}, {"category": "health", "definition": "This idiom means they are nearly or completely blind or they are unwilling to recognize problems or bad things.", "example": "He is as blind as a bat when it comes to his wife's shameful behavior", "frequency": 3, "id": 69, "text": "as blind as a bat"}, {"category": "animals", "definition": "Said about kind , innocent, mild-mannered people.", "example": "She is as gentle as a lamb. That's why everybody likes her.", "frequency": 2, "id": 70, "text": "as gentle as a lamb"}, {"category": "religion", "definition": "Someone who is very patient.", "example": "If you want to work with that temperamental woman you must be as patient as Job.", "frequency": 0, "id": 71, "text": "as patient as Job"}, {"category": "religion", "definition": "Someone who does not have money.", "example": "He is as poor as a church mouse, don't ask him to donate anything.", "frequency": 0, "id": 72, "text": "as poor as a church mouse"}, {"category": "religion", "definition": "Something aesthetically not pleasing.", "example": "Jesus Christ! The dress she is wearing is as ugly as sin.", "frequency": 1, "id": 73, "text": "as ugly as sin"}, {"category": "language", "definition": "This idiom means that you are unable to speak.", "example": "He treated her so badly that she was completely at a loss for words.", "frequency": 89, "id": 74, "text": "at a loss for words"}, {"category": "colors", "definition": "Covered in bruises", "example": "He was black and blue the day after the accident", "frequency": 44, "id": 161, "text": "black and blue"}, {"category": "parts of the body", "definition": "This idiom means nearby, or close by in time or in space.", "example": "A new cure for AIDS is at hand.", "frequency": 3027, "id": 77, "text": "at hand"}, {"category": "numbers", "definition": "This idiom is used to describe a state of confusion or disarray.", "example": "John is at sixes and sevens after the death of his wife.", "frequency": 0, "id": 78, "text": "at sixes and sevens"}, {"category": "clothes", "definition": "To do it without delay or good reason.", "example": "So many years of sacrifice and then you can leave me at the drop of a hat.", "frequency": 139, "id": 79, "text": "at the drop of a hat"}, {"category": "travel", "definition": "Driving, in control of a vehicle.", "example": "You know he fell asleep at the wheel. They were so lucky they didn't have an accident.", "frequency": 102, "id": 80, "text": "at the wheel"}, {"category": "parts of the body", "definition": "Said about something that you learned when you were a child.", "example": "She learned to sing at her mother's knee.", "frequency": 0, "id": 81, "text": "at your mother's knee"}, {"category": "parts of the body", "definition": "This idiom refers to recovering from an illness or from a problem.", "example": "I am broke for the moment, but I'll get back on my feet as soon as I start working again.", "frequency": 0, "id": 82, "text": "back on one's feet"}, {"category": "animals", "definition": "to support someone or something that later cannot be successful.", "example": "Don't back the wrong horse! You know he cannot win the elections.", "frequency": 0, "id": 83, "text": "back the wrong horse"}, {"category": "travel", "definition": "A passenger in a car who insists on giving the driver directions.", "example": "My brother is such a backseat driver. I hate traveling with him.", "frequency": 12, "id": 85, "text": "backseat driver"}, {"category": "relationship", "definition": "Unpleasant feeling between different people.", "example": "There is bad blood between Nancy and Leila. They are rarely in good terms with each other.", "frequency": 48, "id": 86, "text": "bad blood"}, {"category": "food", "definition": "Bad person", "example": "Just ignore him. He's a bad egg.", "frequency": 26, "id": 87, "text": "bad egg"}, {"category": "health", "definition": "An extremely thin person.", "example": "He's turning into a bag of bones. He lost so much weight.", "frequency": 24, "id": 88, "text": "bag of bones"}, {"category": "general", "definition": "A set of techniques and methods.", "example": "Why don't you use your bag of tricks to help us solve this problem?", "frequency": 113, "id": 89, "text": "bag of tricks"}, {"category": "sport", "definition": "A person who is especially hard-working, high-achieving, ambitious, or active.", "example": "They say he is a real ball of fire. He has already demonstrated his wish to climb higher.", "frequency": 13, "id": 90, "text": "ball of fire"}, {"category": "sport", "definition": "To make a mess of, destroy or ruin, to interfere with someone or something.", "example": "Someone has balled my car up.", "frequency": 0, "id": 91, "text": "ball someone or something up"}, {"category": "sport", "definition": "This refers either to a job or situation that is demanding and arduous and punishing or to a demanding woman who destroys men's confidence.", "example": "My job is such a ball-breaker! My boss expects me to work over the weekend again.", "frequency": 2, "id": 92, "text": "ball-breaker"}, {"category": "food", "definition": "A small country, especially one in Central America, that is dependent on a single export commodity and that has a corrupt, dictatorial government.", "example": "Banana republic countries need democratization.", "frequency": 0, "id": 93, "text": "banana repulic"}, {"category": "money", "definition": "To expect something or rely on.", "example": "Can I bank on your friend's predictions about the stock market?", "frequency": 65, "id": 94, "text": "bank on"}, {"category": "religion", "definition": "This idiom refers to a very difficult first experience someone undergoes.", "example": "My first day as the manager of the restaurant was a real baptism of fire.", "frequency": 4, "id": 95, "text": "baptism of fire"}, {"category": "general", "definition": "Be enjoyable or entertaining.", "example": "This movie is a real barrel of laughs.", "frequency": 0, "id": 96, "text": "be a barrel of laughs"}, {"category": "animals", "definition": "Be a coward.", "example": "Don't be a chicken. Talk to her about your love for her.", "frequency": 3, "id": 97, "text": "be a chicken"}, {"category": "animals", "definition": "Be a person who is distant and unfeeling", "example": "He rarely talks to his colleagues. He's a cold fish.", "frequency": 0, "id": 98, "text": "be a cold fish"}, {"category": "relationship", "definition": "Said about a couple when they are having a romantic relationship.", "example": "I heard that Leila and Joe are an item.", "frequency": 4, "id": 99, "text": "be an item"}, {"category": "sexuality", "definition": "Said about something which is very enjoyable or exciting.", "example": "Riding a horse is a real fun. It's better than sex.", "frequency": 1, "id": 100, "text": "be better than sex"}, {"category": "nature", "definition": "Said when something has no chance of succeeding or of making any progress.", "example": "Our projects will be dead in the water if we don't have a good plan.", "frequency": 2, "id": 101, "text": "be dead in the water"}, {"category": "nature", "definition": "To be sleeping.", "example": "I think she has woken up. She was dead to the world ten minutes ago.", "frequency": 0, "id": 103, "text": "be dead to the world"}, {"category": "health", "definition": "Said about someone who is active, lively, healthy and has a lot of energy and enthusiasm.", "example": "He's always full of beans when he goes to work.", "frequency": 0, "id": 104, "text": "be full of beans"}, {"category": "parts of the body", "definition": "To be happy to get rid of someone, to be happy because someone has left.", "example": "The youg man was glad to see the back of his father-in-law after he had stayed for a month.", "frequency": 0, "id": 105, "text": "be glad to see the back of someone"}, {"category": "colors", "definition": "To be written down.", "example": "My conditions to accept the job were in black and white in the contract.", "frequency": 1, "id": 106, "text": "be in black and white"}, {"category": "nature", "definition": "To be in serious trouble.", "example": "The government is in deep water because of its plans for tax increases.", "frequency": 0, "id": 107, "text": "be in deep water"}, {"category": "nature", "definition": "To be in a difficult situation", "example": "He was in hot water because of his speech about racism.", "frequency": 4, "id": 108, "text": "be in hot water"}, {"category": "clothes", "definition": "To be in the situation that another person is in.", "example": "I wouldn't like to be in Nancy's shoes. She'll have a lot of problems with her boss.", "frequency": 0, "id": 109, "text": "be in somebody's shoes"}, {"category": "nature", "definition": "Be awake or to be alive.", "example": "He was working all night long. I don't think he'll be in the land of the living before noon.", "frequency": 0, "id": 110, "text": "be in the land of the living"}, {"category": "animals", "definition": "To feel uncomfortable in a situation.", "example": "After her divorce, she was like a fish out of water.", "frequency": 0, "id": 111, "text": "be like a fish out of water"}, {"category": "sport", "definition": "This idiom refers to a lack of experience in a particular activity.", "example": "I can't teach this class. I have never had any training in teaching mathematics. I am new to the game.", "frequency": 0, "id": 112, "text": "be new to the game"}, {"category": "art", "definition": "Someone who is not good-looking.", "example": "She is very intelligent, but she's no oil painting.", "frequency": 0, "id": 113, "text": "be no oil painting"}, {"category": "food", "definition": "Someone who is very enthusiastic about it or greatly in love with it.", "example": "He's nuts about books.", "frequency": 2, "id": 114, "text": "be nuts about"}, {"category": "numbers", "definition": "Feel extreme happiness or elation", "example": "She was on cloud nine when he proposed to marry her.", "frequency": 0, "id": 115, "text": "be on cloud nine"}, {"category": "sport", "definition": "To be well-informed and respond promptly.", "example": "We need someone who's on the ball to help us implement our plan.", "frequency": 5, "id": 116, "text": "be on the ball"}, {"category": "furniture", "definition": "Someone who has been somewhere so long as to seem an integral part of the place.", "example": "She worked for that company for so long that she became part of the furniture.", "frequency": 0, "id": 117, "text": "be part of the furniture"}, {"category": "health", "definition": "This idiom means to be angry and bored because something unpleasant has been happening for a long time.", "example": "I'm sick and tired of hearing your excuses!", "frequency": 0, "id": 118, "text": "be sick and tired of"}, {"category": "work", "definition": "An accountant.", "example": "The company is hiring a new accountant.", "frequency": 49, "id": 120, "text": "bean counter"}, {"category": "food", "definition": "This idiom means to yield successful results.", "example": "He thinks his new plan will undoubtedly bear fruit.", "frequency": 41, "id": 121, "text": "bear fruit"}, {"category": "religion", "definition": "To endure burden or difficulties.", "example": "I know it is a difficult situation you are experiencing, but you have to bear your own cross. I can't help you. I am sorry.", "frequency": 0, "id": 122, "text": "bear one's cross"}, {"category": "animals", "definition": "To persist or continue far beyond any purpose, interest or reason.", "example": "If you continue talking about something that cannot be changed, you are beating a dead horse.", "frequency": 18, "id": 123, "text": "beat a dead horse"}, {"category": "sport", "definition": "To leave hastily in the face of opposition.", "example": "When they saw the police coming, they beat a retreat.", "frequency": 0, "id": 124, "text": "beat a retreat"}, {"category": "nature", "definition": "To treat a topic, without mentioning its main points, often intentionally, because the topic is difficult or unpleasant.", "example": "Stop beating around the bush and tell me what the the problem is!", "frequency": 81, "id": 125, "text": "beat around the bush"}, {"category": "time", "definition": "To do something before a deadline.", "example": "They managed to beat the clock and arrive a few minutes before the conference started.", "frequency": 19, "id": 126, "text": "beat the clock"}, {"category": "crime", "definition": "To evade conviction and punishment for a crime.", "example": "The lawyer helped John beat the rap after being caught by the police.", "frequency": 2, "id": 127, "text": "beat the rap"}, {"category": "sport", "definition": "I don't know, I have no idea.", "example": "What's the longest river in the world? Answer: Beats me!", "frequency": 59, "id": 128, "text": "beats me"}, {"category": "animals", "definition": "To strengthen or make something more effective.", "example": "They beefed up their offer with another million dollar.", "frequency": 105, "id": 129, "text": "beef up"}, {"category": "names", "definition": "Very quickliy.", "example": "He can do difficult mathemaical operations before you can say Jack Robinson.", "frequency": 0, "id": 130, "text": "before you can say Jack Robinson"}, {"category": "general", "definition": "In jail or prison.", "example": "That guy over there has been behind bars for five years.", "frequency": 167, "id": 131, "text": "behind bars"}, {"category": "general", "definition": "In private, in one's private life.", "example": "What you do with your partners behind closed doors is none of my business.", "frequency": 199, "id": 132, "text": "behind closed doors"}, {"category": "technology and science", "definition": "This idiom refers to extra, fancy add-ons or gadgets on something like a phone, a car or a computer.", "example": "This cars is loaded with all the bells and whistles, but it's too expensive.", "frequency": 352, "id": 134, "text": "bells and whistles"}, {"category": "food", "definition": "To be common or of low standing.", "example": "In medieval times servants used to sit below the salt.", "frequency": 1, "id": 135, "text": "below the salt"}, {"category": "law", "definition": "This idiom means to cheat a little bit without breaking the law.", "example": "He just bent the law a little bit to get what he wanted.", "frequency": 19, "id": 136, "text": "bend the law"}, {"category": "names", "definition": "This regers to the youngest child of the family.", "example": "Bill is the benjamin of the family.", "frequency": 0, "id": 137, "text": "Benjamin of the family"}, {"category": "money", "definition": "This idiom is used to say that one can be sure about something.", "example": "You can bet your bottom dollar. The whole thing will end tragically.", "frequency": 23, "id": 138, "text": "bet your bottom dollar"}, {"category": "religion", "definition": "It is sometimes better to deal with someone or thing you know than to deal with a new person or thing who could be even worse.", "example": "Nancy is such a difficult girl to work with, but better the devil you know.", "frequency": 2, "id": 139, "text": "better the devil you know"}, {"category": "death", "definition": "A situation involving the danger of dying or being killed.", "example": "The little kid lay all night long between life and death.", "frequency": 134, "id": 140, "text": "between life and death"}, {"category": "religion", "definition": "This idiom is referring to a dilemma, a choice between two undesirable situations.", "example": "She is caught between the devil and the deep blue sea. She has to choose between staying with her nasty husband and leaving him, taking care of her children all alone.", "frequency": 0, "id": 142, "text": "between the devil and the deep blue sea"}, {"category": "language", "definition": "This idiom refers to an overwhelming situation where one cannot find words to express ones emotions.", "example": "I am thankful beyond words.", "frequency": 478, "id": 143, "text": "beyond words"}, {"category": "dreams", "definition": "This idiom means in a way you had never imagined before.", "example": "They have become rich beyond their wildest dreams.", "frequency": 25, "id": 144, "text": "beyond your wildest dreams"}, {"category": "food", "definition": "Nickname for New York City.", "example": "Have you visited the official website of the Big Apple?", "frequency": 387, "id": 145, "text": "Big Apple"}, {"category": "money", "definition": "Lots of money.", "example": "The new managing director must be making big bucks after his promotion.", "frequency": 286, "id": 146, "text": "big bucks"}, {"category": "food", "definition": "This idiom refers to an important or influential person in a group or organization.", "example": "Don't act like a big shot among your old friends", "frequency": 4, "id": 147, "text": "big cheese"}, {"category": "general", "definition": "Something very important, difficult, or of concern.", "example": "It's no big deal if you don't finish.", "frequency": 1765, "id": 148, "text": "big deal"}, {"category": "animals", "definition": "One who has achieved a high rank or is highly esteemed, but only in a small, relatively unimportant, or little known location or organization.", "example": "Dr. Jones could get a professorship at an Ivy League university, but he enjoys being a big fish in a small pond too much to ever leave Hanover College.", "frequency": 6, "id": 149, "text": "big fish in a small pond"}, {"category": "animals", "definition": "This idiom refers to a very important person in a place where there are less important people. This idiom alludes to a large frog that dominates other less challenging frogs.", "example": "He is a big frog in a small pond. He has nobody to compete with in this company.", "frequency": 0, "id": 150, "text": "big frog in a small pond"}, {"category": "clothes", "definition": "This idiom refers to an effeminate or weak man or boy.", "example": "Don't care about what he is saying! Let's go! He's just a big girl's blouse.", "frequency": 0, "id": 151, "text": "big girl's blouse"}, {"category": "parts of the body", "definition": "This idiom refers to a conceited or arrogant person.", "example": "She is such a bighead!", "frequency": 100, "id": 152, "text": "big head"}, {"category": "parts of the body", "definition": "Said about someone who tend to say things which are meant to be kept secret.", "example": "He is such a big mouth.He told them every thing.", "frequency": 83, "id": 153, "text": "big mouth"}, {"category": "general", "definition": "A person with a great deal of power or influence, especially a high-ranking person in an organization.", "example": "She's a big wheel at IBM.", "frequency": 30, "id": 154, "text": "big wheel"}, {"category": "animals", "definition": "This idiom refers to a view seen from high above. Figuratively the phrase means a brief survey of something or a quick look at something.", "example": "We got a bird's-eye view of the town from th top of the high building.", "frequency": 29, "id": 155, "text": "bird's-eye view"}, {"category": "clothes", "definition": "This idiom is a slang term for the naked human body.", "example": "It was embarrassing for her to be seen in her birthday suit.", "frequency": 10, "id": 156, "text": "birthday suit"}, {"category": "general", "definition": "An expression of discontent, aggravation or anger.", "example": "Why are you shouting like that? Oh, bite me!", "frequency": 18, "id": 157, "text": "bite me"}, {"category": "death", "definition": "To die", "example": "Too many soldiers bit the dust in the second world war.", "frequency": 17, "id": 158, "text": "bite the dust"}, {"category": "parts of the body", "definition": "To make an effort not to react to something.", "example": "He didn't like the management of the business but he had to bite his lip.", "frequency": 1, "id": 159, "text": "bite your lip"}, {"category": "health", "definition": "Said about something unpleasant that must be accepted or endured.", "example": "After the disappointment and defeat, to declare bankruptcy was a bitter pill to swallow for him.", "frequency": 8, "id": 160, "text": "bitter pill to swallow"}, {"category": "art", "definition": "This idiom refers to something with no content such that it can be easily filled with completely new things.", "example": "Children are blank canvasses. It's easy to make them believe whatever you want.", "frequency": 38, "id": 165, "text": "blank canvas"}, {"category": "money", "definition": "This phrase is used to mean that one is given an unlimited freedom of action.", "example": "The president has been given a blank check to conduct a war against the enemy.", "frequency": 0, "id": 166, "text": "blank cheque"}, {"category": "time", "definition": "The phrase refers to something or someone from your past that reappeared into your life again.", "example": "I used to watch this animated cartoon when I was a kid. What a blast from the past!", "frequency": 173, "id": 167, "text": "blast from the past"}, {"category": "general", "definition": "This idiom is said when a misfortune has some unexpected benefits", "example": "His failure to pass the exam was a blessing in disguise. This made him realize the importance of hard work.", "frequency": 0, "id": 168, "text": "blessing in desguise"}, {"category": "love", "definition": "A social meeting where the two people have never met before.", "example": "I went on a blind date yesterday but it was a total fiasco.", "frequency": 110, "id": 169, "text": "blind date"}, {"category": "relationship", "definition": "Family relations are more important than all other relationships.", "example": "Even if Nancy and her brother often argue, they always forgive each other. Blood is thicker than water.", "frequency": 1, "id": 170, "text": "blood is thicker than water"}, {"category": "technology and science", "definition": "become uncontrolably angry, lose your temper.", "example": "Hey, don't blow a fuse.", "frequency": 12, "id": 171, "text": "blow a fuse"}, {"category": "general", "definition": "To kiss one's hand, then blow on the hand in a direction towards the recipient.", "example": "We haven't yet kissed, but she blew me a kiss as the train pulled out of the station. That meant a lot to me", "frequency": 0, "id": 172, "text": "blow a kiss"}, {"category": "music", "definition": "To brag, to talk boastfully.", "example": "Nancy likes to blow her own horn.", "frequency": 0, "id": 173, "text": "blow one's own horn"}, {"category": "colors", "definition": "A person highly regarded by someone and treated with special favor", "example": "He was the blue-eyed boy of the boss.", "frequency": 4, "id": 174, "text": "blue-eyed boy"}, {"category": "weather", "definition": "This refers to thinking that is unrealistic. This phrase may also refer to creative ideas that diverge from current beliefs or ideas.", "example": "Blue-sky thinking has long been denigrated, and because of the economic recession, such fanciful thinking may even be considered downright irresponsible.", "frequency": 0, "id": 175, "text": "blue-sky thinking"}, {"category": "names", "definition": "Said to mean \"No problem\", \"the solution is simple\", \"there you have it\" (appended to the end of a description of how to achieve something).", "example": "You want to go to the stadium? Go straight on until you reach the park, take the first left and Bob's your uncle!", "frequency": 0, "id": 176, "text": "Bob's your uncle"}, {"category": "weather", "definition": "This refers to a complete surprise, something totally unexpected. In this phrase there is an allusion to a stroke of lightning from a clear blue sky.", "example": "The news that they are getting a divorce was a bolt from the blue.", "frequency": 4, "id": 178, "text": "bolt from the blue"}, {"category": "clothes", "definition": "The ground forces actually fighting in a war or conflict at the time of speaking, rather than troops not engaged or being transported to the fighting.", "example": "The Pentagon may say we have enough, but that's not what I'm hearing from the boots on the ground.", "frequency": 14, "id": 179, "text": "boots on the ground"}, {"category": "colors", "definition": "Someone born into a reigning family or privileged class.", "example": "She was the only child born to the purple.", "frequency": 7, "id": 180, "text": "born to the purple"}, {"category": "general", "definition": "This idiom refers to someone with a seemingly boundless appetite.", "example": "He eats every last bit of food in the house. He is really a bottomless pit.", "frequency": 35, "id": 181, "text": "bottomless pit"}, {"category": "work", "definition": "To work very hard to do something.", "example": "I am not going to break my back to this job for such a low salary.", "frequency": 3, "id": 182, "text": "break your back"}, {"category": "death", "definition": "This idiom means to die.", "example": "After he had suffered from leukemia for years, he breathed his last at about three o'clock in the morning.", "frequency": 0, "id": 183, "text": "breathe one's last"}, {"category": "technology and science", "definition": "Intelligent.", "example": "He has a daughter who is as bight as a button.", "frequency": 0, "id": 184, "text": "bright as a button"}, {"category": "war", "definition": "To enter into a confrontation or other challenging situation without being adequately equipped or prepared.", "example": "We lost the deal against much equipped competitors because we brought a knife to a gunfight.", "frequency": 0, "id": 185, "text": "bring a knife to a gunfight"}, {"category": "food", "definition": "get a job and bring home money earned from this job.", "example": "When her husband got fired, she decided to look for a job because someone's got to bring home the bacon.", "frequency": 2, "id": 186, "text": "bring home the bacon"}, {"category": "furniture", "definition": "This idiom means to bring something to an end.", "example": "I am asking for a divorce. It's time to bring the curtain down.", "frequency": 7, "id": 187, "text": "bring the curtain down"}, {"category": "parts of the body", "definition": "To destroy or defeat someone or something.", "example": "The strikes brought the economy to its knees.", "frequency": 0, "id": 188, "text": "bring to knees"}, {"category": "furniture", "definition": "This idiom means to contribute something to a group effort.", "example": "It is all about you bring to the table.", "frequency": 84, "id": 189, "text": "bring to the table"}, {"category": "dreams", "definition": "This idiom refers to plans or goals that didn't come true.", "example": "Jane had her share of broken dreams in her marriage.", "frequency": 63, "id": 190, "text": "broken dreams"}, {"category": "colors", "definition": "Annoyed, upset, angry, bored, fed up, disgusted.", "example": "He was browned off when he was ill treated.", "frequency": 0, "id": 191, "text": "browned off"}, {"category": "relationship", "definition": "To improve relationships between people.", "example": "They wanted to build bridges between Nancy and Alan to settle the conflict once for all.", "frequency": 42, "id": 192, "text": "build bridges"}, {"category": "work", "definition": "To work very hard, day and night.", "example": "She has been burning candles at both ends to finish a book about the history of the United States of America.", "frequency": 0, "id": 193, "text": "burn candles at both ends"}, {"category": "parts of the body", "definition": "To suffer consequences of one's actions.", "example": "He burned his fingers in the stock market.", "frequency": 0, "id": 194, "text": "burn one's fingers"}, {"category": "work", "definition": "Work hard, especially late into the night.", "example": "She was burning the midnight oil preparing for her daughter's wedding when she had a heart attack.", "frequency": 3, "id": 195, "text": "burn the midnight oil"}, {"category": "war", "definition": "The phrase means to make peace.", "example": "John and Alan buried the hatchet and are now good friends.", "frequency": 10, "id": 196, "text": "bury the hatchet"}, {"category": "food", "definition": "To praise or flatter excessively.", "example": "Why are you buttering up the boss?", "frequency": 2, "id": 197, "text": "butter up"}, {"category": "technology and science", "definition": "To stop talking.", "example": "Please, button up your lip and keep the news secret till tomorrow.", "frequency": -2, "id": 198, "text": "button (up) one's lip"}, {"category": "religion", "definition": "Through the kindness and help of God.", "example": "By the grace of God, his son managed to pass the exam.", "frequency": 77, "id": 199, "text": "by the grace of God"}, {"category": "names", "definition": "Called.", "example": "I met a doctor by the name of John.", "frequency": 757, "id": 200, "text": "by the name of"}, {"category": "numbers", "definition": "This idiom means doing something in a strict, mechanical way, without using your imagination or creativity.", "example": "His work is done by the numbers. There is nothing original about it!", "frequency": 118, "id": 201, "text": "by the numbers"}, {"category": "dreams", "definition": "To express skepticism and say that something is unlikely to happen.", "example": "I think Jane is mad about me. Dream on!", "frequency": 82, "id": 325, "text": "dream on"}, {"category": "health", "definition": "To inform your employer that you will be absent because you are ill.", "example": "Why don't you call in sick and go with us to the beach?", "frequency": 5, "id": 204, "text": "call in sick"}, {"category": "time", "definition": "To stop working for the rest of the day.", "example": "Why don't we call it a day? I'm really tired.", "frequency": 49, "id": 205, "text": "call it a day"}, {"category": "animals", "definition": "Said when you want someone to stop criticizing you.", "example": "Please, call off the dogs. I apologize for what I have done.", "frequency": 0, "id": 206, "text": "call off the dogs"}, {"category": "furniture", "definition": "To reprimand, to censure severely or angrily.", "example": "I hope he wouldn't be called on the carpet by the boss.", "frequency": 0, "id": 207, "text": "call on the carpet"}, {"category": "names", "definition": "To call someone by unpleasant, abusive or insulting names.", "example": "because he called his teacher names, Bill was punished.", "frequency": 0, "id": 208, "text": "call someone names"}, {"category": "war", "definition": "To be in charge. To decide on the course of action and take the initiative.", "example": "This is my wedding party, I will call the shots.", "frequency": 16, "id": 209, "text": "call the shots"}, {"category": "music", "definition": "To be the one who controls a situation, to have the most power and authority in a situation", "example": "In any deal you have with banks, it's them who call the tune.", "frequency": 2, "id": 210, "text": "call the tune"}, {"category": "nature", "definition": "An unussual or false quiet period before a period of upheaval.", "example": "The negotiation between the two parties may be peaceful now. But don't be misled! This is only the calm before the storm.", "frequency": 35, "id": 211, "text": "calm before the storm"}, {"category": "parts of the body", "definition": "This idiom means not to be able to tolerate someone or something.", "example": "She cannot stomach his silly remarks.", "frequency": 0, "id": 212, "text": "cannot stomach someone or something"}, {"category": "names", "definition": "This idiom is used in conversation to draw attention to a self-evident fact.", "example": "Did you know that the earth turns around the sun? Yes, thank you, Captain Obvious!", "frequency": 7, "id": 213, "text": "Captain Obvious"}, {"category": "food", "definition": "An offer involving a reward countered by the threat of punishment.", "example": "The president took a carrot and stick approach to the protests against his new laws.", "frequency": 13, "id": 214, "text": "carrot and stick"}, {"category": "music", "definition": "This idiom means to sing a melody accurately.", "example": "I can't carry a tune, but my sister sings very well.", "frequency": 44, "id": 215, "text": "carry a tune"}, {"category": "sport", "definition": "To take charge and control of an activity and be considered reliable enough to do a job.", "example": "He can't carry the ball. He isn't reliable.", "frequency": 5, "id": 216, "text": "carry the ball"}, {"category": "general", "definition": "An example that illustrates a point", "example": "Plaing with these toys can be dangerous. For a case in point, look at what happened to our neighbor's child.", "frequency": 326, "id": 217, "text": "case in point"}, {"category": "law", "definition": "Separate and distinct from others of the same kind.", "example": "All applications are scrutinized on a case-by-case basis.", "frequency": 52, "id": 218, "text": "case-by-case"}, {"category": "animals", "definition": "This idiom refers to someone or something that generates a steady return of profits, a moneymaker.", "example": "The young actress turned out to be the cash cow for most Hollywood studios.", "frequency": 72, "id": 219, "text": "cash cow"}, {"category": "nature", "definition": "Plans that are unlikely to happen.", "example": "Before you start building castles in the air, just think how much all this is likely to cost.", "frequency": 9, "id": 220, "text": "castles in the air"}, {"category": "crime", "definition": "This idiom refers to a thief who enters a building by skillfully climbing to a building without attracting notice.", "example": "He was known for being a cat burglar who only stole from apartments in high buildings", "frequency": 22, "id": 221, "text": "cat burglar"}, {"category": "parts of the body", "definition": "This idiom means to get someone's attention.", "example": "It was her beautiful hair that caught my eye.", "frequency": 1, "id": 222, "text": "catch someone's eye"}, {"category": "time", "definition": "This idiom means to remain unchanged from a time in the past although everything else has.", "example": "The town seems to be caught in a time warp. People there are living as if they were still in the middle age.", "frequency": 3, "id": 223, "text": "caught in a time warp"}, {"category": "general", "definition": "To attribute a failure to inexperience and learn from that particular experience.", "example": "Chalk it up to inexperience, I guess, but he made a very poor decision.", "frequency": 0, "id": 225, "text": "chalk something up to inexperience"}, {"category": "home", "definition": "This idiom means that, before deciding to take care of other people, one's family should be one's foremost concern.", "example": "Take care of your children before volunteering in any association. Charity begins at home.", "frequency": 6, "id": 226, "text": "charity begins at home"}, {"category": "life", "definition": "This idiom refers to a life protected as if by magic charms. It describes a person who is very lucky and is strangely unaffected by dangers and difficulties.", "example": "Everybody believes that he leads a charmed life. He was lucky enough to survive after a terrible car accident.", "frequency": 65, "id": 227, "text": "charmed life"}, {"category": "weather", "definition": "This idiom is used when someone tries to pursue unrealistic or fanciful goals, things that are impossible.", "example": "He thought he could convince the boss to appoint him as the new manager, but in fact he was chasing rainbows.", "frequency": 0, "id": 228, "text": "chase rainbows"}, {"category": "food", "definition": "This idiom means to ponder over or meditate about something, to think carefully about something.", "example": "She wanted to chew the cud before she could let them know about her decision.", "frequency": 1, "id": 229, "text": "chew the cud"}, {"category": "food", "definition": "To waste time talking or to chat idly.", "example": "As she had nothing to do, she wasted time chewing the fat with the neighbor.", "frequency": 3, "id": 230, "text": "chew the fat"}, {"category": "animals", "definition": "To refuse to do something because of fear.", "example": "He chickened out just at the time they were taking him to operating theatre.", "frequency": 7, "id": 231, "text": "chicken out"}, {"category": "animals", "definition": "Not brave.", "example": "They are just chicken-hearted boys. They can't defend themselves from any attacks.", "frequency": 1, "id": 232, "text": "chicken-hearted"}, {"category": "music", "definition": "Talk, conversation", "example": "When they meet, there will be plenty of chin music.", "frequency": 5, "id": 233, "text": "chin music"}, {"category": "music", "definition": "To be perfectly clean.", "example": "She's clean as a whistle.", "frequency": 2, "id": 234, "text": "clean as a whistle"}, {"category": "technology and science", "definition": "This idiom means to immediately like someone or something.", "example": "His idea clicked with Leila at once.", "frequency": 0, "id": 235, "text": "click with someone or something"}, {"category": "time", "definition": "To register one's arrival at work", "example": "They clocked on as soon as they arrived at work.", "frequency": 60, "id": 236, "text": "clock on"}, {"category": "time", "definition": "To register one's departure from work.", "example": "They clocked out early in order to be on time for the concert.", "frequency": 9, "id": 237, "text": "clock out"}, {"category": "home", "definition": "To affect you personally.", "example": "His criticism was a bit too close to home. She couldn't bear the way he talked about her work.", "frequency": 481, "id": 238, "text": "close to home"}, {"category": "clothes", "definition": "This idiom means that people are judged according to the way they are dressed.", "example": "Clothes make the man. Naked people have little or no influence in society.", "frequency": 1, "id": 239, "text": "Clothes make the man"}, {"category": "weather", "definition": "This idiom is used to mean that you are in a state of extreme happiness.", "example": "He was on cloud nine after he passed the exam.", "frequency": 28, "id": 240, "text": "cloud nine"}, {"category": "animals", "definition": "This idiom refers to a story or explanation which is obviously not true.", "example": "Jane came home very late last night and gave her mother some cock-and-bull story about how she had to help her friend find her keys.", "frequency": 0, "id": 241, "text": "cock-and-bull story"}, {"category": "money", "definition": "Earning a lot of money quickly.", "example": "The company has been coining money since the new manager took over.", "frequency": 0, "id": 243, "text": "coining money"}, {"category": "religion", "definition": "This idiom is used to mean that something will never happen.", "example": "It'll be a cold day in hell before I accept his apologies.", "frequency": 1, "id": 244, "text": "cold day in hell"}, {"category": "work", "definition": "To be difficult to deal with.", "example": "Did you see how she treats her husband? She is a cold piece of work.", "frequency": 0, "id": 245, "text": "cold piece of work"}, {"category": "general", "definition": "To be honest and tell the truth.", "example": "She came clean about what she had done.", "frequency": 88, "id": 246, "text": "come clean"}, {"category": "sport", "definition": "To hit or punish somebody.", "example": "I'll come down on you like a ton of bricks if you do that once again!", "frequency": 0, "id": 247, "text": "come down on somebody like a ton of bricks"}, {"category": "sport", "definition": "To win after being in a losing position in a game.", "example": "The young boxer came from behind to beat the world champion.", "frequency": 15, "id": 248, "text": "come from behind"}, {"category": "nature", "definition": "To start to produce flowers.", "example": "Look at the roses are just coming into bloom.", "frequency": 0, "id": 250, "text": "come into bloom"}, {"category": "money", "definition": "To get some money unexpectedly, usually by inheritance.", "example": "He came into a lot of money.", "frequency": 7, "id": 251, "text": "come into money"}, {"category": "age", "definition": "This idiom means to reach adulthood.", "example": "His son has come of age.", "frequency": 175, "id": 252, "text": "come of age"}, {"category": "sexuality", "definition": "This idiom means to admit publicly one's homosexuality.", "example": "He came out of the closet when he went to university.", "frequency": 80, "id": 253, "text": "come out of the closet"}, {"category": "home", "definition": "This idiom means to emerge suddenly and unexpectedly", "example": "He came out of the woodwork to disturb my quiet night.", "frequency": 15, "id": 254, "text": "come out of the woodwork"}, {"category": "parts of the body", "definition": "This idiom is used to indicate that a situation suddenly becomes worse.", "example": "They didn't like each other and things came to a head when she asked for divorce.", "frequency": 118, "id": 256, "text": "come to a head"}, {"category": "sport", "definition": "To have fight or an argument with someone.", "example": "Negotiators are trying not to come into blows over their territorial dispute.", "frequency": 10, "id": 257, "text": "come to blows"}, {"category": "food", "definition": "This idiom means to become reality or to be completed as planned.", "example": "I have never been able to bring my dreams to fruition.", "frequency": 140, "id": 258, "text": "come to fruition"}, {"category": "general", "definition": "To gradually accept a sad situation.", "example": "I think he will come to terms with the death of his wife.", "frequency": 1133, "id": 259, "text": "come to terms with"}, {"category": "general", "definition": "Said when you notice something.", "example": "It has recently come to the workers attention that changes are taking place in the company because of financial problems.", "frequency": 0, "id": 260, "text": "come to your attention"}, {"category": "general", "definition": "Said when something happens although it was unlikely that it would.", "example": "Her dream of buying a new car finally came true.", "frequency": 1580, "id": 261, "text": "come true"}, {"category": "nature", "definition": "To be subject of criricism.", "example": "The president has come under fire for his decision to postpone the elections.", "frequency": 22, "id": 262, "text": "come under fire"}, {"category": "general", "definition": "Low class, unrefined, ill-mannered, uncouth.", "example": "That girl is common as an old shoe.", "frequency": 0, "id": 263, "text": "common as an old shoe"}, {"category": "men and women", "definition": "This idiom refers to a worker who is more loyal to his employer than to his fellow workers.", "example": "He's never criticized the boss, he has always been a company man.", "frequency": 102, "id": 264, "text": "company man"}, {"category": "art", "definition": "This idiom refers to a person who makes a living by swindling people.", "example": "Many con artists target the elderly by trying to gain their confidence.", "frequency": 400, "id": 265, "text": "con artist"}, {"category": "food", "definition": "Very calm.", "example": "It's amazing that he never shows his emotions even when he has a lot of problems. He's cool as a cucumber.", "frequency": 7, "id": 266, "text": "cool as a cucumber"}, {"category": "age", "definition": "This idiom refers to a very long period of time.", "example": "It's been a coon's age since I last went to the theater.", "frequency": 1, "id": 267, "text": "coon's age"}, {"category": "parts of the body", "definition": "This idiom refers to something that is extremely expensive.", "example": "It cost me a bomb.", "frequency": 0, "id": 268, "text": "cost a bomb"}, {"category": "money", "definition": "To be extremely expensive.", "example": "He bought a new house. It cost him an arm and a leg.", "frequency": 19, "id": 269, "text": "cost an arm and a leg"}, {"category": "food", "definition": "Lazy person.", "example": "He is a couch potato.", "frequency": 181, "id": 270, "text": "couch potato"}, {"category": "animals", "definition": "To assume success too early, before it is certain.", "example": "It's too soon to cry victory. Don't count your chicken before they hatch!", "frequency": 0, "id": 271, "text": "count one's chickens before they hatch"}, {"category": "food", "definition": "This idiom means the best of all.", "example": "Don't worry about your studies, you are the cream of the crop.", "frequency": 191, "id": 272, "text": "cream of the crop"}, {"category": "crime", "definition": "This idiom is used to suggest that crime will ultimately not benefit a person.", "example": "Doing something illegal to get money may be tempting for some, but in fact crime doesn't pay.", "frequency": 8, "id": 273, "text": "crime doesn't pay"}, {"category": "war", "definition": "To quarrel or argue with someone, to have a dispute with someone.", "example": "The boss didn't want to cross swords with the workers' union.", "frequency": 4, "id": 274, "text": "cross swords"}, {"category": "religion", "definition": "This idiom refers to the most important point of an issue.", "example": "I think his new revelations about the company is the crux of the matter.", "frequency": 29, "id": 275, "text": "crux of the matter"}, {"category": "animals", "definition": "To ask for help when there is really no danger.", "example": "Because he cried wolf too often, people stopped believing that he needs help.", "frequency": 16, "id": 276, "text": "cry wolf"}, {"category": "love", "definition": "This idiom refers to affection that is given purely to gain something from someone.", "example": "It was just cupboard love, and what she really wanted was the money she used to get from him.", "frequency": 0, "id": 277, "text": "cupboard love"}, {"category": "animals", "definition": "This idiom is used to warn someone not to be too curious about something and ask too many questions because this can get you into trouble.", "example": "I wonder who killed that wealthy man? Curiosity killed the cat.", "frequency": 4, "id": 278, "text": "curiosity killed the cat"}, {"category": "parts of the body", "definition": "An upward movement of the side of the mouth to show dislike and disrespect.", "example": "He asked her not curl her lip at him.", "frequency": 0, "id": 279, "text": "curl your lip"}, {"category": "furniture", "definition": "To dance.", "example": "The couple impressed everybody when they cut a rug at the party.", "frequency": 1, "id": 280, "text": "cut a rug"}, {"category": "parts of the body", "definition": "This idiom means to bring about one's own ruin and downfall.", "example": "Corrupt cops are cutting their own throats.", "frequency": 0, "id": 281, "text": "cut one's throat"}, {"category": "money", "definition": "This idiom is used to mean that you should do something to avoid losing any more money.", "example": "When he felt that his project was failing, he had to sell everything to cut his losses.", "frequency": 14, "id": 282, "text": "cut your losses"}, {"category": "technology and science", "definition": "Said to express a surprise.", "example": "Dad fetch my buttons! He won a lot of money in the lotery.", "frequency": 0, "id": 283, "text": "dad fetch my buttons"}, {"category": "death", "definition": "To celebrate a person's death triumphantly.", "example": "He said to his enemies that he would recover his strength and would surely dance on their graves.", "frequency": 0, "id": 284, "text": "dance on someone's grave"}, {"category": "general", "definition": "Try to do something that involves a lot of risks.", "example": "He danced with death when he tried to negotiate a deal with that dangerous criminal.", "frequency": 14, "id": 285, "text": "dance with death"}, {"category": "travel", "definition": "A euphemism for something acquired illegally or stolen.", "example": "He was trying to sell me a new laptop which I suspect fell off the back of a lorry.", "frequency": 0, "id": 366, "text": "fall off the back of a lorry"}, {"category": "furniture", "definition": "This idiom means to be an unwelcome visitor.", "example": "Never darken my door again!", "frequency": 0, "id": 287, "text": "darken someone's door"}, {"category": "dreams", "definition": "This idiom means to have fantasies about someone or something while one is awake.", "example": "He's daydreaming about running away to a warm Caribbean island.", "frequency": 0, "id": 288, "text": "daydream about someone or something"}, {"category": "death", "definition": "No longer in use or under consideration, irrelevant, forgotten.", "example": "All past animosities are dead and buried now.", "frequency": 30, "id": 289, "text": "dead and buried"}, {"category": "general", "definition": "To be absolutely unsuccessful or useless (a complete failure)", "example": "When it comes to math, my sisiter is a dead loss.", "frequency": 2, "id": 291, "text": "dead loss"}, {"category": "death", "definition": "Someone in danger of death or severe punishment.", "example": "You'll be dead meat if you go on treating these poor people like that.", "frequency": 17, "id": 292, "text": "dead meat"}, {"category": "death", "definition": "It means that they are absolutely correct.", "example": "His wife is really beautiful. You're dead right!", "frequency": 56, "id": 293, "text": "dead right"}, {"category": "death", "definition": "This idiom means one is absolutely serious and is not joking.", "example": "Stop lying. I'm dead serious.", "frequency": 123, "id": 294, "text": "dead serious"}, {"category": "death", "definition": "Said about someone who is sound asleep or unconscious.", "example": "He slept right through the night and was still dead to the world when I went out.", "frequency": 5, "id": 295, "text": "dead to the world"}, {"category": "death", "definition": "Workers no longer contributing to an organization.", "example": "There's a lot of dead wood in this company.", "frequency": 23, "id": 296, "text": "dead wood"}, {"category": "travel", "definition": "This idiom means to stop being involved in a situation because failure is imminent.", "example": "She knew it was time to desert a sinking ship because she had read all the reports about the catastrophic financial situation of the company.", "frequency": 0, "id": 297, "text": "desert a sinking ship"}, {"category": "work", "definition": "People are inclined to do frivolous or harmful things to get rid of their boredom when they don't do anything useful.", "example": "My husband made sure that the children are always occupied doing something because you know the devil finds work for idle hands to do.", "frequency": 0, "id": 298, "text": "devil finds work for idle hands to do"}, {"category": "time", "definition": "To have a very difficult time.", "example": "Before she divorced, Ann had had a devil of a time with my her husband.", "frequency": 12, "id": 299, "text": "devil of a time"}, {"category": "religion", "definition": "Careless, reckless or defiant.", "example": "He has a rather devil-may-care attitude to his wife's illness.", "frequency": 56, "id": 300, "text": "devil-may-care"}, {"category": "death", "definition": "To do something which is very risky, or dangerous, and could even cause one's death.", "example": "Someone who drinks and drives is someone who dices with death.", "frequency": 0, "id": 301, "text": "dice with death"}, {"category": "money", "definition": "Said about anything that is common, inexpensive, and easy to get or available any where.", "example": "We don't need someone like him in this company. People with his skills are a dime a dozen these days.", "frequency": 118, "id": 302, "text": "dime a dozen"}, {"category": "parts of the body", "definition": "Said when you start something carefully because you are not sure whether it will work or not.", "example": "I am doing some volunteer work at the new school to try and dip my toe in the water of working in the education field", "frequency": 2, "id": 303, "text": "dip your toe in the water"}, {"category": "work", "definition": "Unpleasant work or dishonest action.", "example": "I always have to do the dirty work. I never have fun.", "frequency": 207, "id": 304, "text": "dirty work"}, {"category": "numbers", "definition": "This idiom means to treat harshly, to hurt or to damage", "example": "I did a number on my back when I sat working on the computer for a long time.", "frequency": 10, "id": 305, "text": "do a number on"}, {"category": "work", "definition": "This idiom means to do the disagreeable, illegal or dishonest things.", "example": "He always sends his assistant to do his dirty work.", "frequency": 22, "id": 306, "text": "do the dirty work"}, {"category": "general", "definition": "Said about something that works.", "example": "Some lemon juice should do the trick to make this sauce more delicious.", "frequency": 298, "id": 307, "text": "do the trick"}, {"category": "age", "definition": "This idiom refers to a long period of time.", "example": "Hi Jane! It's been a dog's age since we last met.", "frequency": 1, "id": 308, "text": "dog's age"}, {"category": "life", "definition": "A miserable, unhappy existence.", "example": "I have to work everyday from dawn to sunset and come back home to take care of the children. It's really a dog's life.", "frequency": 48, "id": 309, "text": "dog's life"}, {"category": "animals", "definition": "Said about a world where people do anything to be successful.", "example": "It's disheartening to know that we are living in a dog-eat-dog world.", "frequency": 74, "id": 310, "text": "dog-eat-dog"}, {"category": "animals", "definition": "This idiom means that your feet are hurting.", "example": "My dogs are barking because I walked ten miles.", "frequency": 1, "id": 311, "text": "dogs are barking"}, {"category": "money", "definition": "This idiomatic expression is used to suggest that something is very likely to be true or that one is certain about something.", "example": "I'll bet you dollars to donuts she won't accept his marriage proposal.", "frequency": 8, "id": 312, "text": "dollars to donuts"}, {"category": "relationship", "definition": "An expression said when you fear someone does not understand what you say.", "example": "Don't get me wrong but I think your plan may not work.", "frequency": 810, "id": 313, "text": "don't get me wrong"}, {"category": "death", "definition": "Something being used or discussed so many times that it has become boring.", "example": "That theme has been done to death by generations of poets.", "frequency": 112, "id": 314, "text": "done to death"}, {"category": "furniture", "definition": "This idiom describes a weak person who is abused by others and submits to domination.", "example": "His colleagues treat him like a doormat.", "frequency": 186, "id": 315, "text": "doormat"}, {"category": "war", "definition": "A benefit that carries some significant but non-obvious cost or risk.", "example": "Being a genius child is a double-edged sword because you cannot communicate with ordinary children.", "frequency": 38, "id": 316, "text": "double-edged sword"}, {"category": "parts of the body", "definition": "To procrastinate, put off, to dawdle, avoid, or make progress slowly and reluctantly.", "example": "He's been dragging his feet about doing his homework.", "frequency": 0, "id": 317, "text": "drag one's feet"}, {"category": "art", "definition": "This idiom refers to a person who tends to react to every event or situation in an over-dramatic or exaggerated way.", "example": "She is such a drama queen! She always tends to exaggerate things.", "frequency": 48, "id": 318, "text": "drama queen"}, {"category": "time", "definition": "This idiom means that when you face extreme and undesirable situations, it is sometimes necessary to take extreme actions.", "example": "We had to let go five of our workers because the company had problems selling the new product. Drastic times call for drastic measures!", "frequency": 0, "id": 319, "text": "drastic times call for drastic measures"}, {"category": "war", "definition": "To attract hostile criticism.", "example": "His new book has drawn fire from many feminists.", "frequency": 5, "id": 320, "text": "draw fire"}, {"category": "music", "definition": "To become less impassioned, aggressive, or argumentative, to back down from a fight, to yield or capitulate.", "example": "He wanted to fight again but we managed to calm him down and get him to draw in his horns.", "frequency": 0, "id": 321, "text": "draw in one's horns"}, {"category": "furniture", "definition": "This idiom means to bring it to an end.", "example": "I think it's time for me to draw the curtain on a long career of teaching.", "frequency": 4, "id": 322, "text": "draw the curtain on"}, {"category": "nature", "definition": "To be selected to do an undesirable task.", "example": "I drew the short straw and got stuck doing the whole project alone.", "frequency": 0, "id": 323, "text": "draw the shortest straw"}, {"category": "dreams", "definition": "This idiom refers to something that you have always hoped for and that has happened.", "example": "Meeting her favorite star is a dream come true.", "frequency": 415, "id": 324, "text": "dream come true"}, {"category": "food", "definition": "Get out of a bad situation.", "example": "I need some help getting out of a jam.", "frequency": 7, "id": 411, "text": "get out of a jam"}, {"category": "numbers", "definition": "To wear fashionable or formal clothes for a special occasion.", "example": "They were invited to a wedding . That's why, they were dressed up to the nines.", "frequency": 0, "id": 327, "text": "dressed up to the nines"}, {"category": "animals", "definition": "To drink alcohol excessively.", "example": "Alan really drank like a fish yesterday.", "frequency": 0, "id": 328, "text": "drink like a fish"}, {"category": "travel", "definition": "Negotiate forcefully.", "example": "It's gonna be a tough negotiations with them. They drive a hard bargain.", "frequency": 0, "id": 329, "text": "drive a hard bargain"}, {"category": "travel", "definition": "To irritate or annoy someone, to make a person very angry or bored, to infuriate.", "example": "Her persistent nagging drove me up the wall.", "frequency": 0, "id": 330, "text": "drive someone up the wall"}, {"category": "war", "definition": "This idiom refers to an alarming and unexpected announcement.", "example": "They dropped a bomb when they announced that the president would resign for health reasons.", "frequency": 0, "id": 331, "text": "drop a bombshell"}, {"category": "money", "definition": "This idiom means to make a phone call, usually calling the police to inform on or betray someone.", "example": "He went out to drop a dime on John.", "frequency": 11, "id": 332, "text": "drop a dime"}, {"category": "nature", "definition": "Something so strong that it doesn't count or doesn't have any importance or significance.", "example": "His contribution was just a drop in the bucket compared to the rest of the team.", "frequency": 35, "id": 333, "text": "drop in the bucket"}, {"category": "general", "definition": "To stop discussing a subject.", "example": "Please drop the subject. I don't want to discuss it further.", "frequency": 2, "id": 334, "text": "drop the subject"}, {"category": "general", "definition": "Said about something which is easily won or obtained and then soon spent or lost.", "example": "He lost a large amount of money in poker. But that's gambling, easy come, easy go.", "frequency": 0, "id": 335, "text": "easy come, easy go"}, {"category": "parts of the body", "definition": "Something (music, voice...) pleasant to listen to.", "example": "His music is easy on the ear.", "frequency": 92, "id": 336, "text": "easy on the ear"}, {"category": "parts of the body", "definition": "Attractive, pleasant to look at.", "example": "Her paintings are easy on the eye.", "frequency": 297, "id": 337, "text": "easy on the eye"}, {"category": "food", "definition": "Said when you admit that you were wrong.", "example": "In the begining he boasted that she would get the best grade. But then she was forced to eat humble pie.", "frequency": 11, "id": 338, "text": "eat humble pie"}, {"category": "animals", "definition": "This idiom means to eat large amounts of food.", "example": "Have you noticed how fat he has become? No wonder he eats like a horse.", "frequency": 1, "id": 339, "text": "eat like a horse"}, {"category": "parts of the body", "definition": "This idiom is meant as a joke that you are even better than another person (often a celebrity).", "example": "I am singing in the school party next week - Madonna, eat your heart out!", "frequency": 74, "id": 340, "text": "eat your heart out"}, {"category": "animals", "definition": "Everyone has a time of success and satisfaction.", "example": "You may become successful in your business someday. Every dog has his day.", "frequency": 2, "id": 342, "text": "every dog has its day"}, {"category": "men and women", "definition": "This idiom means that everyone can be bribed if you know how much or what to bribe him or her with.", "example": "Give him more. You know, every man has his price!\"", "frequency": 0, "id": 343, "text": "every man has his price"}, {"category": "men and women", "definition": "This idiom means every person without exception.", "example": "All the volunteers contributed their time towards cleaning up the city, every man jack of them.", "frequency": 0, "id": 344, "text": "every man jack"}, {"category": "time", "definition": "Describing the whole period that something lasted.", "example": "I enjoyed every minute of the match. It was just fantastic.", "frequency": 1290, "id": 345, "text": "every minute"}, {"category": "names", "definition": "Said about something that is common knowledge to everybody.", "example": "Every Tom, Dick and Harry knows what happened.", "frequency": 0, "id": 346, "text": "every Tom, Dick and Harry"}, {"category": "general", "definition": "Said when you try every possible way to achieve something.", "example": "She's tried every trick in the book to convince him in vain.", "frequency": 27, "id": 347, "text": "every trick in the book"}, {"category": "relationship", "definition": "A huge crowd, too many people", "example": "Everybody and his cousin will be in line for opening night with free popcorn!", "frequency": 0, "id": 348, "text": "everybody and his cousin"}, {"category": "home", "definition": "Almost everything, whether needed or not.", "example": "She must have brought everything but the kitchen sink along on the trip, and how she lifted her suitcase, I do not know.", "frequency": 41, "id": 349, "text": "everything but the kitchen sink"}, {"category": "relationship", "definition": "A pregnant woman.", "example": "There are many good tips for expectant mothers in this little book.", "frequency": 73, "id": 350, "text": "expectant mother"}, {"category": "relationship", "definition": "This idiom means that people learn from what happens to them.", "example": "You will never understand the love parents have for their children until you get your own children. Experience is really the mother of wisdom.", "frequency": 0, "id": 351, "text": "experience is the mother of wisdom"}, {"category": "food", "definition": "A very attractive person or persons or any object or sight with considerable visual appeal.", "example": "I'm going to the beach to check out some eye candy.", "frequency": 471, "id": 352, "text": "eye candy"}, {"category": "religion", "definition": "This idiom refers to a principle found in Babylonian Law, in the Code of Hammurabi, as well as in monotheist religions - Judaism, Christianity and Islam. According to this principle a person who has injured another person is penalized to a similar degree.", "example": "If he killed the poor woman, he deserves to die. It's as simple as that - an eye for an eye, tooth for a tooth.", "frequency": 2, "id": 353, "text": "eye for an eye, a tooth for a tooth"}, {"category": "relationship", "definition": "A very ugly face.", "example": "Look at that poor girl. That's a face that only a mother could love.", "frequency": 0, "id": 354, "text": "face only a mother could love"}, {"category": "time", "definition": "This idiom refers to an ugly face.", "example": "He was a wicked-looking man, with a face that would stop a clock.", "frequency": 0, "id": 355, "text": "face that would stop a clock"}, {"category": "parts of the body", "definition": "Said when someone accepts to confront the unpleasant consequences of one's actions.", "example": "After failing to manage the crisis, the manager had to face the music.", "frequency": 11, "id": 356, "text": "face the music"}, {"category": "life", "definition": "Something that cannot be avoided.", "example": "It is a pity that drug abuse has become a fact of life in the Olympic Games.", "frequency": 164, "id": 357, "text": "fact of life"}, {"category": "sexuality", "definition": "The details about sex and reproduction.", "example": "His parents told him the facts of life when he was ten years old.", "frequency": 104, "id": 358, "text": "facts of life"}, {"category": "colors", "definition": "A person highly regarded and by someone or a group and treated with special favor", "example": "Before he was fired out, he had been the fair-haired boy of the boss.", "frequency": 5, "id": 359, "text": "fair-haired boy"}, {"category": "relationship", "definition": "Someone who is your friend only when the times are good.", "example": "Don't rely on him.He's a fair-weather friend.", "frequency": 9, "id": 360, "text": "fair-weather friend"}, {"category": "love", "definition": "To fall in love with someone.", "example": "He fell for her because she's so beautiful.", "frequency": 18, "id": 361, "text": "fall for someone"}, {"category": "religion", "definition": "This idiom refers to a loss of status, respect, or prestige.", "example": "The politician has fallen from grace and has become very unpopular.", "frequency": 149, "id": 362, "text": "fall from grace"}, {"category": "love", "definition": "To be in love with someone very much, hopelessly smitten.", "example": "They fell head over heels in love with each other.", "frequency": 0, "id": 363, "text": "fall head over heels for someone"}, {"category": "relationship", "definition": "To begin feeling attracted to someone and love him or her.", "example": "When Jane and Math met for the first time, they fell madly in love.", "frequency": 4151, "id": 364, "text": "fall in love"}, {"category": "love", "definition": "To come to have feelings of love directed at another person or a thing", "example": "They fell in love with each other from the moment they saw each other.", "frequency": 38, "id": 365, "text": "fall in love with someone"}, {"category": "love", "definition": "To stop being in love with someone.", "example": "She fell out of love with him when she knew he had been hiding secrets from her.", "frequency": 7, "id": 368, "text": "fall out of love"}, {"category": "animals", "definition": "To become a victim.", "example": "When she married him, she fell prey to his greed.", "frequency": 225, "id": 369, "text": "fall prey to"}, {"category": "general", "definition": "To be missed, to escape the necessary notice or attention", "example": "Complete every item, and make sure nothing falls through the cracks.", "frequency": 28, "id": 370, "text": "fall through the cracks"}, {"category": "nature", "definition": "To make a bad feeling or situation become worse or more intense.", "example": "His racial declarations fanned the flames of the ethinc war.", "frequency": 20, "id": 371, "text": "fan the flames"}, {"category": "relationship", "definition": "This idiom refers to an older man who is respected and who is characterized by power, authority, or strength.", "example": "The kids respected him as a father figure.", "frequency": 336, "id": 372, "text": "father figure"}, {"category": "parts of the body", "definition": "Visually pleasing sight.", "example": "Look at that painting. It's really a feast for the eyes.", "frequency": 221, "id": 373, "text": "feast for the eyes"}, {"category": "colors", "definition": "To feel sad.", "example": "She felt blue after her divorce.", "frequency": 22, "id": 374, "text": "feel blue"}, {"category": "age", "definition": "This idiom means to realize that you are growing old.", "example": "I really felt my age at work. All my colleagues looked very young.", "frequency": 0, "id": 377, "text": "feel your age"}, {"category": "travel", "definition": "Anything superfluous or unnecessary.", "example": "I felt like a fifth wheel when they started looking at each other affectionately.", "frequency": 33, "id": 378, "text": "fifth wheel"}, {"category": "war", "definition": "To use the same methods and tactics that your opponent is using against you.", "example": "After the competitive offers from rival firms, our company has decided to fight fire with fire and reduce prices.", "frequency": 18, "id": 379, "text": "fight fire with fire"}, {"category": "animals", "definition": "To argue and fight violently.", "example": "Those two children always fight like cat and dog.", "frequency": 0, "id": 380, "text": "fight like cat and dog"}, {"category": "war", "definition": "To try very hard to do what is right so as to have a clean conscience.", "example": "He said what he had to say. He fought the good fight and left with a clear conscience.", "frequency": 42, "id": 381, "text": "fight the good fight"}, {"category": "clothes", "definition": "This idiom means to take over someone's function or responsibilities and fulfill them satisfactorily", "example": "My father will retire soon and he expects my elder brother to fill his shoes at the store.", "frequency": 0, "id": 382, "text": "fill someone's shoes"}, {"category": "travel", "definition": "To discover a way to move around it without getting lost.", "example": "He is apparently a professional. He knows his way around affiliate marketing.", "frequency": 0, "id": 383, "text": "find one's way around something"}, {"category": "art", "definition": "This idiom refers to something requiring highly developed techniques and skills.", "example": "They are good at the fine art of web development.", "frequency": 755, "id": 384, "text": "fine art"}, {"category": "music", "definition": "To make small adjustments to something until optimization is achieved", "example": "They need to fine-tune their plan before they start the project.", "frequency": 183, "id": 385, "text": "fine-tune"}, {"category": "animals", "definition": "To try to induce someone to make a compliment.", "example": "He is fishing for compliments.", "frequency": 0, "id": 386, "text": "fish for compliments"}, {"category": "animals", "definition": "This idiom refers to an exaggerated story.", "example": "Don't try to fool me with your fish story.", "frequency": 4, "id": 387, "text": "fish story"}, {"category": "art", "definition": "This idiom refers to a swindler, especially one who goes after a big game and prepares for it carefully.", "example": "Don't trust him! He is a flimflam artist.", "frequency": 0, "id": 388, "text": "flimflam artist"}, {"category": "parts of the body", "definition": "To be in direct opposition to someone.", "example": "Jane's opinions fly in the face of conventions.", "frequency": 73, "id": 389, "text": "fly in the face of"}, {"category": "food", "definition": "Information or knowledge that is worthy of contemplation.", "example": "The ideas developed in this book have certainly given me food for thought.", "frequency": 127, "id": 390, "text": "Food for thought"}, {"category": "money", "definition": "very cheaply.", "example": "She bought the house for a song.", "frequency": 179, "id": 391, "text": "for a song"}, {"category": "general", "definition": "Used to suggest that you don't care.", "example": "You can go to the party alone, for all I care", "frequency": 20, "id": 392, "text": "for all I care"}, {"category": "money", "definition": "Said when it is difficult to get something or persuade someone.", "example": "You can't get help for love nor money these days.", "frequency": 1, "id": 393, "text": "for love nor money"}, {"category": "money", "definition": "In my opinion.", "example": "For my money, Bill is the best one to choose as a partner.", "frequency": 454, "id": 394, "text": "for my money"}, {"category": "names", "definition": "To expresses frustration, exasperation, annoyance.", "example": "For Pete's sake, turn off the TV! I need some rest.", "frequency": 65, "id": 395, "text": "for Pete's sake"}, {"category": "time", "definition": "This idiom refers to something that will be memorable and noteworthy, standing the test of time.", "example": "His speech wasn't a speech for the ages. It was barely a speech for the evening.", "frequency": 578, "id": 396, "text": "for the ages"}, {"category": "life", "definition": "This idiom is used colloquially to mean \"if one's (own) life depended on it.\" It", "example": "I couldn't for the life of me remember where I met her.", "frequency": 220, "id": 397, "text": "for the life of me"}, {"category": "love", "definition": "To express surprise, exasperation, annoyance, or some similar feeling", "example": "For the love of God, stop shouting!", "frequency": 42, "id": 398, "text": "for the love of God"}, {"category": "food", "definition": "Illicit pleasure or something desired that cannot be had.", "example": "She has always been his forbidden fruit because she's his teacher.", "frequency": 1, "id": 399, "text": "Forbidden fruit"}, {"category": "names", "definition": "Refers to a mistake in speech that shows what the speaker is truly thinking.", "example": "Instead of saying \"nobody's perfect,\" he said, \"nobody else is perfect.\" That's a Freudian slip.", "frequency": 25, "id": 400, "text": "Freudian slip"}, {"category": "nature", "definition": "To become popular, to make progress, to advance.", "example": "The new product gained ground in a very short time.", "frequency": 19, "id": 401, "text": "gain ground"}, {"category": "general", "definition": "To fill a vehicle with gasoline.", "example": "I have to stop at the next station to gas up.", "frequency": 7, "id": 402, "text": "gas up"}, {"category": "life", "definition": "This is an idiom that indicates that someone's life is boring and pointless and that they should make their life more interesting.", "example": "Stop complaining! Get a life.", "frequency": 242, "id": 403, "text": "get a life"}, {"category": "crime", "definition": "This idiom means to do something bad and not get punished for it.", "example": "You can't get away with your mischief!", "frequency": 9, "id": 404, "text": "get away with something"}, {"category": "parts of the body", "definition": "Annoy someone.", "example": "I know that the children get in your hair, but you should try not to let it upset you so much.", "frequency": 0, "id": 405, "text": "get in someone's hair"}, {"category": "nature", "definition": "To be in trouble.", "example": "He got into deep water when he joined that gang.", "frequency": 0, "id": 406, "text": "get into deep water"}, {"category": "parts of the body", "definition": "This idiom means stop annoying or harassing me.", "example": "Get off my back. Stop criticizing me.", "frequency": 0, "id": 407, "text": "get off my back!"}, {"category": "general", "definition": "To start talking about a different topic, instead of talking about the real one.", "example": "Instead of discussing the real reasons for their conflicts, they are getting of the track.", "frequency": 2, "id": 408, "text": "get off the track"}, {"category": "age", "definition": "Old, advanced in age.", "example": "Although she's getting on in years, she still looks young.", "frequency": 1, "id": 409, "text": "get on in years"}, {"category": "relationship", "definition": "Said about two people like each other and become very close friends in a very short time.", "example": "The two ladies are getting on like a house on fire.", "frequency": 0, "id": 410, "text": "get on like a house on fire"}, {"category": "art", "definition": "To understand the situation without the need for more explanation.", "example": "I got the picture without listening to the whole story.", "frequency": 483, "id": 414, "text": "get the picture"}, {"category": "work", "definition": "To be dismissed from employment.", "example": "Because he was always late, he got the sack.", "frequency": 1, "id": 415, "text": "get the sack"}, {"category": "numbers", "definition": "To want someone to slap your open hand as a greeting or to show joy.", "example": "Give me five! shouted Alan after he scored a goal.", "frequency": 2, "id": 416, "text": "give me five"}, {"category": "parts of the body", "definition": "To help someone to achieve something, especially at work.", "example": "They agreed to give her a leg up.", "frequency": 0, "id": 417, "text": "give somebody a leg up"}, {"category": "parts of the body", "definition": "This idiom means to end a romantic relationship or a friendship with someone.", "example": "She gave him the elbow because she couldn't bear the way he used to treat her.", "frequency": 0, "id": 418, "text": "give somebody the elbow"}, {"category": "war", "definition": "This idiom means to make a motor or engine run faster, to speed up.", "example": "The burglars gave the motor the gun and drove off.", "frequency": 0, "id": 419, "text": "give the gun"}, {"category": "life", "definition": "This idiom means to help a person who has stopped breathing by giving them artificial respiration, that is to say, by blowing into their mouth and pressing their chest.", "example": "He saved a victim of an accident by giving him the kiss of life.", "frequency": 0, "id": 420, "text": "give the kiss of life"}, {"category": "parts of the body", "definition": "Said when you want to have or do something very much.", "example": "She'd give her eye teeth for a straight blond hair.", "frequency": 0, "id": 421, "text": "give your eye teeth for something"}, {"category": "relationship", "definition": "To do the opposite of people do and not accept things as thy are.", "example": "In his last speech, the leader of the opposition went against the flow and declared that reducing taxes will harm the economy.", "frequency": 2, "id": 422, "text": "go against the flow"}, {"category": "food", "definition": "To become very angry.", "example": "He went bananas when he heard the news.", "frequency": 3, "id": 423, "text": "go bananas"}, {"category": "names", "definition": "This idiom means to be known by a specific name, a name that is not your real name.", "example": "She goes by the name of Lisa.", "frequency": 14, "id": 424, "text": "go by the name"}, {"category": "home", "definition": "To die and be shipped home.", "example": "Those soldiers are too young. It's a pitty that they go home in a box.", "frequency": 0, "id": 425, "text": "go home in a box"}, {"category": "parts of the body", "definition": "Said about something which is heard and then quickly forgotten.", "example": "Stop talking to him. Whatever you say to him just goes in one ear and out the other.", "frequency": 7, "id": 426, "text": "go in one ear and out the other"}, {"category": "love", "definition": "To date one person regularly and exclusively.", "example": "Lisa has been going steady with that guy for a year now.", "frequency": 0, "id": 427, "text": "go steady with someone"}, {"category": "home", "definition": "Become very angry.", "example": "She went through the roof when she realized she had lost everything.", "frequency": 8, "id": 428, "text": "go through the roof"}, {"category": "religion", "definition": "Go to a bad state of affairs quickly.", "example": "He said that all their plans for the project went to hell in a handbasket because of the recession.", "frequency": 0, "id": 429, "text": "go to hell in a handbasket"}, {"category": "war", "definition": "To declare a war over someone or something.", "example": "The US administration has gone to war over teenagers' pregnancy for decades in vain.", "frequency": 7, "id": 430, "text": "go to war over"}, {"category": "relationship", "definition": "To do what people do and accept things as they are.", "example": "Don't worry too much! Take it easy and go with the flow!", "frequency": 136, "id": 431, "text": "go with the flow"}, {"category": "religion", "definition": "Said when you hope that something does not happen.", "example": "God forbid that they encounter a problem on their way home.", "frequency": 197, "id": 432, "text": "God forbid"}, {"category": "religion", "definition": "Said when you have absolutely no knowledge of something.", "example": "God knows what he's going to do after his divorce.", "frequency": 317, "id": 433, "text": "God knows"}, {"category": "religion", "definition": "This idiom refers the absolute, unquestionable truth. The idiom is used to suggest that something is the complete truth.", "example": "His criticism was too harsh on him, but it was simply God's honest truth.", "frequency": 5, "id": 434, "text": "God's honest truth"}, {"category": "age", "definition": "Period of prosperity.", "example": "The golden age of Hollywood.", "frequency": 758, "id": 435, "text": "golden age"}, {"category": "colors", "definition": "Ideal moment to do something.", "example": "She missed a golden opportunity to prepare herself for a career as a doctor, when she didn't continue her studies at university.", "frequency": 84, "id": 436, "text": "golden opportunity"}, {"category": "relationship", "definition": "This means that people should respect other people's property and privacy and mind their own business.", "example": "Our neighbor should prevent his children from messing up our lawn. Good fences make good neighbors.", "frequency": 1, "id": 437, "text": "good fences make good neighbors"}, {"category": "colors", "definition": "Permission to go ahead with something such as a project.", "example": "As a result of the severe drought, the government has given the green light for importing cereals.", "frequency": 180, "id": 438, "text": "green light"}, {"category": "colors", "definition": "Consumed by envy, envious to the point where it is noticeable to others.", "example": "She was green with envy when she saw my new car.", "frequency": 36, "id": 439, "text": "green with envy"}, {"category": "colors", "definition": "Envy, jealousy, covetousness", "example": "His success aroused the green-eyed monster in his friend.", "frequency": 2, "id": 440, "text": "green-eyed monster"}, {"category": "nature", "definition": "This idiom refers to a more promising situation.", "example": "The young ambitious girl emigrated to Canada seeking greener pastures where she can develop her career.", "frequency": 49, "id": 441, "text": "greener pastures"}, {"category": "animals", "definition": "To complain.", "example": "He was grousing about his son's laziness.", "frequency": 0, "id": 443, "text": "grouse about someone or something"}, {"category": "work", "definition": "This idiom means to prevent a process, a system or a machine from working smoothly.", "example": "He is not careful enough and always gums up the works.", "frequency": 3, "id": 444, "text": "gum up the works"}, {"category": "health", "definition": "In a good health.", "example": "In spite of her old age, she looks hale and hearty.", "frequency": 15, "id": 445, "text": "hale and hearty"}, {"category": "crime", "definition": "This idiom means to steal from one's employer.", "example": "The boss fired him because he was caught with his hand in the till.", "frequency": 0, "id": 446, "text": "hand in the till"}, {"category": "clothes", "definition": "To be very careful and polite to a person because you don't want to hurt him or her, or you don't want to to make him or her angry or upset.", "example": "He has become so sensitive after his divorce. You need to handle him with kid gloves.", "frequency": 0, "id": 447, "text": "handle someone with kid gloves"}, {"category": "parts of the body", "definition": "To be unable to help, intervene or act.", "example": "The new legislation has tied his hands.", "frequency": 16, "id": 448, "text": "hands are tied"}, {"category": "clothes", "definition": "This idiom means to ask someone for a favor with humility.", "example": "She came back hat in hand asking for forgiveness.", "frequency": 4, "id": 449, "text": "hat in hand"}, {"category": "clothes", "definition": "To have a secret plan that can be used when needed.", "example": "Nancy must have an ace up her sleeve, otherwise, she wouldn't have rejected that offer", "frequency": 0, "id": 450, "text": "have a card up your sleeve"}, {"category": "parts of the body", "definition": "This idiom means to be be angry about something that happened sometimes in the past or to hold a grudge.", "example": "Although he has become a millionaire, he still has a chip on his shoulder about not going to university.", "frequency": 0, "id": 451, "text": "have a chip on your shoulder"}, {"category": "parts of the body", "definition": "To have an advantage over someone.", "example": "She probably has a leg up on the other students because she is more studious.", "frequency": 0, "id": 454, "text": "have a leg up on somebody"}, {"category": "furniture", "definition": "This idiom is used to mean that one is very busy and have commitments.", "example": "I have a lot on my plate right now.", "frequency": 0, "id": 455, "text": "have a lot on one�s plate"}, {"category": "time", "definition": "This idiom means to have an exciting or fun time.", "example": "I had a whale of a time at the party yesterday.", "frequency": 1, "id": 456, "text": "have a whale of a time"}, {"category": "general", "definition": "To have a strong opinion about something.", "example": "The members of that association have no political axe to grind, they just want to help the street children.", "frequency": 51, "id": 457, "text": "have an axe to grind"}, {"category": "clothes", "definition": "This idiom means to be very excited, restless, anxious or worried about something.", "example": "It's the first time that he dates a girl. That's why he's got ants in his pants.", "frequency": 0, "id": 458, "text": "have ants in your pants"}, {"category": "parts of the body", "definition": "To be nosy and listen to other people's private conversations.", "example": "Speak quietly. Nancy has big ears you.", "frequency": 1, "id": 459, "text": "have big ears"}, {"category": "animals", "definition": "To have other things to do, to have more important things to do.", "example": "I can't answer your question. I have bigger fish to fry.", "frequency": 2, "id": 460, "text": "have bigger fish to fry"}, {"category": "food", "definition": "This idiom means to be embarrassed by something one has done.", "example": "If the president doesn't keep his promises, he will end up having egg on his face.", "frequency": 0, "id": 461, "text": "have egg on one's face"}, {"category": "relationship", "definition": "To know powerful people.", "example": "Don't worry about the problem. I have friends in high places.", "frequency": 1, "id": 462, "text": "have friends in high places"}, {"category": "animals", "definition": "To be very worried, upset or angry about something.", "example": "My father had kittens when I stayed out late yesterday.", "frequency": 7, "id": 463, "text": "have kittens"}, {"category": "money", "definition": "To be very rich and spend a lot of money on unnecessary things.", "example": "He seems to have money to burn. He always buys his girlfriend extravagant things", "frequency": 27, "id": 464, "text": "have money to burn"}, {"category": "general", "definition": "To be confused.", "example": "You've really got your wires crossed! You don't know what you are talking about.", "frequency": 0, "id": 465, "text": "have one's wires crossed"}, {"category": "animals", "definition": "To have other things to do, to have more important things to do.", "example": "I can't answer your question. I have other fish to fry.", "frequency": 0, "id": 466, "text": "have other fish to fry"}, {"category": "technology and science", "definition": "Said when you are able to manage doing something very well.", "example": "They have the management of the concert down to a science.", "frequency": 0, "id": 467, "text": "have something down to a science"}, {"category": "sexuality", "definition": "To be strongly sexually attracted to someone.", "example": "He has the hots for her but he can't tell her. He's so shy.", "frequency": 0, "id": 468, "text": "have the hots for someone"}, {"category": "time", "definition": "This idiom means that one has extra time.", "example": "I don't have much time on my hands. I'm too busy.", "frequency": 4, "id": 469, "text": "have time on your hands"}, {"category": "music", "definition": "Accept or face the unpleasant consequences of one's actions.", "example": "Leila didn't manage to finish the job on time and had to face the music.", "frequency": 0, "id": 470, "text": "have to face the music"}, {"category": "furniture", "definition": "This idiom means to be too busy.", "example": "I have too much on my plate right now. I can't help you.", "frequency": 0, "id": 471, "text": "have too much on one's plate"}, {"category": "parts of the body", "definition": "Completely in love.", "example": "They fell head over heels for one another at the very moment they met.", "frequency": 188, "id": 473, "text": "head over heels"}, {"category": "parts of the body", "definition": "A person who is very kind and has a good nature.", "example": "He is a good boy with a heart of gold. He would never break her heart.", "frequency": 232, "id": 474, "text": "heart of gold"}, {"category": "weather", "definition": "This idiom refers to considerable difficulty.", "example": "My daughter found mathematics heavy going.", "frequency": 21, "id": 475, "text": "heavy weather"}, {"category": "animals", "definition": "Said about someone who helps people who are in difficulty or trouble.", "example": "You can trust him. He always helps a lame dog over a stile.", "frequency": 0, "id": 476, "text": "help a lame dog over a stile"}, {"category": "religion", "definition": "The most important person in a hierarchy or organization.", "example": "I want to meet the hign man on the totem pole.", "frequency": 0, "id": 477, "text": "high man on the totem pole"}, {"category": "time", "definition": "To do something, it is the appropriate time for it.", "example": "It's high time you began learning how to drive.", "frequency": 156, "id": 478, "text": "high time"}, {"category": "crime", "definition": "This idiom is used to refer to a price or a fee that is exorbitantly high.", "example": "The price for wine in this restaurant is simply highway robbery", "frequency": 13, "id": 479, "text": "highway robbery"}, {"category": "travel", "definition": "Major and minor roads.", "example": "They spent their holiday exploring the highways and byways of the country", "frequency": 21, "id": 480, "text": "highways and byways"}, {"category": "home", "definition": "To be successful.", "example": "They hit a home run with their excellent performance in the new play.", "frequency": 133, "id": 481, "text": "hit a home run"}, {"category": "home", "definition": "To become very angry and start shouting.", "example": "He hit the ceiling when he knew the truth.", "frequency": 3, "id": 482, "text": "hit the ceiling"}, {"category": "parts of the body", "definition": "Said to describe exactly a situation or a problem.", "example": "I think you hit the nail on the head when you said that the Smiths lack a sense of cooperation in their family.", "frequency": 293, "id": 483, "text": "hit the nail on the head"}, {"category": "technology and science", "definition": "To panic suddenly.", "example": "Relax! Don't hit the button it's just the wind.", "frequency": 0, "id": 484, "text": "hit the panic button"}, {"category": "travel", "definition": "To begin traveling, to leave a place, to go away.", "example": "We've got a long way to go. Let's hit the road to make it by sunset.", "frequency": 139, "id": 485, "text": "hit the road"}, {"category": "home", "definition": "To become angry and start shouting.", "example": "The teacher hit the roof when the student was very late again.", "frequency": 2, "id": 486, "text": "hit the roof"}, {"category": "travel", "definition": "Aspire to do something great or aim high, follow a great ambition.", "example": "he urged his students to hitch their wagons to a star.", "frequency": 0, "id": 487, "text": "hitch one's wagon to a star"}, {"category": "law", "definition": "To consider someone responsible for something.", "example": "I hold you accountable for whatever happens to my daughter.", "frequency": -2, "id": 488, "text": "hold someone accountable (for something)"}, {"category": "home", "definition": "A place where you are at ease as if you were at home.", "example": "When I used to visit her, it was really a real home away from home.", "frequency": 9, "id": 489, "text": "home away from home"}, {"category": "home", "definition": "To be certain of being successful because you have finished the most difficult part.", "example": "Once you hand in the last part of your dissertation, you're home free.", "frequency": 32, "id": 490, "text": "home free"}, {"category": "home", "definition": "This idiom refers to an unpleasant fact about oneself.", "example": "It is high time I told him a few home truths.", "frequency": 11, "id": 491, "text": "home truth"}, {"category": "animals", "definition": "A different matter.", "example": "If you want to invest in the stock market, it's ok. Gambling, however, is a horse of a different color.", "frequency": 10, "id": 492, "text": "horse of a different color"}, {"category": "food", "definition": "An awkward or delicate problem with which nobody wants to be associated.", "example": "Gun control in the United States has always been a hot potato for politicians.", "frequency": 78, "id": 493, "text": "Hot potato"}, {"category": "general", "definition": "Used to ask how or why.", "example": "So how come you missed the train?", "frequency": 1759, "id": 494, "text": "how come?"}, {"category": "names", "definition": "Said when you can't remmeber someone's name.", "example": "She was my classmate. I remember her face but I can't put a name to her.", "frequency": 0, "id": 496, "text": "I can't put a name to someone"}, {"category": "crime", "definition": "This idiom means that you really want to eat or drink something.", "example": "I could murder a pizza.", "frequency": 0, "id": 497, "text": "I could murder something"}, {"category": "clothes", "definition": "Said to suggest that you will be surprised if something happens.", "example": "If his business becomes successful, I'll eat my hat.", "frequency": 4, "id": 498, "text": "I'll eat my hat"}, {"category": "clothes", "definition": "This idiom means if something applies to you, then accept it.", "example": "The teacher says that I need to spend more time with my son. Well, if the shoe fits, wear it.", "frequency": 0, "id": 499, "text": "if the shoe fits, wear it"}, {"category": "money", "definition": "Money or other possession gained dishonestly.", "example": "All his ill-gotten gains are hidden somewhere in his bedroom.", "frequency": 30, "id": 501, "text": "ill-gotten gains"}, {"category": "parts of the body", "definition": "Said when a group of people do something together.", "example": "The workers went in a body to the boss to ask for higher wages.", "frequency": 81, "id": 502, "text": "in a body"}, {"category": "age", "definition": "This idiom means in a very long time.", "example": "She hasn't seen him in a coon's age. She is so happy to meet him again.", "frequency": 0, "id": 503, "text": "in a coon's age"}, {"category": "sport", "definition": "Said when two or more competitors finish a race or a competition at exactly the same time or with exactly the same result.", "example": "The two horses finished the race in a dead heat.", "frequency": 2, "id": 504, "text": "in a dead heat"}, {"category": "weather", "definition": "This idiom is used when someone is confused, dazed, disoriented.", "example": "After he heard the bad news, he was in a fog for a moment.", "frequency": 63, "id": 505, "text": "in a fog"}, {"category": "food", "definition": "In summary.", "example": "The truth in a nutshell is that I know nothing about what they want me to do in this job.", "frequency": 569, "id": 506, "text": "In a nutsheel"}, {"category": "time", "definition": "In just very short time.", "example": "Every thing was calm. But just in a split second a storm hit the whole region causing a lot of victims.", "frequency": 43, "id": 507, "text": "in a split second"}, {"category": "health", "definition": "In bad physical condition.", "example": "Bill is in bad shape. He needs to exercise regularly and go on a diet.", "frequency": 46, "id": 508, "text": "in bad shape"}, {"category": "crime", "definition": "This idiom means to do something without feeling or with cruel intent.", "example": "The woman killed her baby in cold blood. It is just horrible.", "frequency": 168, "id": 509, "text": "in cold blood"}, {"category": "parts of the body", "definition": "This idiom refers to something that is plain, clearly apparent, or obvious.", "example": "If they had paid more attention, they would have discovered that the answer to the riddle was under their noses the whole time.", "frequency": 0, "id": 510, "text": "in front of one’s nose"}, {"category": "religion", "definition": "Used to add emphasis.", "example": "What in God's name did you do to that poor girl?", "frequency": 50, "id": 511, "text": "in God's name"}, {"category": "names", "definition": "This idiom means nominally, not essentially.", "example": "They were married only in name, the fact is that they lived in different countries.", "frequency": 123, "id": 512, "text": "in name only"}, {"category": "furniture", "definition": "Drunk, in the act of consuming alcohol liberally.", "example": "He couldn't be understood because he was in his cups.", "frequency": 0, "id": 513, "text": "in one's cups"}, {"category": "language", "definition": "This idiom means in clear, simple language.", "example": "Please, tell me what you mean in plain English.", "frequency": 330, "id": 514, "text": "in plain English"}, {"category": "clothes", "definition": "This idiom means to be dependent on someone financially and consequently under their influence.", "example": "The committee must surely have been in his pocket.", "frequency": 2, "id": 515, "text": "in someone's pocket"}, {"category": "nature", "definition": "Said about something that is happening or about to happen.", "example": "Everybody in the company know that change is in the air.", "frequency": 1790, "id": 516, "text": "in the air"}, {"category": "general", "definition": "Certain or extremely likely to occur, assured about the success of somoething.", "example": "Don't worry about the final exam. It's in the bag.", "frequency": 161, "id": 517, "text": "in the bag"}, {"category": "health", "definition": "Very healthy.", "example": "He's in the best health because he exercises regularly and doesn't eat junk food.", "frequency": 5, "id": 518, "text": "in the best of health"}, {"category": "parts of the body", "definition": "Very quickly.", "example": "He disappeared in the blink of an eye.", "frequency": 84, "id": 519, "text": "in the blink of an eye"}, {"category": "weather", "definition": "This idiom is used when you see things objectively, clearly and calmly, without the emotions you had at the time they occurred.", "example": "Later, in the cold light of day, John realized his mistake. But it was too late, the harm was done.", "frequency": 7, "id": 520, "text": "in the cold light of day"}, {"category": "crime", "definition": "To be on trial in court", "example": "The accused stood in the dock.", "frequency": 46, "id": 521, "text": "in the dock"}, {"category": "law", "definition": "Legally.", "example": "In the eyes of the law you are not allowed to treat people like that.", "frequency": 12, "id": 522, "text": "in the eyes of the law"}, {"category": "sexuality", "definition": "Pregnant.", "example": "I've heard that Leila is in the family way. Is that true?", "frequency": 3, "id": 523, "text": "in the family way"}, {"category": "war", "definition": "To be in a situation where you are likely to be criticized or attacked.", "example": "The company tried to get out of the firing line by responding favorably to the demands of the customers.", "frequency": 8, "id": 524, "text": "in the firing line"}, {"category": "money", "definition": "Very rich", "example": "He's in the money. He's extremely rich.", "frequency": 74, "id": 525, "text": "in the money"}, {"category": "time", "definition": "This idiom means at the last possible moment, just before it's too late.", "example": "I arrived at the train station in the nick of time and took the last train to the capital city.", "frequency": 115, "id": 526, "text": "in the nick of time"}, {"category": "furniture", "definition": "This idiom means that someone is pregnant.", "example": "She probably has one in the oven.", "frequency": 329, "id": 527, "text": "in the oven"}, {"category": "colors", "definition": "Healthy.", "example": "He has been in the pink since he decided to go on a diet and exercise regularly.", "frequency": 19, "id": 528, "text": "in the pink"}, {"category": "travel", "definition": "In the same situation, having the same problems.", "example": "Can you lend me 100 dollars? Sorry,I am broke. I am in the same boat", "frequency": 116, "id": 529, "text": "in the same boat"}, {"category": "general", "definition": "Following, as a result of.", "example": "Dominique Strauss-Kahn resigns his position as head of the International Monetary Fund in the wake of sexual assault charges.", "frequency": 780, "id": 530, "text": "in the wake of"}, {"category": "general", "definition": "Focused", "example": "He's doing a good job. He's in the zone!", "frequency": 82, "id": 531, "text": "in the zone"}, {"category": "age", "definition": "In the present.", "example": "In In this day and age, horrible crimes are very common occurrence.", "frequency": 769, "id": 532, "text": "in this day and age"}, {"category": "technology and science", "definition": "Said when you have a good understanding of someone or something.", "example": "He was in tune with new technologies.", "frequency": -2, "id": 533, "text": "in tune (with somebody/something)"}, {"category": "animals", "definition": "In a very short time.", "example": "He did the job in two shakes of a lamb's tail.", "frequency": 0, "id": 534, "text": "in two shakes of a lamb's tail"}, {"category": "dreams", "definition": "This idiom means that you don't believe that something which is desired by someone will happen.", "example": "Marry a star? In your dreams!", "frequency": 78, "id": 535, "text": "in your dreams"}, {"category": "food", "definition": "In a difficult situation.", "example": "He found himself in a jam when he was caught cheating.", "frequency": 10, "id": 536, "text": "into a jam"}, {"category": "sport", "definition": "Used to suggest that you don't understand something.", "example": "It beats me how she passed the exam.", "frequency": 27, "id": 537, "text": "it beats me"}, {"category": "language", "definition": "This idiom refers to something that is so obvious that it is needless to say it.", "example": "It goes without saying that you have to wake early tomorrow morning if you want to participate in the marathon competition.", "frequency": 99, "id": 538, "text": "it goes without saying"}, {"category": "music", "definition": "This idiom means that for something to work properly the cooperation of both parties is needed.", "example": "For the success of the negotiations, both companies should make some concessions, it takes two to tango, you know.", "frequency": 1, "id": 541, "text": "it takes two to tango"}, {"category": "nature", "definition": "This idiom refers to a threatening environment where it is difficult to survive.", "example": "Working in that company is so difficult. It's a jungle out there.", "frequency": 4, "id": 542, "text": "it's a jungle out there"}, {"category": "time", "definition": "Used to express impatience at the eventual occurrence of something that should have occurred a long time ago.", "example": "It's about time that women should be considered equal to men in this country.", "frequency": 509, "id": 543, "text": "It's about time"}, {"category": "language", "definition": "This idiom is referring to something that is not understandable.", "example": "My friend tried to explain to me how to use a new software he had developed, but it was all Greek to me.", "frequency": 0, "id": 544, "text": "it's all Greek to me"}, {"category": "technology and science", "definition": "Something not difficult to understand.", "example": "Swimming is not a rocket science.", "frequency": 12, "id": 545, "text": "it's not rocket science"}, {"category": "travel", "definition": "Feeling of a need to travel.", "example": "She has itchy feet again. She says she will travel to Brazil.", "frequency": 7, "id": 546, "text": "itchy feet"}, {"category": "death", "definition": "Used to mean that if someone has to face the consequences of his or her actions.", "example": "Do not come back. It will be your funeral.", "frequency": 0, "id": 547, "text": "It is your funeral"}, {"category": "names", "definition": "Said about someone who is able to do many things.", "example": "He can do many jobs, he's really a jack-of-all-trades", "frequency": 24, "id": 548, "text": "jack-of-all-trades"}, {"category": "general", "definition": "To press the brakes suddenly and in a hard way.", "example": "I had to jam on the brakes because a kid suddenly appeared from nowhere and crossed the road.", "frequency": 0, "id": 549, "text": "jam on the brakes"}, {"category": "names", "definition": "To annoy someone or or make them nervous.", "example": "She's a real Jekyll and Hyde. You never know when she will become unpleasant.", "frequency": 0, "id": 550, "text": "jangle someones's nerves"}, {"category": "names", "definition": "An average typical man.", "example": "This car is very expensive and is not the sort of thing that Joe Bloggs would buy.", "frequency": 4, "id": 551, "text": "Joe Bloggs"}, {"category": "names", "definition": "A person's signature.", "example": "Put your John Hancock at the bottom of the page.", "frequency": 200, "id": 552, "text": "John Hancock"}, {"category": "relationship", "definition": "Said as a reply to someone to mean that they are in the same situation.", "example": "I've got problems with my husband these days. Join the club!", "frequency": 26, "id": 553, "text": "join the club"}, {"category": "travel", "definition": "To profit from a craze, to join a trend.", "example": "After the incredible success of the new product, the company has jumped on the bandwagon, and released a new version of it.", "frequency": 38, "id": 554, "text": "jump on the bandwagon"}, {"category": "war", "definition": "This idiom means to act too soon, before the right time.", "example": "They jumped the gun and decided to get married before really knowing each other.", "frequency": 25, "id": 555, "text": "jump the gun"}, {"category": "travel", "definition": "To pass a set of traffic lights when they are not showing green.", "example": "It's dangerous to jump the lights. You may have a terrible accident.", "frequency": 0, "id": 556, "text": "jump the lights"}, {"category": "health", "definition": "This idiom means exactly what is required or wanted.", "example": "Orange juice? Thanks! Orange juice is just what the doctor ordered.", "frequency": 98, "id": 557, "text": "just what the doctor ordered"}, {"category": "law", "definition": "This idiom means that justice is impartial and objective.", "example": "No matter who you are, you must respect the law. Justice is blind!", "frequency": 1, "id": 558, "text": "Justice is blind"}, {"category": "parts of the body", "definition": "To speak politely.", "example": "Please don't talk like that to each other. Keep a civil tongue!", "frequency": 0, "id": 559, "text": "keep a civil tongue"}, {"category": "parts of the body", "definition": "This idiom means to watch or look after something or someone.", "example": "Please keep your eye on my son while I go to the toilet.", "frequency": 192, "id": 560, "text": "keep an eye on"}, {"category": "parts of the body", "definition": "To be able to pay for your food, clothing and somewhere to live.", "example": "He earns barely enough to keep body and soul together.", "frequency": 1, "id": 561, "text": "keep body and soul together"}, {"category": "sport", "definition": "To remain alert to the events occurring around oneself.", "example": "To be successful in this business, you'll have to keep your eye on the ball.", "frequency": 0, "id": 562, "text": "keep one's eye on the ball"}, {"category": "parts of the body", "definition": "To be on the alert, to be watchful", "example": "I will keep my eyes peeled for your call.", "frequency": 0, "id": 564, "text": "keep one's eyes peeled"}, {"category": "general", "definition": "To keep somebody laughing hard or amused.", "example": "The show kept me in stitches the whole time.", "frequency": 0, "id": 565, "text": "keep somebody in stitches"}, {"category": "general", "definition": "to monitor, to keep track of, to watch.", "example": "If you are careful to keep tabs on your finances, you should be able to stay within a budget.", "frequency": 20, "id": 566, "text": "keep tabs on"}, {"category": "animals", "definition": "To have enough money to be able to ward off poverty or hunger.", "example": "They were really very poor, but they had enough to keep the wolf from the door.", "frequency": 20, "id": 567, "text": "keep the wolf from the door"}, {"category": "work", "definition": "This idiom is used to encourage a person to continue doing the good things they are doing now.", "example": "Well done! I couldn't have done it better myself. Keep up the good work.", "frequency": 198, "id": 568, "text": "keep up the good work"}, {"category": "parts of the body", "definition": "This idiom is used to encourage someone who has to bear some difficult circumstances.", "example": "He keeps his chin up despite his severe illness.", "frequency": 16, "id": 569, "text": "keep your chin up"}, {"category": "parts of the body", "definition": "Be just able to make enough money to survive.", "example": "After his financial problems,he can hardly keep his head above water.", "frequency": 21, "id": 570, "text": "keep your head above water"}, {"category": "war", "definition": "Be cautious and prepared for the worst.", "example": "Trust in God, and keep your powder dry.", "frequency": 1, "id": 571, "text": "keep your powder dry"}, {"category": "general", "definition": "To die.", "example": "Sad news! He kicked the bucket.", "frequency": 12, "id": 572, "text": "kick the bucket"}, {"category": "time", "definition": "This idiom means to spend time doing nothing in particular.", "example": "He had nothing in particular to do, so he went for a walk downtown to kill time.", "frequency": 119, "id": 573, "text": "kill time"}, {"category": "death", "definition": "Something that may seem good and favourable but that actually brings ruin to hopes, plans, etc.", "example": "Her mariage to that guy was the kiss of death for Leila's happiness.", "frequency": 43, "id": 574, "text": "kiss of death"}, {"category": "relationship", "definition": "A distant relative.", "example": "I and Daniel are kissing cousins.", "frequency": 6, "id": 575, "text": "kissing cousin"}, {"category": "parts of the body", "definition": "To frown or look worried, angry or puzzled.", "example": "She knitted her brows as she listened to the strange story.", "frequency": 0, "id": 576, "text": "knit one's brow"}, {"category": "general", "definition": "To know something very thoroughly.", "example": "He's still new to their system, but he knows databases inside and out and will understand the rest soon.", "frequency": 0, "id": 577, "text": "know something inside and out"}, {"category": "work", "definition": "This idiom refers to a work that brings you great pleasure.", "example": "John helps street children get basic education as a labor of love.", "frequency": 547, "id": 578, "text": "labor of love"}, {"category": "animals", "definition": "Someone or something that is disabled, helpless, ineffective, or inefficient.", "example": "What do you expect from a lame-duck mayor?", "frequency": 37, "id": 579, "text": "lame duck"}, {"category": "life", "definition": "Very imposing, renowned, or impressively influential.", "example": "He is such a special man, somewhat larger than life.", "frequency": 799, "id": 580, "text": "larger than life"}, {"category": "law", "definition": "This idiom means survival of the strongest or the fittest.", "example": "Some economists think that capitalism is governed by the law of the jungle.", "frequency": 10, "id": 582, "text": "law of the jungle"}, {"category": "law", "definition": "This idiomatic expression describes a person who behaves in an independent way, ignoring rules and what is generally accepted as correct.", "example": "Leila is a law unto herself, she doesn't want to abide by the rules.", "frequency": 0, "id": 583, "text": "law unto oneself"}, {"category": "law", "definition": "Tell people what they should do in a forceful and stern way.", "example": "Please don't lay down the law, we know what we have to do.", "frequency": 7, "id": 584, "text": "lay down the law"}, {"category": "parts of the body", "definition": "To memorize something.", "example": "She learned the poem by heart.", "frequency": 4, "id": 585, "text": "learn by heart"}, {"category": "age", "definition": "This idiom means to move from one's parents' home. Such a move is mainly motivated by a desire for independence.", "example": "My son left the nest at the age of 21 and the house seems empty without him now.", "frequency": 19, "id": 586, "text": "leave the nest"}, {"category": "animals", "definition": "To leave things as they are to avoid trouble.", "example": "It would be best to let sleeping dogs lie and not discuss the problem any further.", "frequency": 8, "id": 587, "text": "let sleeping dogs lie"}, {"category": "animals", "definition": "To reveal a secret, usually accidentally.", "example": "She wasn't supposed to know about it. Someone must have let the cat out of the bag.", "frequency": 9, "id": 588, "text": "let the cat out of the bag"}, {"category": "money", "definition": "To generate a lot of money without much effort.", "example": "Advertizing companies are just a licence to print money.", "frequency": 1, "id": 589, "text": "licence to print money"}, {"category": "clothes", "definition": "This idiom means to act in a servile or obsequious way toward someone, especially to gain favor from them.", "example": "She seizes every opportunity to lick the boss's boots.", "frequency": 0, "id": 590, "text": "lick someone's boots"}, {"category": "furniture", "definition": "This idiom means to tell lies shamelessly.", "example": "She says she didn't kill him, but the detective knows she's lying like a rug.", "frequency": 0, "id": 591, "text": "lie like a rug"}, {"category": "clothes", "definition": "This idiom refers to a loose woman, a prostitute.", "example": "Don't call her a light skirt. She is a respectable woman.", "frequency": 0, "id": 592, "text": "light skirt"}, {"category": "food", "definition": "To be different although to be superficially alike.", "example": "His two sons are like chalk and cheese.", "frequency": 2, "id": 593, "text": "like chalk and cheese"}, {"category": "relationship", "definition": "This idiom indicates that fathers and sons resemble each other or that sons tend to behave like their fathers.", "example": "Alan decided to start a business online - like father, like son.", "frequency": 3, "id": 594, "text": "like father, like son"}, {"category": "relationship", "definition": "This idiom means that daughters resemble their mothers.", "example": "Like mother, like daughter. Her mother is mad about fashion, too.", "frequency": 1, "id": 595, "text": "like mother, like daughter"}, {"category": "animals", "definition": "Without any effect.", "example": "He has always been criticized for many things, but he didn't care. It would be like water off a duck's back.", "frequency": 0, "id": 596, "text": "like water off a duck's back"}, {"category": "animals", "definition": "The majority, a large or generous portion.", "example": "The gang stole a lot of money from the bank. But the lion's share of the money went straight into the leader's pocket.", "frequency": 138, "id": 597, "text": "lion's share"}, {"category": "time", "definition": "This idiom means to continue living after the time you would have expected to have died. The idiom may also refer to something that continues to exist longer than expected.", "example": "The company lost a lot of money. It is living on borrowed time.", "frequency": 0, "id": 598, "text": "live on borrowed time ​"}, {"category": "language", "definition": "This idiom refers to a wording that aims at exerting an influence on an audience by using appeal to emotion or stereotypes.", "example": "Don't be fooled by commercials, they use a lot of loaded language.", "frequency": 3, "id": 599, "text": "loaded language"}, {"category": "war", "definition": "This idiom means to prepare for an imminent event.", "example": "It's time to lock and load.", "frequency": 3, "id": 600, "text": "lock and load"}, {"category": "music", "definition": "To come into conflict.", "example": "I don't want to lock horns with you. Let's settle this peacefully.", "frequency": 4, "id": 601, "text": "lock horns"}, {"category": "age", "definition": "Very old.", "example": "I think he is a bit long in the tooth to be a romantic hero in that play.", "frequency": 97, "id": 602, "text": "long in the tooth"}, {"category": "animals", "definition": "Said about a woman who tries to look much younger.", "example": "Her skirt is too short. She looks like mutton dressed as lamb.", "frequency": 0, "id": 603, "text": "look like mutton dressed as lamb"}, {"category": "war", "definition": "This idiom refers to a person who is unpredictable or uncontrolled and who is likely to cause unintentional damage.", "example": "He is considered a loose cannon because he is unable to control himself.", "frequency": 51, "id": 604, "text": "loose cannon"}, {"category": "clothes", "definition": "To lose all your money as a result of gambling or bad investment.", "example": "He lost his shirt yeterday in the casino.", "frequency": 8, "id": 605, "text": "lose your shirt"}, {"category": "love", "definition": "An instantaneous attraction", "example": "It was love at first sight when we met.", "frequency": 256, "id": 606, "text": "love at first sight"}, {"category": "love", "definition": "This idiom means that a person who is in love can see no faults or imperfections in the person who is loved.", "example": "I can't see why Leila likes Tim. He isn't even good-looking. Love is blind.", "frequency": 13, "id": 607, "text": "love is blind"}, {"category": "love", "definition": "A place where a couple can enjoy each other's company.", "example": "They rent an apartment which has become their love nest.", "frequency": 1, "id": 609, "text": "love nest"}, {"category": "death", "definition": "To love somebody very much.", "example": "He loves her to death.", "frequency": 0, "id": 610, "text": "love somebody to death"}, {"category": "love", "definition": "This idiom means to love someone very much.", "example": "She is the woman I love to bits.", "frequency": 0, "id": 611, "text": "love someone to bits"}, {"category": "relationship", "definition": "An interpersonal relationship involving simultaneous or alternating emotions of love and hate.", "example": "He has a love-hate relationship with his mother.", "frequency": 136, "id": 612, "text": "love-hate relationship"}, {"category": "weather", "definition": "Rainy weather.", "example": "What's the weather like there? It's a lovely weather for ducks.", "frequency": 0, "id": 614, "text": "lovely weather for ducks"}, {"category": "religion", "definition": "The least important man in a hierarchy or organization. (Opposite: high man on the totem pole)", "example": "He's not the man to talk to. He's just the low man on the totem pole.", "frequency": 4, "id": 615, "text": "low man on the totem pole"}, {"category": "food", "definition": "This idiom refers to something that is easily achieved or obtained or to something that can be obtained by readily available means.", "example": "After they started their small company, they wanted to go after the low-hanging fruit.", "frequency": 8, "id": 616, "text": "low-hanging fruit"}, {"category": "clothes", "definition": "This idiom means entirely false - without factual basis, entirely fabricated.", "example": "I don't believe what he says. It is made out of whole cloth to me.", "frequency": 0, "id": 619, "text": "made out of whole cloth"}, {"category": "general", "definition": "A special skill to do something very well.", "example": "Her magic touch is so obvious in the decoration of her house.", "frequency": 63, "id": 620, "text": "magic touch"}, {"category": "general", "definition": "A quick and an easy way to solve a problem", "example": "The manager warned that he had no magic wand to solve the problem.", "frequency": 114, "id": 621, "text": "magic wand"}, {"category": "money", "definition": "To earn money without much effort.", "example": "If you have got any idea of how to make a fast buck, please tell me!", "frequency": 46, "id": 623, "text": "make a fast buck"}, {"category": "men and women", "definition": "To make a young person become more experienced or act like an adult and take responsibility.", "example": "A couple of years in a foreign country will make a man of him.", "frequency": 0, "id": 624, "text": "make a man of someone"}, {"category": "animals", "definition": "To cause a person, group, or action to appear foolish or inferior, to subject someone or something to ridicule.", "example": "Don't make a monkey out of me. You'll regret it.", "frequency": 1, "id": 625, "text": "make a monkey out of"}, {"category": "nature", "definition": "To exagerate the severity of a situation, to make a lot of fuss about nothing.", "example": "You're making a mountain out of a molehill. You didn't mean to hurt her.", "frequency": 0, "id": 626, "text": "make a mountain out of a molehill"}, {"category": "animals", "definition": "Said about someone who eats too much or too fast.", "example": "He made a pig of himself at lunch.", "frequency": 0, "id": 627, "text": "make a pig of oneself"}, {"category": "money", "definition": "This idiom means to make an honest living.", "example": "After being behind bars for almost five years, he finally tasted freedom and started making an honest buck.", "frequency": 0, "id": 628, "text": "make an honest buck"}, {"category": "music", "definition": "Talk or chatter.", "example": "The boss was furious because he found them sitting there making chin music instead of doing the job.", "frequency": 0, "id": 629, "text": "make chin music"}, {"category": "weather", "definition": "To find something hard to do and make a fuss about it although it is not difficult.", "example": "He's making heavy weather of his share of work.", "frequency": 0, "id": 630, "text": "make heavy weather of something"}, {"category": "love", "definition": "A hippie anti-war slogan encouraging love and peace.", "example": "Why don't you stop fighting! Make love not war!", "frequency": 3, "id": 631, "text": "make love, not war"}, {"category": "travel", "definition": "To move in a particular direction, advance in life by one's own efforts.", "example": "He made his way to the police station and told all about the murder.", "frequency": 0, "id": 632, "text": "make one's way"}, {"category": "parts of the body", "definition": "When the smell or sight of food is extremely good it makes your mouth water.", "example": "The smell of that roast chicken is making my mouth water.", "frequency": 0, "id": 633, "text": "make somebody's mouth water"}, {"category": "nature", "definition": "To cause trouble.", "example": "Please don't make waves. We're trying to settle all our problems.", "frequency": 46, "id": 634, "text": "make waves"}, {"category": "home", "definition": "This idiom means that you ask someone to consider him as if he was in his own home.", "example": "Can I get in? Yes please, make yourself at home!", "frequency": 3, "id": 635, "text": "make yourself at home"}, {"category": "men and women", "definition": "This idiom is used to describe an ordinary person.", "example": "Generally speaking, politicians are rarely concerned with the needs and interests of the man in the street.", "frequency": 45, "id": 637, "text": "man in the street"}, {"category": "men and women", "definition": "This idiom refers to someone whom you can trust because he keeps his promises and always do what he says.", "example": "You can count on me. If I say that I'm going to help you, I will do it. I'm a man of my word.", "frequency": 22, "id": 638, "text": "man of his word"}, {"category": "men and women", "definition": "This idiom refers to someone who is very rich.", "example": "What a beautiful car! He must be a man of means.", "frequency": 33, "id": 639, "text": "man of means"}, {"category": "men and women", "definition": "A weak person.", "example": "When his wife needed his support, he run away and left her facing all the problems all alone. That is why, she called him a man of straw after all.", "frequency": 0, "id": 640, "text": "man of straw"}, {"category": "home", "definition": "This idiom suggest tha people are free to do whatever they want to in their own home", "example": "He was furious when they told him not to listen to his favorite music in his own home. He told them that a man's home is his castle.", "frequency": 1, "id": 641, "text": "man's home is his castle"}, {"category": "general", "definition": "Listen to me, used before a statement one wishes to emphasize.", "example": "Mark my words, this boy is going to become a great poet.", "frequency": 22, "id": 642, "text": "mark my words"}, {"category": "men and women", "definition": "This idiom refers to someone who is singled out as a target for vengeance or attack.", "example": "As a witness to the murder, he knew he was a marked man.", "frequency": 29, "id": 643, "text": "marked man"}, {"category": "money", "definition": "To marry a rich person.", "example": "She married money and got rich.", "frequency": 1, "id": 644, "text": "marry money"}, {"category": "love", "definition": "This idiom refers to two people, so well-suited to each other that their marriage is likely to be happy and successful.", "example": "As soon as they met, they liked each other and decided they should get married. They were really a match made in heaven.", "frequency": 71, "id": 645, "text": "match made in heaven"}, {"category": "time", "definition": "This idiom is used to say that something will certainly happen.", "example": "It is only a matter of time before he resigns.", "frequency": 375, "id": 646, "text": "matter of time"}, {"category": "sexuality", "definition": "The male genitals.", "example": "Everybody could see his meat and two veg because his trousers were so tight.", "frequency": 1, "id": 647, "text": "meat and two veg"}, {"category": "religion", "definition": "A place that a lot of people visit because it is known for something that they want to see or do.", "example": "Milan is a Mecca for fashion.", "frequency": 0, "id": 648, "text": "Mecca for someone or something"}, {"category": "death", "definition": "To die.", "example": "A friend of mine met his death when he got hit by a car.", "frequency": 0, "id": 649, "text": "meet one's death"}, {"category": "war", "definition": "Defeated by someone who is stronger or by a problem that is very difficult to surmount.", "example": "He met his Waterloo when he was challenged by the young contestant.", "frequency": 0, "id": 650, "text": "meet your Waterloo"}, {"category": "furniture", "definition": "This idiom means to have a very poor memory.", "example": "He's got a memory like a sieve", "frequency": 0, "id": 651, "text": "memory like a sieve"}, {"category": "men and women", "definition": "This idiom refers to the police or policemen.", "example": "The men in blue are chasing the drug dealer.", "frequency": 0, "id": 652, "text": "men in blue"}, {"category": "home", "definition": "It's often the men who build or acquire houses for their families, but it's usually women who provide the things that make a house into a home.", "example": "When her husband bought the house, she took charge of decorating and tidying it up. It's true that men make houses, women make homes.", "frequency": 0, "id": 653, "text": "men make houses, women make homes"}, {"category": "general", "definition": "having a centrist attitude or philosophy, not extreme, especially politically.", "example": "A typical middle of the road compromise is to leave the problem as it is.", "frequency": 179, "id": 654, "text": "middle of the road"}, {"category": "money", "definition": "Earning a lot of money quickly.", "example": "Since the arrival of the new manager, the restaurant is minting money.", "frequency": 0, "id": 655, "text": "minting money"}, {"category": "love", "definition": "This idiom means that if someone is miserable, they like others to be miserable too so that they can feel better about themselves.", "example": "I see that you got into a lot of trouble, but since your colleague is in trouble too, that makes you feel better. Misery loves company, doesn't it?", "frequency": 23, "id": 656, "text": "misery loves company"}, {"category": "travel", "definition": "To fail to take advantage of an opportunity.", "example": "The price discount ended yesterday and I just missed the boat on a great deal.", "frequency": 39, "id": 657, "text": "miss the boat"}, {"category": "general", "definition": "A perfect, ideal or suitable mate or husband.", "example": "She waited for years and years, hoping someday to find Mister Right.", "frequency": 0, "id": 658, "text": "Mister Right"}, {"category": "time", "definition": "A brief instance in which an otherwise obscure, unremarkable, or humble person draws attention.", "example": "That band got their moment in the sun during the 70s.", "frequency": 23, "id": 659, "text": "moment in the sun"}, {"category": "time", "definition": "A deciding instant, the time when a test determines or makes it apparent whether something will succeed.", "example": "This is the moment of truth, answer the questions of the test.", "frequency": 39, "id": 660, "text": "moment of truth"}, {"category": "money", "definition": "Said about a job when it is an easy way of earning money.", "example": "Selling ice-cream is money for old rope when it is very hot.", "frequency": 2, "id": 662, "text": "money for old rope"}, {"category": "money", "definition": "A business or product that makes a lot of money for someone.", "example": "Internet commerce is becoming a real money-spinner.", "frequency": 5, "id": 663, "text": "money spinner"}, {"category": "money", "definition": "This idiom suggest that with money people can get whatever they want.", "example": "She got what she wanted. Well you know money talks!", "frequency": 17, "id": 664, "text": "money talks"}, {"category": "travel", "definition": "This expression is used to say that people have to do what you say, otherwise, they will have to leave or quit the project.", "example": "He has a \"My way or the highway\" approach to leading his government and his party.", "frequency": 18, "id": 667, "text": "my way or the highway"}, {"category": "animals", "definition": "This idiom means completely naked.", "example": "She walked out into the dinning room naked as a jaybird", "frequency": 0, "id": 668, "text": "naked as a jaybird"}, {"category": "names", "definition": "To be in trouble, disgraced, or discredited.", "example": "If she doesn't prove her innocence, her name will be mud.", "frequency": 5, "id": 669, "text": "name is mud"}, {"category": "parts of the body", "definition": "This idiom means to show no reaction or not to display even a hint of an emotional response.", "example": "She didn't even bat an eyelid when they told her that her husband had an affair with his secretary.", "frequency": 0, "id": 683, "text": "not bat an eyelid"}, {"category": "names", "definition": "This idiom means to have a lot of money.", "example": "Her husband is not short of a bob or two.", "frequency": 0, "id": 684, "text": "not be short of a bob or two"}, {"category": "money", "definition": "Said about something that is of good quality and is therefore expensive.", "example": "Fast cars don't come cheap.", "frequency": 10, "id": 685, "text": "not come cheap"}, {"category": "animals", "definition": "Said abut a small place.", "example": "Their house was very small. There wasn't enough room to swing a cat.", "frequency": 0, "id": 686, "text": "not enough room to swing a cat"}, {"category": "time", "definition": "Not at all.", "example": "I don't want you to fail in your project. Not for a minute.", "frequency": 3, "id": 687, "text": "not for a minute"}, {"category": "general", "definition": "Pretty good, okay, decent.", "example": "It was my first attempt at cooking, but I tried it and it was not half bad.", "frequency": 25, "id": 688, "text": "not half bad"}, {"category": "animals", "definition": "Not to be able to achieve something.", "example": "He hasn't a cat in hell's chance of getting the money he needs for the project.", "frequency": 0, "id": 689, "text": "not have a cat in hell's chance"}, {"category": "parts of the body", "definition": "Not have a sound justification, a firm foundation of facts to prove something.", "example": "After the police caught him, he didn't have a leg to stand on to prove his innocence.", "frequency": 0, "id": 690, "text": "not have a leg to stand on"}, {"category": "religion", "definition": "Not to be able to achieve something.", "example": "He hasn't a snowball's chance of getting the money he needs for the project.", "frequency": 0, "id": 691, "text": "not have a snowball's chance in hell"}, {"category": "nature", "definition": "Said when an explanation, a reason or an argument is not sound, strong or logical.", "example": "Her reasons just didn't hold water.", "frequency": 13, "id": 692, "text": "not hold water"}, {"category": "time", "definition": "This idiom means never, not at any point or under absolutely no circumstances.", "example": "Do you think Liz will marry James? Not in a million years!\"", "frequency": 27, "id": 693, "text": "not in a million years"}, {"category": "general", "definition": "Said about someone who is extremely alert.", "example": "He was attentive to what the teacher was explaining. He didn't miss a trick.", "frequency": 0, "id": 694, "text": "not miss a trick"}, {"category": "death", "definition": "This idiom means that everything in life is uncertain. The only things that you can be sure of are:", "example": "I can't believe how much tax money we have to pay for setting up this business. You know, nothing is certain but death and taxes.", "frequency": 1, "id": 695, "text": "nothing is certain but death and taxes"}, {"category": "general", "definition": "Not bad, decent, acceptable, worthwhile.", "example": "Their music may not be worthy of radio time, but it's nothing to sneeze at.", "frequency": 27, "id": 696, "text": "nothing to sneeze at"}, {"category": "time", "definition": "Said when you have to do something right now because you may not get another chance to do it later.", "example": "This is your chance. It's now or never!", "frequency": 16, "id": 697, "text": "now or never"}, {"category": "health", "definition": "To look after a sick person until he recovers.", "example": "He is fortunate to have such a caring wife.She was glad to nurse him back to health.", "frequency": 0, "id": 698, "text": "nurse someone back to health"}, {"category": "nature", "definition": "A large amount of something.", "example": "Oceans of guests were at the party.", "frequency": 70, "id": 699, "text": "oceans of"}, {"category": "animals", "definition": "An unusual person, especially an individual with an idiosyncratic personality or peculiar behavioral characteristics.", "example": "This boy is an odd duck in many ways. Unlike his peers, he has no hobbies.", "frequency": 59, "id": 700, "text": "odd duck"}, {"category": "general", "definition": "Various often worthless small items.", "example": "I have to get rid of a few odds and ends before moving to the new house.", "frequency": 103, "id": 701, "text": "odds and ends"}, {"category": "age", "definition": "This idiom describes someone as old.", "example": "The conference is about the effect of advanced age on fertility and pregnancy in women.", "frequency": 4, "id": 703, "text": "of advanced age"}, {"category": "age", "definition": "Old enough to be considered an adult.", "example": "He's of age now, he can buy his own car.", "frequency": 4376, "id": 704, "text": "of age"}, {"category": "nature", "definition": "Of the best.", "example": "She is of the first water, a fine lady indeed.", "frequency": 25, "id": 705, "text": "of the first water"}, {"category": "travel", "definition": "To a place or places not commonly visited.", "example": "His trip was altogether off the beaten track which had never been traversed any European.", "frequency": 88, "id": 706, "text": "off the beaten track"}, {"category": "furniture", "definition": "In a form that is ready to be used.", "example": "It is often cheaper to buy off the shelf goods.", "frequency": 544, "id": 707, "text": "off the shelf"}, {"category": "travel", "definition": "This idiom refers to someone who no longer abstains from a habit or an addiction like alcoholic drinks.", "example": "In spite of falling off the wagon several times, he eventually succeeded in quitting.", "frequency": 71, "id": 708, "text": "off the wagon"}, {"category": "men and women", "definition": "A wrong traditional theory or belief, often about health.", "example": "The idea of drinking alcohol to relieve you from flu is an old wives' tale.", "frequency": 18, "id": 709, "text": "old wives' tale"}, {"category": "numbers", "definition": "This idiom means on one's hands and knees.", "example": "He was on all fours, with his daughter on his back.", "frequency": 27, "id": 710, "text": "on all fours"}, {"category": "age", "definition": "Old, advanced in age.", "example": "My wife is dead and I am getting on in years.", "frequency": 58, "id": 711, "text": "on in years"}, {"category": "parts of the body", "definition": "On the surface.", "example": "On the face of it, she seems innocent. But when the police investigated her case, they discovered that she was guilty.", "frequency": 47, "id": 712, "text": "on the face of it"}, {"category": "music", "definition": "To face a choice between two equally undesirable alternatives.", "example": "I found myself on the horns of dilemma and I didn't know which direction to choose.", "frequency": 1, "id": 713, "text": "on the horns of a dilemma"}, {"category": "technology and science", "definition": "Thinking in the same pattern or in agreement.", "example": "They've done a good job because they were on the same wavelength.", "frequency": 48, "id": 715, "text": "on the same wavelength"}, {"category": "furniture", "definition": "Being discussed or considered.", "example": "Everybody agreed to leave the plan to build a new school in our town on the table.", "frequency": 906, "id": 716, "text": "on the table"}, {"category": "crime", "definition": "This idiom is used to describe a person who is in a position of authority and takes or seeks to take bribes or illegal income.", "example": "This is a country where many officials are on the take.", "frequency": 55, "id": 717, "text": "on the take"}, {"category": "travel", "definition": "To abstain from drinking any alcoholic drink, usually in the sense of having given it up", "example": "No, thank you! No alcohol for me I am on the wagon.", "frequency": 43, "id": 718, "text": "on the wagon"}, {"category": "numbers", "definition": "This idiom means that once someone was hurt by something or someone, they will be afraid to try it again.", "example": "Since Leila broke up with her boyfriend, she has become very cautious about starting any new relationship. Once bitten, twice shy, you know!", "frequency": 0, "id": 719, "text": "once bitten, twice shy"}, {"category": "time", "definition": "This idiom means not very often or very rarely.", "example": "She sees him once in a blue moon.", "frequency": 40, "id": 720, "text": "once in a blue moon"}, {"category": "numbers", "definition": "This idiom means to be unique or special.", "example": "She was an extraordinary woman. She was really one of a kind.", "frequency": 948, "id": 721, "text": "one of a kind"}, {"category": "law", "definition": "This idiom means that what someone says must be obeyed.", "example": "There's no point trying to do things differently. The manager's word is law around here. Just do what he asks you to do.", "frequency": 0, "id": 722, "text": "one's word is law"}, {"category": "time", "definition": "This idiom refers to something or someone that attracts great interest for a short time but is subsequently forgotten.", "example": "Their performance was just a one-day wonder.", "frequency": 0, "id": 723, "text": "one-day wonder"}, {"category": "numbers", "definition": "Occurring once, one-time.", "example": "It is a one-off event.", "frequency": 154, "id": 724, "text": "one-off"}, {"category": "colors", "definition": "Something which is totally unexpected.", "example": "She sent him a letter, out of the blue, telling him that she was in love with another guy.", "frequency": 367, "id": 725, "text": "out of the blue"}, {"category": "general", "definition": "To provide energy, power, or excitement.", "example": "This drink really packs a wallop.", "frequency": 21, "id": 728, "text": "pack a wallop"}, {"category": "travel", "definition": "To act independently and decide your own fate, to do something by oneself.", "example": "He's been left to paddle his own canoe when he started his business.", "frequency": 0, "id": 729, "text": "paddle one's own canoe"}, {"category": "parts of the body", "definition": "An annoyance.", "example": "The teacher's last assignment is really a pain in the neck.", "frequency": 56, "id": 730, "text": "pain in the neck"}, {"category": "art", "definition": "This idiom means to describe something in general terms, without mentioning specific details and without paying attention to individual variations.", "example": "When asked about his policy to reform the educational system, the president painted his plan with a broad brush.", "frequency": 0, "id": 731, "text": "paint something with a broad brush"}, {"category": "general", "definition": "To blame others for something you shoud accept reponsibilty for.", "example": "It's not my fault. Don't try to pass the buck!", "frequency": 10, "id": 732, "text": "pass the buck"}, {"category": "clothes", "definition": "To collect money by asking people or organizations.", "example": "They passed the hat round as they needed money to rebuild the poor neighbors' house.", "frequency": 0, "id": 733, "text": "pass the hat around"}, {"category": "names", "definition": "This idiom means to have a great amount of patience.", "example": "In spite of their extreme poverty, they managed to raise ten children. They really have the patience of Job.", "frequency": 3, "id": 734, "text": "patience of Job"}, {"category": "names", "definition": "This idiom means very patient.", "example": "You have to be as patient as Job to have a talk with that nasty woman.", "frequency": 2, "id": 735, "text": "patient as Job"}, {"category": "general", "definition": "To suffer because of a particlar action.", "example": "If you don't work hard, you will pay dearly for it.", "frequency": 38, "id": 736, "text": "pay dearly"}, {"category": "parts of the body", "definition": "An insincere loyalty, respect, or support for something", "example": "He says he supports the idea of voluntary work, but in fact he's just paying lip service.", "frequency": 39, "id": 737, "text": "pay lip service"}, {"category": "money", "definition": "This idiom means to earn respect or a position by a lot of hard work and sacrifice.", "example": "They want me to resign, but everybody knows that I paid my dues to get this position.", "frequency": 3, "id": 738, "text": "pay your dues"}, {"category": "general", "definition": "The best.", "example": "The dress she's wearing is the pick of the bunch.", "frequency": 2, "id": 739, "text": "pick of the bunch"}, {"category": "money", "definition": "This idiom means to pay the bill.", "example": "John picks up the tab whenever he has dinner with his friends.", "frequency": 3, "id": 740, "text": "pick up the tab"}, {"category": "health", "definition": "In a very healthy condition.", "example": "The doctor told him that he is a picture of good health.", "frequency": 1, "id": 741, "text": "picture of health"}, {"category": "general", "definition": "A picture will be far more descriptive of something than words can ever be.", "example": "Just show him the photos and he will understand. You know a picture paints a thousand words.", "frequency": 1, "id": 742, "text": "picture paints a thousand words"}, {"category": "dreams", "definition": "This idiom refers to a goal that is impossible to accomplish.", "example": "His plan is unrealistic. It is no more than a pipe dream.", "frequency": 68, "id": 743, "text": "pipe dream"}, {"category": "relationship", "definition": "To deceive someone for fun.", "example": "On April fool's day some people play practical jokes on their friends.", "frequency": 7, "id": 744, "text": "play a joke"}, {"category": "sport", "definition": "To cooperate and agree to work with others.", "example": "The manager asked him to play ball if he wants things to go well.", "frequency": 79, "id": 746, "text": "play ball"}, {"category": "sport", "definition": "This idiom means to act rough and ruthless with someone.", "example": "I want to get my money back from him. So, I decided to play hardball.", "frequency": 0, "id": 748, "text": "play hardball with someone"}, {"category": "relationship", "definition": "To take a subordinate or weaker position than someone else.", "example": "Bill doesn't want to play second fiddle to his colleague any more. He feels he is more trained and more experienced.", "frequency": 16, "id": 749, "text": "play second fiddle"}, {"category": "sexuality", "definition": "To have many sexual relationships.", "example": "He's not the kind of person to think of getting married. He's quite happy to play the field.", "frequency": 5, "id": 750, "text": "play the field"}, {"category": "art", "definition": "This idiom refers to a situation in which virtue is rewarded and vice is punished, in such a way that this justice seems proper and ironic.", "example": "It is poetic justice that the economic crisis is affecting the bankers who are blamed for causing it in the first place.", "frequency": 111, "id": 751, "text": "poetic justice"}, {"category": "art", "definition": "Something graceful and beautiful to observe.", "example": "The girl was like poetry in motion when she was dancing.", "frequency": 22, "id": 752, "text": "poetry in motion"}, {"category": "health", "definition": "This idiom refers to is a type of defensive tactic used by companies against a takeover.", "example": "Many companies have used poison pill strategies against hostile takeovers.", "frequency": 15, "id": 753, "text": "poison pill"}, {"category": "religion", "definition": "This idiom means that we shouldn't condemn people for their poverty.", "example": "It is a pity that the police are chasing those beggars. Poverty is no sin.", "frequency": 0, "id": 754, "text": "poverty is no sin"}, {"category": "crime", "definition": "This idiom is used to mean that it is not a crime to be poor and that we shouldn't condemn people for their poverty.", "example": "I don't know why the police are chasing those poor people out of town. Poverty is not a crime.", "frequency": 0, "id": 755, "text": "poverty is not a crime"}, {"category": "religion", "definition": "This idiom means to ​try to convince people of something that they already ​believe.", "example": "You are just preaching to the choir. It is pointless to convince us of the value of exercising. We all agree that exercising is good for our health.", "frequency": 15, "id": 756, "text": "preach to the choir"}, {"category": "time", "definition": "This idiom means that you are in a hurry.", "example": "I am sorry, I can't talk to you right now, I'm pressed for time.", "frequency": 48, "id": 757, "text": "pressed for time"}, {"category": "crime", "definition": "This idiom indicates a feeling of guilt. The idiom makes reference to a feeling that causes a sharp mental pain or remorse.", "example": "The picture of the dead Syrian boy lying face down in the sand on a Turkish beach pricked my conscience.", "frequency": 0, "id": 758, "text": "prick of conscience"}, {"category": "numbers", "definition": "This idiom refers someone or something that people hate.", "example": "That terrorist is considered public enemy number one.", "frequency": 20, "id": 759, "text": "public enemy number one"}, {"category": "music", "definition": "To become less impassioned, aggressive, or argumentative, to back down from a fight, to yield or capitulate.", "example": "They stopped making investments. They pulled in their horns.", "frequency": 0, "id": 760, "text": "pull in one's horns"}, {"category": "parts of the body", "definition": "To tease or fool someone when trying to convince them to believe something which is not true as a joke.", "example": "Are you pulling my leg? Is it really your house?", "frequency": 0, "id": 761, "text": "pull somebody's leg"}, {"category": "parts of the body", "definition": "Used when you do not believe what someone has just said.", "example": "Sue, writing poems? Pull the other leg - she can't even write a correct sentence!", "frequency": 0, "id": 762, "text": "Pull the other leg"}, {"category": "numbers", "definition": "Used to tell someone that you don't believe what they have just said.", "example": "Sue, writing poems? Pull the other one - she can't even write a correct sentence!", "frequency": 6, "id": 763, "text": "Pull the other one"}, {"category": "technology and science", "definition": "This idiom means to put an end to an activity, preventing it from continuing.", "example": "They are going to pull the plug on the new TV show because it didn't get any sponsors.", "frequency": 45, "id": 764, "text": "pull the plug"}, {"category": "love", "definition": "A childish or youthful infatuation with another person.", "example": "As they were still very young nobody took their puppy love seriously.", "frequency": 68, "id": 765, "text": "puppy love"}, {"category": "technology and science", "definition": "Draw a strong emotional reaction from someone, especially anger or sexual arousal.", "example": "Don't push my buttons with your silly comments.", "frequency": 0, "id": 766, "text": "push someone's buttons"}, {"category": "money", "definition": "To bet money or to believe that someone will accomplish something or that something will happen.", "example": "He will pass the exam - I'd put money on it.", "frequency": 0, "id": 769, "text": "put money on somebody or something"}, {"category": "parts of the body", "definition": "To pretend that a problem doesn't bother you.", "example": "He looks calm, but I suspect he's just putting on a brave face.", "frequency": 7, "id": 770, "text": "put on a brave face"}, {"category": "parts of the body", "definition": "This idiom means to put all your energy and sincere effort into something, to work hard in order to do or get something.", "example": "They are putting their hearts into producing innovative products that would utterly change people's lives.", "frequency": 0, "id": 771, "text": "put one's heart into something"}, {"category": "parts of the body", "definition": "To apply oneself, to exert a directed effort.", "example": "You can do anything, if you put your mind to it.", "frequency": 0, "id": 772, "text": "put one's mind to it"}, {"category": "animals", "definition": "To create a disturbance and cause trouble.", "example": "The principal put the cat among the pigeons when he informed the students that the excursion was cancelled.", "frequency": 0, "id": 773, "text": "put the cat among the pigeons"}, {"category": "travel", "definition": "To press the gas pedal to the maximum extent, to exert maximum effort.", "example": "You have to put the pedal to the metal if you want to get there on time.", "frequency": 6, "id": 774, "text": "put the pedal to the metal"}, {"category": "parts of the body", "definition": "To attribute to somebody something he or she did not say, to claim inaccurately that somebody said or intended something.", "example": "I hope I'm not putting words in your mouth. Did you just tell me to go home early?", "frequency": 0, "id": 775, "text": "put words in somebody's mouth"}, {"category": "age", "definition": "To make someone look or feel much older.", "example": "Hi financial problems put years on him.", "frequency": 0, "id": 776, "text": "put years on"}, {"category": "clothes", "definition": "To see how it feels when you put yourself in someone's place.", "example": "What could I have done to solve the problem? Just put yourself in my shoes.", "frequency": 0, "id": 777, "text": "put yourself in someone's shoes"}, {"category": "clothes", "definition": "To be frightened, scared, or nervous.", "example": "The thought of climbing that high had him quaking in his boots.", "frequency": 0, "id": 778, "text": "quake in one's boots"}, {"category": "time", "definition": "Said about something that will surely happen.", "example": "The criminal will be arrested. It's just a question of time.", "frequency": 28, "id": 779, "text": "question of time"}, {"category": "time", "definition": "This idiom means very quickly.", "example": "Please allow me five minutes of your time, I don't think you will be disappointed. I will finish the work as quick as lightening.", "frequency": 0, "id": 780, "text": "quick as a wink"}, {"category": "numbers", "definition": "to have a drink before going somewhere.", "example": "Let's have a quick one before we go to work.", "frequency": 69, "id": 781, "text": "quick one"}, {"category": "parts of the body", "definition": "To think very hard about something.", "example": "I've racked my brain all day long, but I still can't remember where I put the keys.", "frequency": 0, "id": 784, "text": "rack one's brain"}, {"category": "money", "definition": "This idiom refers to any situation in which a person rises from poverty to wealth.", "example": "He was homeless and went on to create the largest and most successful service company in the country. It's really a rags-to-riches story.", "frequency": 140, "id": 785, "text": "rags to riches"}, {"category": "animals", "definition": "To rain heavily. It's raining cats and dogs.", "example": "How come that you are going out in that storm? It's raining cats and dogs.", "frequency": 0, "id": 786, "text": "rain cats and dogs"}, {"category": "nature", "definition": "Whatever happens, no matter whether it is rainy or sunny.", "example": "I'll be on time, rain or shine.", "frequency": 9, "id": 787, "text": "rain or shine"}, {"category": "parts of the body", "definition": "To cause surprise or mild disapproval.", "example": "The way the children behaved raised a few eyebrows the hosts.", "frequency": 45, "id": 788, "text": "raise eyebrows"}, {"category": "relationship", "definition": "Said when someones is ill treated.", "example": "Mary got a raw deal. She was innocent, but she had to pay a big fine.", "frequency": 41, "id": 789, "text": "raw deal"}, {"category": "law", "definition": "To warn or reprimand someone energetically or forcefully", "example": "The principal read the riot act to the trouble makers", "frequency": 0, "id": 790, "text": "read the riot act"}, {"category": "colors", "definition": "A sign or signal that something is wrong cue, it is a warning, or alert.", "example": "She considered that playing with her feelings was a red flag. She wouldn't tolerate anyone to do so.", "frequency": 225, "id": 791, "text": "red flag"}, {"category": "colors", "definition": "Be discovered in or just after the act of doing something wrong or illegal", "example": "She was caught red-handed, stealing a ring.", "frequency": 18, "id": 792, "text": "red handed"}, {"category": "colors", "definition": "A euphemism for financial loss.", "example": "There is too much red ink in the company's financial statement.", "frequency": 99, "id": 793, "text": "red ink"}, {"category": "colors", "definition": "A particularly significant day (personal or sectarian), usually very positive, sometimes very negative.", "example": "Monday was a red letter day for her. She accomplished a lot and had fun doing it.", "frequency": 0, "id": 794, "text": "red-letter day"}, {"category": "religion", "definition": "To be strict and conscientious about something.", "example": "He is religious about respecting the law.", "frequency": 0, "id": 796, "text": "religious about doing something"}, {"category": "war", "definition": "This idiom means to sit in the front passenger seat of a vehicle during a trip. Figuratively, the idiom refers to the support or aid given to someone in a situation or project.", "example": "Would you like to come to the party and ride shotgun? We really need your help!", "frequency": 2, "id": 797, "text": "ride shotgun"}, {"category": "weather", "definition": "This idiom is used to mean that everything is perfectly fine, all right", "example": "She had had a lot of problem with her parents. But as soon as she got married, everything was right as rain for her.", "frequency": 9, "id": 798, "text": "right as rain"}, {"category": "general", "definition": "Considering even minor things or people.", "example": "We are all concerned with obeying the law, from the minister down to the common man.", "frequency": 858, "id": 799, "text": "right down to"}, {"category": "general", "definition": "To be exactly right.", "example": "Her remarks were right on the button.", "frequency": 9, "id": 800, "text": "right on the button"}, {"category": "age", "definition": "Very old age.", "example": "After living to a ripe old age, she died yesterday.", "frequency": 88, "id": 801, "text": "ripe old age"}, {"category": "travel", "definition": "Aggressive behavior exhibited by drivers in traffic, often as a result of stress.", "example": "Many road accidents are the result of road rage.", "frequency": 92, "id": 802, "text": "road rage"}, {"category": "clothes", "definition": "This idiom means to prepare for hard work.", "example": "Let's roll up our sleeves, work together, and try to get the work done.", "frequency": 0, "id": 803, "text": "roll one's sleeves up"}, {"category": "time", "definition": "Said to emphasize that great work takes time to do. Nothing of importance can be done in a short period of time.", "example": "Don't expect immediate outstanding earnings fom your new buisiness. Rome wasn't built in a day.", "frequency": 6, "id": 804, "text": "Rome wasn't built in a day"}, {"category": "home", "definition": "To build a roof over something.", "example": "After the earthquake they had to roof the shed over.", "frequency": 0, "id": 805, "text": "roof something over"}, {"category": "nature", "definition": "Completely.", "example": "They have reorganized their business root and branch.", "frequency": 2, "id": 806, "text": "root and branch"}, {"category": "time", "definition": "This idiom means a hard or bad time.", "example": "It was such a rough time.", "frequency": 1199, "id": 807, "text": "rough time"}, {"category": "time", "definition": "This idiom refers to something happening or done all day and all night.", "example": "They have been working round the clock to solve the problem.", "frequency": 87, "id": 808, "text": "round the clock"}, {"category": "colors", "definition": "This idiom means to continue driving through an intersection having a red traffic light without stopping.", "example": "I was so late to work and to make matters worse I got a ticket for running a red light yesterday.", "frequency": 2, "id": 809, "text": "run a red light"}, {"category": "life", "definition": "This idiom means to run away to save one's life.", "example": "A lion escaped from the zoo. Run for your life.", "frequency": 0, "id": 810, "text": "run for one's life"}, {"category": "animals", "definition": "To support both sides of an argument.", "example": "She never takes a clear position in any dispute. She always tries to run with the hare and hunt with the hounds.", "frequency": 0, "id": 812, "text": "run with the hare and hunt with the hounds"}, {"category": "war", "definition": "This idiom refers to an argument that continues over a long period of time.", "example": "He was fired because he had a running battle with his boss.", "frequency": 24, "id": 813, "text": "running battle"}, {"category": "animals", "definition": "Anything someone believes in without ever being able to question or criticize.", "example": "He didn't like to discuss the sacred cow of his new religious beliefs.", "frequency": 236, "id": 814, "text": "sacred cow"}, {"category": "health", "definition": "Safe and without injury or damage.", "example": "The kids returned from the excursion safe and sound.", "frequency": 45, "id": 815, "text": "safe and sound"}, {"category": "numbers", "definition": "By being part of a large physical group or mass, an individual is proportionally less likely to be the victim of a mishap, accident, attack, or other bad event.", "example": "Nobody went sightseeing alone, knowing that there was safety in numbers.", "frequency": 11, "id": 816, "text": "safety in numbers"}, {"category": "nature", "definition": "To work to achieve something that is difficult because most people would oppose it.", "example": "The journalist is sailing against the wind in his attempt to change people's negative attitude towards that politician.", "frequency": 0, "id": 817, "text": "sail against the wind"}, {"category": "nature", "definition": "To act just within the limits of what is legal or acceptable.", "example": "His business is doing well although he sometimes sail close to the wind.", "frequency": 0, "id": 818, "text": "sail close to the wind"}, {"category": "travel", "definition": "To pass or progress quickly and easily.", "example": "He sailed right through his homework.", "frequency": 0, "id": 819, "text": "sail through something"}, {"category": "nature", "definition": "Said about somone who is honest and good.", "example": "He is the salt of the earth. He always helps the poor.", "frequency": 29, "id": 820, "text": "salt of the earth"}, {"category": "parts of the body", "definition": "To take an action or make a gesture intended to preserve one\\'s reputation or honor.", "example": "They tried to win their last match in the championship just to save face.", "frequency": 86, "id": 821, "text": "save face"}, {"category": "money", "definition": "This idiom means to reserve money for a time when it might be needed unexpectedly.", "example": "I Kept some extra money for a rainy day.", "frequency": 0, "id": 822, "text": "save money for a rainy day"}, {"category": "relationship", "definition": "To admit failure.", "example": "I'll show them how I can be a superstar. I'm not going to say uncle.", "frequency": 3, "id": 824, "text": "say uncle"}, {"category": "general", "definition": "Tell what you have to say", "example": "Stop annoying us. Say your piece and go.", "frequency": 0, "id": 825, "text": "Say your piece"}, {"category": "animals", "definition": "Someone who is easily frightened.", "example": "Come on, scaredy cat. The dog won't bite you!", "frequency": 6, "id": 826, "text": "scaredy cat"}, {"category": "men and women", "definition": "This idiom refers to a prostitute, an immoral woman, particularly one who commits adultery.", "example": "She was the scarlet woman of the town.", "frequency": 2, "id": 827, "text": "scarlet woman"}, {"category": "parts of the body", "definition": "This idiom means to think hard or wonder about something.", "example": "Faced with the new evidence, the great detective scratched his head.", "frequency": 2, "id": 828, "text": "scratch one's head"}, {"category": "crime", "definition": "To protest loudly and angrily as if something very serious has happened.", "example": "There is no point in screaming bloody murder about the new law.", "frequency": 6, "id": 829, "text": "scream bloody murder"}, {"category": "colors", "definition": "To shout or complain loudly because you are annoyed about something.", "example": "Because he didn't get what he wanted, he screamed blue murder.", "frequency": 0, "id": 830, "text": "scream blue murder"}, {"category": "general", "definition": "To understand the meaning that someone is trying to convey.", "example": "Yes, I see your point and I think you are absolutley right.", "frequency": 0, "id": 832, "text": "see someone's point"}, {"category": "nature", "definition": "To persuade people to go against their best interests or to accept something unnecessary or preposterous.", "example": "He's such a smooth talker, he could sell ice to Eskimos.", "frequency": 0, "id": 833, "text": "sell ice to Eskimos"}, {"category": "food", "definition": "This idiom refers to something that is sold very quickly and in large numbers.", "example": "The store is selling the books like hotcakes.", "frequency": 6, "id": 834, "text": "sell like hotcakes"}, {"category": "religion", "definition": "This idiom means to be willing to do anything for money or some other reward.", "example": "She sold her soul to get married to the old rich millionaire.", "frequency": 1, "id": 835, "text": "sell your soul to the devil"}, {"category": "love", "definition": "This idiom refers to an affectionate greeting or message given to someone.", "example": "Lisa sent her love to all the family.", "frequency": 0, "id": 836, "text": "send love to someone"}, {"category": "parts of the body", "definition": "To terrify, to make someone feel extremely nervous.", "example": "Hearing that the killer escaped prison sent shivers down my spine.", "frequency": 0, "id": 837, "text": "send shivers down someone's spine"}, {"category": "general", "definition": "To test public opinion and response to something.", "example": "They had an excellent idea for the project. They sent up a trial balloon but the response was very negative.", "frequency": 0, "id": 838, "text": "send up a trial balloon"}, {"category": "food", "definition": "To separate things of value from things of no value.", "example": "We got a lot of applicants for the job. But we are trying to separate the wheat from the chaff.", "frequency": 40, "id": 839, "text": "separate the wheat from the chaff"}, {"category": "crime", "definition": "Saying that someone is serving time means that he is in prison.", "example": "After the gangster had served his time in jail, he got married and found a job.", "frequency": 17, "id": 840, "text": "serve time"}, {"category": "crime", "definition": "The best person to catch a thief is another thief, because he or she knows how thieves think.", "example": "The government set a thief to catch a thief. They hired a hacker to entrap other hackers who tried to break into the Pentagon's databases.", "frequency": 0, "id": 841, "text": "set a thief to catch a thief"}, {"category": "sport", "definition": "Start something, especially a conversation or a social event.", "example": "There was a quiet atmosphere in the party so I decided to set the ball rolling and got up to dance.", "frequency": 7, "id": 842, "text": "set the ball rolling"}, {"category": "general", "definition": "To initiate a chain of events necessary to help one achieve a goal (more quickly)", "example": "His contribution to the project will surely set the wheels in motion.", "frequency": 4, "id": 843, "text": "set the wheels in motion"}, {"category": "parts of the body", "definition": "Used to tell someone to rouse themselves from sleep and get out of bed.", "example": "Shake a leg or we'll miss the party!", "frequency": 0, "id": 844, "text": "shake a leg"}, {"category": "clothes", "definition": "This idiom mean to be very terrified or anxious.", "example": "He was shaking in his shoes when he was face-to-face with the criminal.", "frequency": 0, "id": 845, "text": "shake in one's shoes"}, {"category": "general", "definition": "To either improve one's behavior or else be required to leave, to either improve one\\'s performance in an activity or else withdraw from that activity completely.", "example": "After his many serious mistakes, the boss warned him that he had to shape up or ship out.", "frequency": 1, "id": 846, "text": "shape up or ship out"}, {"category": "food", "definition": "Everything will be all right.", "example": "What about our trip to the mountain. They say it will snow all night long. Don't worry. She'll be apples.", "frequency": 0, "id": 847, "text": "she'll be apples"}, {"category": "life", "definition": "The length of time something will last.", "example": "This medicine has a short shelf life.", "frequency": 179, "id": 848, "text": "shelf life"}, {"category": "general", "definition": "To change what you are doing in a sudden way.", "example": "I'd like to shift gears and start a new job.", "frequency": 52, "id": 849, "text": "shift gears"}, {"category": "parts of the body", "definition": "This idiom refers to a feeling of fear excitement, nervousness or anticipation.", "example": "The boy felt a shiver down his spine at the thought of the punishment he will get from his teacher.", "frequency": 0, "id": 850, "text": "shiver down one's spine"}, {"category": "work", "definition": "To spend all the money you have or to try as much as you can to do something.", "example": "We shot the works on our son's education.", "frequency": 1, "id": 851, "text": "shoot the works"}, {"category": "war", "definition": "This idiom indicates a warning to stop doing something.", "example": "The way the teacher scolded the kids after class is a shot across the bow.", "frequency": 9, "id": 852, "text": "shot across the bow"}, {"category": "war", "definition": "This idiom refers to a hopeful attempt at something or a wild guess especially when you have no certain information or knowledge about the subject.", "example": "It was just a shot in the dark, but I was right!", "frequency": 30, "id": 853, "text": "shot in the dark"}, {"category": "sexuality", "definition": "When the bridegroom is forced to marry the bride he made her pregnant.", "example": "It was a shotgun marriage. Nancy was three months pregnant when she married John.", "frequency": 7, "id": 854, "text": "shotgun marriage"}, {"category": "parts of the body", "definition": "Said about a person someone to whom you can tell your problems to and then ask for sympathy, emotional support and advice.", "example": "Lacy needs a shoulder to cry on. Her father died yesterday.", "frequency": 10, "id": 855, "text": "shoulder to cry on"}, {"category": "law", "definition": "This idiom refers to a document or an agreement which has been officially signed and completed satisfactorily.", "example": "John: Hey, have you finalized the purchase of the estate yet? Yes, I got all the documents... signed, sealed, and delivered!", "frequency": 1, "id": 856, "text": "signed, sealed and delivered"}, {"category": "music", "definition": "to agree about a subject in public in spite of someones disagreement.", "example": "He wanted his ministers to be singing the same tune before the press conference.", "frequency": 0, "id": 857, "text": "sing the same tune"}, {"category": "animals", "definition": "Said about someone or something vulnerable to attack.", "example": "Because of his unpopular opinions about foreign policy, he made of himself a sitting duck.", "frequency": 35, "id": 859, "text": "sitting duck"}, {"category": "parts of the body", "definition": "To be underweight and look bad, to be extremely thin.", "example": "Because of her illness she was nothing but skin and bones.", "frequency": 10, "id": 860, "text": "skin and bones"}, {"category": "animals", "definition": "This idiom refers to a person whom one has treated well and taken care of but turned out to be traitorous, untrustworthy, or ungrateful.", "example": "He loved her so much and treated her like a queen. But, after ten years of marriage, he found out that he had cherished a snake in his bosom. She run off with a younger man.", "frequency": 0, "id": 863, "text": "snake in one's bosom"}, {"category": "animals", "definition": "This idiom refers to a treacherous or deceitful person.", "example": "He's a guy you can't trust, a snake in the grass.", "frequency": 2, "id": 864, "text": "snake in the grass"}, {"category": "animals", "definition": "This idiom refers to a person who who knowingly sells fraudulent goods or who is himself a fraud, quack, or charlatan.", "example": "Don't believe those snake oil salesmen on TV selling holistic medicines.", "frequency": 23, "id": 865, "text": "snake oil salesman"}, {"category": "parts of the body", "definition": "This idiom means to be completely wet or drenched.", "example": "It was raining cats and dogs. We knew we would be soaked to the bone, but we had to walk on to arrive on time to our destination.", "frequency": 1, "id": 866, "text": "soaked to the bone"}, {"category": "food", "definition": "To be very sour and disagreeable.", "example": "Mike is sour as vinegar this morning.", "frequency": 0, "id": 867, "text": "sour as vinegar"}, {"category": "food", "definition": "This idiom refers to something that one cannot afford and so speaks about it as if it were never desirable.", "example": "He thinks that it isn't a beautiful house, but that's just sour grapes because he can't afford it.", "frequency": 134, "id": 868, "text": "sour grapes"}, {"category": "religion", "definition": "Used about someone who appears unexpectedly while being talked about.", "example": "Speak of the Devil! look who's coming.", "frequency": 1, "id": 869, "text": "speak of the devil"}, {"category": "war", "definition": "This idiom means to ruin someone's plans or prevent someone's success.", "example": "The rain has spiked our guns. We cannot go for a picnic as planned.", "frequency": 0, "id": 870, "text": "spike someone's guns"}, {"category": "food", "definition": "To reveal a secret.", "example": "Why did you spill the beans about our new project? It was supposed to be top secret.", "frequency": 55, "id": 871, "text": "spill the beans"}, {"category": "animals", "definition": "To be old, not young anymore.", "example": "She is not a spring chicken. She wouldn't like to go partying with us.", "frequency": 18, "id": 872, "text": "spring chicken"}, {"category": "art", "definition": "To say something in a loud whisper with the intention of being overheard.", "example": "She told him in a stage whisper, \"I am fed up with your behavior\"", "frequency": 3, "id": 874, "text": "stage whisper"}, {"category": "time", "definition": "To last for a long time.", "example": "Their marriage has stood the test of time.", "frequency": 712, "id": 875, "text": "stand the test of time"}, {"category": "art", "definition": "This idiom reflects the highest level of development, something that is very up-to-date.", "example": "This car reflects the state of the art in automobile industry.", "frequency": 439, "id": 876, "text": "state of the art"}, {"category": "clothes", "definition": "To take over someone's place or job.", "example": "Who do you think will step into Leila's shoes when she leaves?", "frequency": 0, "id": 877, "text": "step into somebody's shoes"}, {"category": "war", "definition": "This idiom means to refuse to change one's convictions or beliefs, to maintain one's position in the face of opposition.", "example": "They stuck to their guns and continued the fight for civil rights", "frequency": 0, "id": 878, "text": "stick to one's guns"}, {"category": "parts of the body", "definition": "This idiom displays fortitude in the face of adversity, or exercises self-restraint in the expression of emotion.", "example": "He always has a stiff upper lip. He never complains.", "frequency": 57, "id": 879, "text": "stiff upper lip"}, {"category": "animals", "definition": "To make trouble.", "example": "Don't bring up that topic again in the meeting. You will be stirring up a hornets' nest.", "frequency": 0, "id": 880, "text": "stir up a hornets' nest"}, {"category": "crime", "definition": "A decoy or an informer, especially one who is a spy for the police.", "example": "He was killed by a gangster because he was thought to be a stool pigeon.", "frequency": 9, "id": 881, "text": "stool pigeon"}, {"category": "nature", "definition": "This idiom means that there is going to be a storm. It may also mean that there is going to be trouble or emotional upset in the near future.", "example": "It is very cloudy today. A storm is brewing.", "frequency": 6, "id": 882, "text": "storm is brewing"}, {"category": "money", "definition": "To be short of money.", "example": "I'm strapped for cash, can you lend me ten dollars?", "frequency": 45, "id": 883, "text": "strapped for cash"}, {"category": "music", "definition": "To remind you of something, it seems familiar to you or you are interested in it.", "example": "That woman struck a chord with me. It seems to me that I had seen her before.", "frequency": 111, "id": 884, "text": "strike a chord"}, {"category": "work", "definition": "To work very hard.", "example": "She sweats blood every day just to bring home the bacon.", "frequency": 16, "id": 885, "text": "sweat blood"}, {"category": "furniture", "definition": "To hide or ignore something.", "example": "You've made a terrible mistake. Don't try to sweep it under the carpet!", "frequency": 0, "id": 886, "text": "sweep something under the carpet"}, {"category": "home", "definition": "To hide something because it's embarassing.", "example": "Because many famous people were involved in the affair, everything was swept under the rug.", "frequency": 0, "id": 887, "text": "sweep something under the rug"}, {"category": "sport", "definition": "This idiom means to do something that is in opposition to the prevailing opinion or tendency.", "example": "Don't waste your time and energy swimming against the tide.", "frequency": 5, "id": 888, "text": "swim against the tide"}, {"category": "health", "definition": "This idiom means to pause, especially in order to make oneself feel strong and confident.", "example": "She took a deep breath before doing the hardest part of her work.", "frequency": 120, "id": 889, "text": "take a deep breath"}, {"category": "war", "definition": "To disapprove of something.", "example": "I know the question is difficult to answer. Yet, I'd like to take a stab at answering it.", "frequency": 3, "id": 890, "text": "take a dim view of"}, {"category": "travel", "definition": "To deceive or cheat.", "example": "It was only when he discovered that his wallet was gone that he realized they had taken him for a ride.", "frequency": 0, "id": 891, "text": "take for a ride"}, {"category": "numbers", "definition": "This idiom means to take a nap for a short period of time.", "example": "I'll just take forty winks before getting ready for work.", "frequency": 0, "id": 892, "text": "take forty winks"}, {"category": "parts of the body", "definition": "If you take an unpleasant event or a difficult situation on the chin, you accept it bravely and without complaining.", "example": "I took the criticism on the chin and went on working on the project until I succeeded.", "frequency": 12, "id": 893, "text": "take it on the chin"}, {"category": "general", "definition": "To run away.", "example": "The criminal had to take it on the lam.", "frequency": 0, "id": 894, "text": "take it on the lam"}, {"category": "general", "definition": "Said about an offer when you either accept it or reject it completely.", "example": "This is my offer, take it or leave it.", "frequency": 86, "id": 895, "text": "take it or leave it"}, {"category": "clothes", "definition": "Said when you admire someone for an achievement.", "example": "If she manages to deal with three small children and a full-time job, I'll take my hat off to her.", "frequency": 0, "id": 896, "text": "take one's hat off to someone"}, {"category": "life", "definition": "To kill someone.", "example": "The floods took hundreds of lives.", "frequency": 0, "id": 897, "text": "take someone's life"}, {"category": "parts of the body", "definition": "To take charge.", "example": "The company needed a new manager for the project. So he took the bit between his teeth.", "frequency": 0, "id": 898, "text": "take the bit between one's teeth"}, {"category": "animals", "definition": "To deal with a matter in a direct manner, especially to confront a difficulty rather than avoid it.", "example": "He was ready to take the bull by the horns and settle the problem he had with his partners.", "frequency": 6, "id": 899, "text": "take the bull by the horns"}, {"category": "numbers", "definition": "To decline to answer, especially on grounds that it might be incriminating.", "example": "If you ask me who stole the wallet, I will simply take the fifth.", "frequency": 2, "id": 901, "text": "take the fifth"}, {"category": "animals", "definition": "To have a natural ability to do something.", "example": "She took to motherhood like a duck to water.", "frequency": 0, "id": 902, "text": "take to something like a duck to water"}, {"category": "numbers", "definition": "To speak very quickly.", "example": "I couldn't understand what he was saying because he was talking nineteen to the dozen.", "frequency": 0, "id": 905, "text": "talk nineteen to the dozen"}, {"category": "clothes", "definition": "To talk nonesense", "example": "He was talking through his hat. I couldn't understand what he was saying.", "frequency": 0, "id": 906, "text": "talk through one's hat"}, {"category": "art", "definition": "This idiom means to describe them using the same undesirable attribute, especially unjustly.", "example": "We shouldn't tar all athletes with the same brush because not all of them resort to doping.", "frequency": 0, "id": 907, "text": "tar with the same brush"}, {"category": "parts of the body", "definition": "Said when you are feeling a lot of anxiety over a problem.", "example": "He's been tearing his hair out over his deteriorated relationship with his wife.", "frequency": 9, "id": 908, "text": "tear your hair out"}, {"category": "nature", "definition": "This idiom refers to a small event that has been exaggerated out of proportion.", "example": "The whole fight between the two companies is just a tempest in a teapot.", "frequency": 4, "id": 909, "text": "tempest in a teapot"}, {"category": "age", "definition": "A young age.", "example": "It's easier to learn languages at a tender age.", "frequency": 248, "id": 910, "text": "tender age"}, {"category": "sport", "definition": "Expressions of surprise.", "example": "You mean he came very late again last night? Well, that beats everything!", "frequency": 1, "id": 911, "text": "that beats everything"}, {"category": "numbers", "definition": "This idiom means that the same thing is true for you.", "example": "I just bought a new car. That makes two of us!", "frequency": 0, "id": 912, "text": "that makes two of us"}, {"category": "food", "definition": "Said to show that things don't always turn out the way we hope.", "example": "In spite of her kindness she is the least popular in her class. But, that's the way the cookie crumbles.", "frequency": 4, "id": 913, "text": "that's the way the cookie crumbles"}, {"category": "sport", "definition": "Someone has to take action.", "example": "The ball is in your court now. You should decide what you want to do.", "frequency": 0, "id": 914, "text": "the ball is in someone's court"}, {"category": "sexuality", "definition": "This idiom refers to the conflicts and disagreements between men and women.", "example": "Gender equality is meant to end the battle of the sexes.", "frequency": 25, "id": 915, "text": "the battle of the sexes"}, {"category": "clothes", "definition": "Said about a change of positions when someone whon was in a weaker situation is now in strong position.", "example": "Don't expect him to make any more changes in the manageement of the company, especially after his appointment as the new manager of the project. The boot is on the other foot.", "frequency": 0, "id": 916, "text": "the boot is on the other foot"}, {"category": "nature", "definition": "Problems, trouble.", "example": "World economies are facing the chill wind of the recession.", "frequency": 0, "id": 917, "text": "the chill wind of something"}, {"category": "general", "definition": "In order to make profit, it is necessary for a business to satisfy customers' wishes and make them happy.", "example": "Look at that waiter! He always argues with customers. He doesn't know that the customer is always right.", "frequency": 9, "id": 918, "text": "the customer is always right."}, {"category": "technology and science", "definition": "This idiom refers to the discipline of economics.", "example": "He is interested in history and the dismal science.", "frequency": 39, "id": 919, "text": "the dismal science"}, {"category": "home", "definition": "The last part of a difficult work.", "example": "It was just suc a difficult project to work on, but we are on the home the straight.", "frequency": 2, "id": 920, "text": "the home straight"}, {"category": "home", "definition": "The last part of a difficult work.", "example": "We are in the home stretch after a year of hard work.", "frequency": 4, "id": 921, "text": "the home stretch"}, {"category": "general", "definition": "An outcome or decision is still unknown and awaited.", "example": "The jury is out as to whether there is life anywhere else in the universe.", "frequency": 6, "id": 922, "text": "the jury is out"}, {"category": "law", "definition": "This idiom is used when one is obeying the literal interpretation of the law, but not the intent or the spirit of those who wrote the law.", "example": "Judges mustn't follow the letter of the law, but its spirit.", "frequency": 49, "id": 923, "text": "the letter of the law"}, {"category": "law", "definition": "This idiomatic expression refers to the far-reaching power of the authorities or the police.", "example": "Don't try to escape! The long arm of the law will catch you wherever you may go.", "frequency": 7, "id": 924, "text": "the long arm of the law"}, {"category": "relationship", "definition": "An extreme example which is the biggest, most impressive, or most important of its kind.", "example": "Failure is the mother of all success.", "frequency": 86, "id": 926, "text": "the mother of all"}, {"category": "law", "definition": "One is doing what the authors of the law intended, though not necessarily adhering to the literal wording.", "example": "A judge who adheres to the spirit of the law is concerned with the intent and purpose of the lawmaker.", "frequency": 11, "id": 927, "text": "the spirit of the law"}, {"category": "animals", "definition": "The small thing which causes failure, or causes inability or unwillingness to endure any more of something", "example": "When the boss saw him coming late to work. That was the straw that broke the camel's back. He fired her immediately.", "frequency": 22, "id": 928, "text": "the straw that broke the camel's back"}, {"category": "numbers", "definition": "This idiom designates a close interrogation.", "example": "I don't know why you always give me the third degree every time I hang out with my friends.", "frequency": 2, "id": 929, "text": "the third degree"}, {"category": "crime", "definition": "This idiom means that nothing good comes from criminal schemes.", "example": "Don't mislead yourself. You will pay for your crimes one day, the weed of crime bears bitter fruit.", "frequency": 0, "id": 930, "text": "the weed of crime bears bitter fruit"}, {"category": "relationship", "definition": "Used when describing disagreements or differences especially between different social groups", "example": "There is a them and us situation in the company after the disagreement between the boss and his workers about the working conditions.", "frequency": 78, "id": 931, "text": "them and us"}, {"category": "crime", "definition": "This idiom means that even among criminals there is honor and that they do not commit crimes against each other.", "example": "The gangsters had a strong respect for their old boss which demonstrate that there is honor among thieves.", "frequency": 0, "id": 932, "text": "there is honor among thieves"}, {"category": "crime", "definition": "Intimate, close-knit.", "example": "Alan and John attended a boarding school together and were thick as thieves.", "frequency": 3, "id": 933, "text": "thick as thieves"}, {"category": "sport", "definition": "To admit defeat.", "example": "After a long fight agaisnt his enemies, he finally threw the towel.", "frequency": 81, "id": 934, "text": "throw in the towel"}, {"category": "clothes", "definition": "To show your intention to enter a competition.", "example": "Nearly a year before the elections, he threw his hat into the ring.", "frequency": 0, "id": 935, "text": "throw your hat into the ring"}, {"category": "art", "definition": "This idiom refers to a short description or small picture.", "example": "The accountant gave a thumbnail sketch of the financial situation of the company.", "frequency": 63, "id": 936, "text": "thumbnail sketch"}, {"category": "parts of the body", "definition": "This idiom indicates rejection, disapproval or failure.", "example": "The performance got the thumbs-down from the audience.", "frequency": 242, "id": 937, "text": "thumbs down"}, {"category": "clothes", "definition": "This idiom means to try to spend less money or use less resources.", "example": "Going on holiday abroad cost us a lot of money so we're all going to have to tighten our belts.", "frequency": 0, "id": 939, "text": "tighten your belt"}, {"category": "time", "definition": "This idiom means that time passes very quickly especially when you're having fun.", "example": "Time flew while they were talking about the old beautiful days.", "frequency": 35, "id": 940, "text": "time flies"}, {"category": "money", "definition": "This idiom means that one should not waste time, because one could be using it to earn money.", "example": "I have to wake up and go to work - time is money", "frequency": 22, "id": 941, "text": "time is money"}, {"category": "art", "definition": "This idiom refers to something done in a way that is based on highly developed skill.", "example": "This company elevates web design to a fine art.", "frequency": 12, "id": 942, "text": "to a fine art"}, {"category": "men and women", "definition": "This idiom means without exception.", "example": "All the neighbors were present at the meeting and they all, to a man, agreed to help the poor family.", "frequency": 1221, "id": 943, "text": "to a man"}, {"category": "general", "definition": "To commit to a course of action.", "example": "Some traders are too afraid to pull the trigger and just watch the market without ever getting involved.", "frequency": 40, "id": 944, "text": "to pull the trigger"}, {"category": "animals", "definition": "To make empty threats or promises, to bluff", "example": "You're selling wolf tickets.", "frequency": 0, "id": 945, "text": "to sell wolf tickets"}, {"category": "war", "definition": "Completely, fully, to one's limit", "example": "John has borrowed money from the bank to the hilt.", "frequency": 180, "id": 946, "text": "to the hilt"}, {"category": "time", "definition": "Until the completion of something or until death.", "example": "Don't worry I'll support to the last.", "frequency": 2542, "id": 947, "text": "to the last"}, {"category": "time", "definition": "Until now.", "example": "He disappeared and to this day nobody knows what happened to him.", "frequency": 3215, "id": 948, "text": "to this day"}, {"category": "parts of the body", "definition": "To absolve oneself of responsibility or future blame for.", "example": "I wash my hands of this whole affair.", "frequency": 0, "id": 949, "text": "to wash one's hands of"}, {"category": "love", "definition": "A way of helping someone with compassionate use of stringent disciplinary measures. The aim is to attempt to improve their behavior.", "example": "The only way help him get rid of his drug-addiction is to adhere to the principle of tough love.", "frequency": 120, "id": 951, "text": "tough love"}, {"category": "sport", "definition": "This idiom refers to a person or organization's past performance in any type of endeavor.", "example": "They have a strong track record in creating successful websites.", "frequency": 537, "id": 952, "text": "track record"}, {"category": "food", "definition": "A lot of vehicles causing slow traffic.", "example": "We got stuck in a traffic jam for more than an hour.", "frequency": 129, "id": 953, "text": "traffic jam"}, {"category": "general", "definition": "A clever skill related to a profession.", "example": "He is so skillful. He learned te trick of the trade from his father.", "frequency": 3, "id": 954, "text": "trick of the trade"}, {"category": "travel", "definition": "To dance.", "example": "We were tripping the light fantastic all night.", "frequency": 0, "id": 955, "text": "trip the light fantastic"}, {"category": "time", "definition": "Figuratively to return in time to an earlier period of history.", "example": "When their relationship had started deteriorating, he told her that they should turn back the clock and just go back to when things were simpler.", "frequency": 31, "id": 957, "text": "turn back the clock"}, {"category": "furniture", "definition": "This idiom refers to a change from being in a weaker position in relation to someone else to being in a stronger position by gaining the upper hand over a competitor, rival, or enemy.", "example": "Our team finally turned the tables on their old rivals.", "frequency": 79, "id": 958, "text": "turn the tables"}, {"category": "nature", "definition": "To be suspected of something.", "example": "After the murder of the kid, all the relatives were under a cloud of suspicion.", "frequency": 46, "id": 959, "text": "under a cloud"}, {"category": "art", "definition": "This idiom means to be in a tent.", "example": "The soldiers are under canvas.", "frequency": 0, "id": 961, "text": "under canvas"}, {"category": "general", "definition": "Said about something which is being built or fixed.", "example": "The house has been under construction since last month.", "frequency": 71, "id": 962, "text": "under construction"}, {"category": "clothes", "definition": "This idiom refers to something that you have learned, mastered or achieved and that might be an advantage for you in the future.", "example": "I see that you already have the techniques of drawing under your belt.", "frequency": 1, "id": 963, "text": "under one's belt"}, {"category": "parts of the body", "definition": "Directly in front of one, clearly visible.", "example": "They were stealing his money just under his nose.", "frequency": 1, "id": 964, "text": "under one's nose"}, {"category": "parts of the body", "definition": "Completely controlled by someone, at someone's command.", "example": "She has her husband under her thumb. He would do anything for her.", "frequency": 0, "id": 965, "text": "under one's thumb"}, {"category": "general", "definition": "To be facing something in a stressful environment due to a pressure or a deadline.", "example": "They have been under a lot of pressure recently becaues of the huge work they have been doing.", "frequency": 322, "id": 966, "text": "under pressure"}, {"category": "war", "definition": "This idiom means that you are under pressure.", "example": "We're all under the gun to meet the deadline.", "frequency": 41, "id": 967, "text": "under the gun"}, {"category": "general", "definition": "Intoxicated, inebriated, or otherwise stupefied by an ingested mind-altering substance, commonly speaking of alcohol : drunk.", "example": "He was arrested for driving under the influence.", "frequency": 366, "id": 968, "text": "under the influence"}, {"category": "nature", "definition": "In existance.", "example": "If you want to spend your summer holiday, this is the most beautiful place under the sun.", "frequency": 450, "id": 969, "text": "under the sun"}, {"category": "furniture", "definition": "This idiom may refer to the fact of being drunk or to something that is done secretly.", "example": "After two hours of drinking, everyone was under the table.", "frequency": 106, "id": 970, "text": "under the table"}, {"category": "weather", "definition": "Somewhat ill or gloomy.", "example": "How have you been? I've been under the weather. But it's OK now.", "frequency": 20, "id": 971, "text": "under the weather"}, {"category": "time", "definition": "At the last minute, before the deadline, barely on time, nearly late.", "example": "He turned his report just under the wire.", "frequency": 8, "id": 972, "text": "under the wire"}, {"category": "religion", "definition": "This idiom means that one will never in their life get the results that they want.", "example": "He can wait for my approval until hell freezes over - He won't marry my daughter.", "frequency": 3, "id": 973, "text": "until hell freezes over"}, {"category": "colors", "definition": "Pointless efforts while trying to convince someone or change his mind.", "example": "His parents tell him to do his homework until they are blue in the face. In fact, he never does his homework.", "frequency": 0, "id": 974, "text": "until one is blue in the face"}, {"category": "law", "definition": "This idiom refers to an accepted rule in spite of its informality.", "example": "It's an unwritten law to take your hat off during the national anthem.", "frequency": 34, "id": 975, "text": "unwritten law"}, {"category": "nature", "definition": "Uncertain, unsettled.", "example": "The future of the company is still up in the air.", "frequency": 259, "id": 976, "text": "up in the air"}, {"category": "time", "definition": "The most modern", "example": "The internet is an excellent source of up to the minute news.", "frequency": 42, "id": 977, "text": "up to the minute"}, {"category": "time", "definition": "Current, recent, the latest", "example": "He uses an up-to-date theory to expalin his views.", "frequency": 1967, "id": 978, "text": "up-to-date"}, {"category": "nature", "definition": "The world considered as sad and harsh.", "example": "His grandfather left this vale of tears yesterday.", "frequency": 8, "id": 979, "text": "vale of tears"}, {"category": "nature", "definition": "To disappear.", "example": "The money just vanished into the air. I can't find it anywhere.", "frequency": 0, "id": 980, "text": "vanish into the air"}, {"category": "sexuality", "definition": "A place that hasn't been touched orexplored.", "example": "There is no sign of humans in that island. It's a virgin territory.", "frequency": 11, "id": 982, "text": "virgin territory"}, {"category": "parts of the body", "definition": "To talk.", "example": "Stop wagging your chin and do something.", "frequency": 0, "id": 983, "text": "wag one's chin"}, {"category": "general", "definition": "To wait to see what will occur after.", "example": "The new manager hasn't announced his new plan yet. We'll have to wait and see.", "frequency": 108, "id": 984, "text": "wait and see"}, {"category": "sport", "definition": "To wait in expectation of an occurrence.", "example": "When the scandal was publicly revealed, he waited for the ball to drop as he was involved.", "frequency": 0, "id": 985, "text": "wait for the ball to drop"}, {"category": "parts of the body", "definition": "To serve someone well, satisfying all personal needs.", "example": "She can't take care of herself. She always needs someone to wait on her hand and foot.", "frequency": 0, "id": 987, "text": "wait on someone hand and foot"}, {"category": "home", "definition": "To feel grumpy, irritable, to be easily annoyed.", "example": "She must have woken up on the wrong side of the bed this morning. She didn't stop shouting all day long.", "frequency": 0, "id": 988, "text": "wake up on the wrong side of bed"}, {"category": "general", "definition": "An occupation, role, social class, or lifestyle.", "example": "People in this neighbourhood come from different walks of life.", "frequency": 107, "id": 989, "text": "walk of life"}, {"category": "nature", "definition": "Very excited or happy.", "example": "He was walking on air after he passed the exam.", "frequency": 3, "id": 990, "text": "walk on air"}, {"category": "food", "definition": "This idiom means to be very careful in dealing with a person or situation.", "example": "I was walking on eggs when I told her the truth.", "frequency": 8, "id": 991, "text": "walk on eggs"}, {"category": "food", "definition": "To be overly careful in dealing with a person or situation, to be careful and sensitive, in handling very sensitive matters.", "example": "He was walking on eggshells when he was talking to him about his wife.", "frequency": 7, "id": 992, "text": "walk on eggshells"}, {"category": "sport", "definition": "To do what one said one could do, or would do, not just making empty promises.", "example": "If our company promises to protect the environment, we have to walk the talk.", "frequency": 22, "id": 993, "text": "walk the talk"}, {"category": "general", "definition": "To increase and decrease.", "example": "His love for politics has waxed and waned over the years.", "frequency": 3, "id": 1003, "text": "wax and wane"}, {"category": "sexuality", "definition": "A sexually attractive woman.", "example": "I saw him yesterday with a bit of fluff.", "frequency": 28, "id": 1, "text": "a bit of fluff"}, {"category": "age", "definition": "This idiom means to reach an age at which one is no longer eligible for the system of care designed to provide services, such as education or protection, for people below a certain age level.", "example": "He has aged out of the special student scholarship program.", "frequency": 0, "id": 40, "text": "age out of something"}, {"category": "art", "definition": "This idiom means that works of art last much longer than human lives.", "example": "It takes a long time to acquire and perfect one's expertise (in, say, medicine) and one has but a short time in which to do it.", "frequency": 0, "id": 67, "text": "art is long and life is short"}, {"category": "death", "definition": "About to die, in a life-threatening state of health", "example": "There were rumors that the president was murdered, or at death's door.", "frequency": 9, "id": 75, "text": "at death's door"}, {"category": "work", "definition": "This idiom means you have to return back to the workplace.", "example": "The vacation is over. Back to the salt mines!", "frequency": 0, "id": 84, "text": "back to the salt mines"}, {"category": "animals", "definition": "To consider yourself to be the center of the universe.", "example": "She thinks she is the cat's whiskers in her new dress.", "frequency": 0, "id": 119, "text": "be the cat's whiskers"}, {"category": "parts of the body", "definition": "In one's absence", "example": "He was talking nonsense on my back when I arrived.", "frequency": 0, "id": 133, "text": "behind one's back"}, {"category": "health", "definition": "To lose consciousness.", "example": "He blacked out when he fell.", "frequency": 121, "id": 162, "text": "black out"}, {"category": "colors", "definition": "A disreputable member of a family or a group.", "example": "They say he's the black sheep of the Bakers.", "frequency": 127, "id": 163, "text": "black sheep"}, {"category": "colors", "definition": "Said when you have a simplistic opinion about situations while they are in fact more complicated.", "example": "I think terrorism isn't a black-and-white issue.", "frequency": 1137, "id": 164, "text": "black-and-white"}, {"category": "language", "definition": "This idiom refers to any gesture, position, or movement of the body or face, used to communicate non-verbally.", "example": "Her body language was quite hostile and threatening.", "frequency": 592, "id": 177, "text": "body language"}, {"category": "parts of the body", "definition": "This idiom means just barely, by a narrow margin.", "example": "I passed the exam by the skin of my teeth.", "frequency": 0, "id": 202, "text": "by the skin of one's teeth"}, {"category": "general", "definition": "to be truthful about something, even if it is rude or unpleasant.", "example": "Lacy never fears to tell the truth. She calls a spade a spade.", "frequency": 40, "id": 203, "text": "call a spade a spade"}, {"category": "war", "definition": "This idiom means to be trapped between two lines of enemy fire. Figuratively, the idiom refers to a situation in which one is caught between opposing people arguing about something, making it difficult to remain neutral.", "example": "A young girl is killed in crossfire after a routine arrest.", "frequency": 36, "id": 224, "text": "caught in the crossfire"}, {"category": "technology and science", "definition": "Said about one part of a large system or organization", "example": "He was just an important cog in the machine of organized crime.", "frequency": 7, "id": 242, "text": "cog in the machine"}, {"category": "religion", "definition": "Said when you are determined to do something despite difficulties.", "example": "I'll finish my report by midnight, come hell or high water!", "frequency": 9, "id": 249, "text": "come hell or high water"}, {"category": "weather", "definition": "Regardless of the weather or circumstances.", "example": "Don't worry! I'll be on time come rain or shine.", "frequency": 0, "id": 255, "text": "come rain or shine"}, {"category": "animals", "definition": "This idiom refers to a usually little-known person who unexpectedly wins or succeeds, especially in a competition of some sort.", "example": "Although she had suffered from a severe illness this year, she managed to win the race.", "frequency": 61, "id": 286, "text": "dark horse"}, {"category": "animals", "definition": "Said about someone or something that is is doomed to failure or death.", "example": "Due to enough unfavorable intelligence about the enemy, the attack they were intending to launch was a dead duck right from the start.", "frequency": 6, "id": 290, "text": "dead duck"}, {"category": "general", "definition": "I can't answer your question.", "example": "I don't kow what to say. You got me there!", "frequency": 1, "id": 1037, "text": "you got me there"}, {"category": "names", "definition": "This idiom means anything you say or choose or whatever you can think of.", "example": "What would you like to eat? Fish, chicken, pizza? You name it, we've got everything here.", "frequency": 770, "id": 1038, "text": "you name it"}, {"category": "age", "definition": "This idiom means to have a youthful spirit in spite of being old.", "example": "Although he is over 80, he still feels young at heart.", "frequency": 220, "id": 1039, "text": "young at heart"}, {"category": "time", "definition": "The time when something is planned to begin (military)", "example": "\"This is the zero hour for the attack,\" said the sergeant.", "frequency": 6, "id": 1040, "text": "zero hour"}, {"category": "dreams", "definition": "This idiom refers to an ideal alliance between two people, usually candidates in an election.", "example": "Clinton and Gore were a dream ticket in the American presidential election of 1992.", "frequency": 0, "id": 326, "text": "dream ticket"}, {"category": "weather", "definition": "This idiom is used to say that there is always something good even in an unpleasant, difficult or even painful situation.", "example": "You should never feel hopeless. Every cloud has a silver lining, you know", "frequency": 0, "id": 341, "text": "every cloud has a silver lining"}, {"category": "parts of the body", "definition": "Of a request, complaint, etc, to be ignored.", "example": "Every time I ask him to do something for me, it falls on deaf ears.", "frequency": 28, "id": 367, "text": "fall on deaf ears"}, {"category": "parts of the body", "definition": "This idiom means to have an intuition or hunch about something or to have a strong conviction as a result of one's own practical experience or instinct.", "example": "He is going to fail. I can feel it in my bones.", "frequency": 0, "id": 375, "text": "feel it in one's bones"}, {"category": "numbers", "definition": "This idiom means to feel well and healthy, both physically and mentally.", "example": "It is a wonderful day! I feel like a million dollars.", "frequency": 10, "id": 376, "text": "feel like a million"}, {"category": "religion", "definition": "To decide to become religious or to behave in an ethical way and end one's immoral behavior.", "example": "After the terrible accident he had had, Allan got religion and joined the church.", "frequency": 3, "id": 412, "text": "get religion"}, {"category": "parts of the body", "definition": "To reveal something that is worrying you or making you feel guilty in order to feel relieved.", "example": "She felt relieved when she got it off her chest. She had felt guilty for years.", "frequency": 0, "id": 413, "text": "get something off your chest"}, {"category": "animals", "definition": "To smile very broadly. This is an allusion to a fictional cat popularised by Lewis Carroll's depiction of it in Alice's Adventures in Wonderland and known for its distinctive mischievous grin.", "example": "He knew that she was fearing a scandal. He stood in front of her, grinning like a Cheshire cat, waiting for more money in return for his silence.", "frequency": 0, "id": 442, "text": "grin like a Cheshire cat"}, {"category": "animals", "definition": "To be very worried, upset or angry about something", "example": "My father had a cow when I stayed out late yesterday.", "frequency": 2, "id": 452, "text": "have a cow"}, {"category": "weather", "definition": "This idiom is used to describe a person who is angry or upset about something.", "example": "She had a face like thunder when she discovered the truth.", "frequency": 0, "id": 453, "text": "have a face like thunder"}, {"category": "relationship", "definition": "This idiom means that if you intend to marry a woman, first try to win her mother on your side.", "example": "Listen Joe, if you want to marry Nancy, try to impress her mother first and be sure that she is on your side. He that would the daughter win, must with the mother first begin.", "frequency": 0, "id": 472, "text": "he that would the daughter win, must with the mother first begin"}, {"category": "work", "definition": "This idiom refers to a busy activity usually in a noisy surrounding.", "example": "I don't like the hustle and bustle of big cities.", "frequency": 67, "id": 495, "text": "hustle and bustle"}, {"category": "war", "definition": "This idiom means that if a country is well armed and is strong, its opponents will be less likely to attack it.", "example": "The general said that believing in disarmament is not a good idea and added: \"if you want peace, you must prepare for war.\"", "frequency": 0, "id": 500, "text": "if you want peace, prepare for war"}, {"category": "names", "definition": "Said about somthing that belongs to someone or meant for someone.", "example": "This piece of cake has my name on it.", "frequency": 0, "id": 539, "text": "It has someone's name on it"}, {"category": "weather", "definition": "This idiom is used to mean that things do not just happen occasionally, but all all at the same time.", "example": "I woke up late, missed the bus and when I arrived to work I realized I lost my purse. It never rains but it pours.", "frequency": 3, "id": 540, "text": "it never rains but it pours"}, {"category": "parts of the body", "definition": "To remain alert and watchful.", "example": "Please keep your eyes peeled for the children.", "frequency": 0, "id": 563, "text": "keep one's eye open"}, {"category": "clothes", "definition": "To be secretly amused.", "example": "They're very polite in your presence, but you get the feeling they're laughing up their sleeves.", "frequency": 0, "id": 581, "text": "laugh up your sleeve"}, {"category": "love", "definition": "This idiom means that if you love someone, you must be willing to accept everything about them.", "example": "Alan decided to get married to Lisa although her brother was a drug dealer. When they started their relationship, she often insisted: \"love me, love my dog.\"", "frequency": 0, "id": 608, "text": "love me, love my dog"}, {"category": "life", "definition": "A person who is considered morally unacceptable by their community such as thieves, drug dealers, drug users, alcoholics, thugs, prostitutes and pimps.", "example": "I saw him with a bunch of lowlifes.", "frequency": 160, "id": 617, "text": "low-life"}, {"category": "money", "definition": "Be rich.", "example": "She can't have another car.Her husband is not made of money!", "frequency": 4, "id": 618, "text": "made of money"}, {"category": "parts of the body", "definition": "To tell the truth, to confess.", "example": "After he had lied about the stolen money, he was urged to make a clean breast of it.", "frequency": 0, "id": 622, "text": "make a clean breast of"}, {"category": "men and women", "definition": "Used to mean that things like poetry, art, music, etc are necassary for people just as food.", "example": "People need to read some poetry! Man cannot live by bread alone.", "frequency": 0, "id": 636, "text": "man cannot live by bread alone"}, {"category": "money", "definition": "Said about a job when it is an easy way of earning money.", "example": "Selling ice-cream is money for jam when it is very hot.", "frequency": 0, "id": 661, "text": "money for jam"}, {"category": "music", "definition": "Some good news, a spoken expression or a sound which is pleasing, a welcome remark or information.", "example": "The kind flattering way he used to talk to her was music to her ears.", "frequency": 0, "id": 665, "text": "music to someone's ears"}, {"category": "parts of the body", "definition": "This idiom means my instincts tell me.", "example": "Although his idea seems to be a sound one, my gut tells me that it won't work.", "frequency": 2, "id": 666, "text": "my gut tells me"}, {"category": "time", "definition": "Fix the date of an important event, especially marriage.", "example": "Sarah and John are going to name the day soon.", "frequency": 0, "id": 670, "text": "name the day"}, {"category": "nature", "definition": "This idiom is attributed to Aristotle. It means every space in nature needs to be filled with something.", "example": "Nature abhors a vacuum and that presidential candidate is filling it with his populist promises and pompous declarations", "frequency": 4, "id": 671, "text": "Nature abhors a vacuum"}, {"category": "relationship", "definition": "This idiom means that when people really need to do something, they will find a way to do it.", "example": "When her pen had run out of ink, she used her lipstick to write a short note to her husband who was at work.", "frequency": 1, "id": 672, "text": "necessity is the mother of invention"}, {"category": "law", "definition": "This idiom means that being desperate and having no means may lead you to do illegal things.", "example": "He was dealing in illegal drugs because he had to feed four kids. Necessity knows no law.", "frequency": 0, "id": 673, "text": "necessity knows no law"}, {"category": "animals", "definition": "Said of something not easily categorized or not fitting neatly into any established group.", "example": "I can't see what you want to say. Your proposal is neither fish nor fowl.", "frequency": 9, "id": 674, "text": "neither fish nor fowl"}, {"category": "names", "definition": "This idiom refers to someone whose personality and usual behavior are characterized by worry, insecurity, and timidity.", "example": "He is a nervous Nellie. He can't make a decision without the approval of wife.", "frequency": 1, "id": 675, "text": "nervous Nellie"}, {"category": "general", "definition": "Do not be concerned .", "example": "Never mind.", "frequency": 586, "id": 676, "text": "never mind"}, {"category": "general", "definition": "Almost, hardly.", "example": "Although they paid him next to nothing, he liked the job.", "frequency": 386, "id": 677, "text": "next to nothing"}, {"category": "numbers", "definition": "Almost always.", "example": "In this country, nine times out of ten trains come late.", "frequency": 18, "id": 678, "text": "nine times out of ten"}, {"category": "numbers", "definition": "Said about a job with normal daytime hours, a job that begins at nine o'clock in the morning and finishes at five.", "example": "She's tired of working nine to five.", "frequency": 2, "id": 679, "text": "nine to five"}, {"category": "general", "definition": "An \"official\" refusal to relay any further information, as a response to a newspaper reporter's question.", "example": "The district attorney said, \"No comment,\" when the reporter asked if he knew the identity of the criminal.", "frequency": 289, "id": 680, "text": "no comment"}, {"category": "animals", "definition": "Said of a person who is no longer particularly young.", "example": "Although he's no spring chicken, he runs fast.", "frequency": 8, "id": 681, "text": "no spring chicken"}, {"category": "men and women", "definition": "Said about something or someone that is completely useless.", "example": "That old car is no use to man or beast.", "frequency": 0, "id": 682, "text": "no use to man or beast"}, {"category": "age", "definition": "Said about people who are not young.", "example": "This shop sells clothes for women of a certain age.", "frequency": 132, "id": 702, "text": "of a certain age"}, {"category": "crime", "definition": "Fleeing or running from the police.", "example": "The murderer is still on the run.", "frequency": 1164, "id": 714, "text": "on the run"}, {"category": "parts of the body", "definition": "This idiom means that you will not allow something to happen.", "example": "He says he will become our boss. Over my dead body!", "frequency": 4, "id": 726, "text": "over my dead body"}, {"category": "age", "definition": "Too old to perform as well as before.", "example": "You say you are over the hill, but see how you run as fast as your son!", "frequency": 124, "id": 727, "text": "over the hill"}, {"category": "sexuality", "definition": "To be unfaithful, to have sex with someone who is not your usual partner.", "example": "She stuck on her decision to divorce because she discoverd her husband playing away from home.", "frequency": 0, "id": 745, "text": "play away from home"}, {"category": "animals", "definition": "To tease, confuse or fool someone by trying to trick them into making a mistake so that you have an advantage over them.", "example": "The famous businessman spent his time playing cat and mouse with the judge.", "frequency": 3, "id": 747, "text": "play cat and mouse"}, {"category": "travel", "definition": "To put things in the wrong order", "example": "To attempt to remove the armaments before removing these substantive conflicts of interest is to put the cart before the horse.", "frequency": 2, "id": 767, "text": "put the cart before the horse"}, {"category": "parts of the body", "definition": "This idiom means to please someone or make someone happy.", "example": "I know the surprise party will bring a smile to his lips.", "frequency": 0, "id": 768, "text": "put a smile on someone's face"}, {"category": "animals", "definition": "A way into a bizarre world.", "example": "School's starting up again, time to \"Go Down the Rabbit Hole\" once more.", "frequency": 147, "id": 782, "text": "rabbit hole"}, {"category": "time", "definition": "This idiom means to hurry to do something before a deadline.", "example": "They had only two days to finish the job, so they had to race against time.", "frequency": 151, "id": 783, "text": "race against time"}, {"category": "technology and science", "definition": "To waste one's time doing something that has already been done satisfactorily.", "example": "Just use our guide book to and don't try to reinvent the wheel.", "frequency": 78, "id": 795, "text": "reinvent the wheel"}, {"category": "technology and science", "definition": "To lose the energy, enthusiasm or interest to continue doing something.", "example": "After having worked for twenty years as a the manager of the company, he seems to run out of steam.", "frequency": 89, "id": 811, "text": "run out of steam"}, {"category": "time", "definition": "This idiom means to rescue someone or a situation from danger or failure.", "example": "Thank you very much my dear. You really saved my day.", "frequency": 403, "id": 823, "text": "save the day"}, {"category": "animals", "definition": "Used as an excuse for leaving without giving the real reason (especially if the reason is to go to the toilet, or to have a drink)", "example": "Please, wait for me here. I won't be long. I'm just going to see a man about a dog.", "frequency": 0, "id": 831, "text": "see a man about a dog"}, {"category": "general", "definition": "To be left on your own, without any help, and you have no choice but to fail or succeed. The idiom alludes to the choices available to someone who has fallen into the water.", "example": "It's sink or swim for her. It's too late to help her now.", "frequency": 38, "id": 858, "text": "sink or swim"}, {"category": "parts of the body", "definition": "To punish someone severely.", "example": "My parents will skin me alive if they see my grades.", "frequency": 0, "id": 861, "text": "skin someone alive"}, {"category": "life", "definition": "This idiom refers to a realistic representation of everyday experience in art and entertainment (e.g. a movie, play, book..)", "example": "The movie is a slice of life about the life of a group of students.", "frequency": 319, "id": 862, "text": "slice of life"}, {"category": "technology and science", "definition": "This idiom refers to a moment of challenge when a society or person realizes they must work harder to surpass their competitors.", "example": "This generation's \"Sputnik moment\" has arrived, President Barack Obama declared in his State of the Union address, referring to the United States' need to invest in research and development to revive the economy and ensure future stability.", "frequency": 0, "id": 873, "text": "Spuntnick moment"}, {"category": "food", "definition": "The phrase take the cake is mainly an American idiom that means to be especially bad, outrageous, or objectionable.", "example": "Have you seen how she lies about her ex-husband? I've seen a lot of liars, but she takes the cake", "frequency": 43, "id": 900, "text": "take the cake"}, {"category": "language", "definition": "This idiom means to speak very fast, to talk in a very quick or hurried manner.", "example": "I can never follow everything he's tries to say. He talks a mile a minute.", "frequency": 0, "id": 903, "text": "talk a mile a minute"}, {"category": "language", "definition": "This idiom means it is easier to say you will do something than to actually do it.", "example": "My elder brother promised to help me with my homework, but talk is cheap.", "frequency": 10, "id": 904, "text": "talk is cheap"}, {"category": "clothes", "definition": "This idiom refers to the powerful and influential men in business or politics.", "example": "The men in grey suits will decide the future of this nation.", "frequency": 0, "id": 925, "text": "the men in grey suits"}, {"category": "parts of the body", "definition": "This idiom indicates satisfaction or approval.", "example": "The audience gave the performance the thumbs-up.", "frequency": 1847, "id": 938, "text": "thumbs up"}, {"category": "music", "definition": "To boast, to brag", "example": "She really likes to toot her own horn.", "frequency": 0, "id": 950, "text": "toot one's own horn"}, {"category": "money", "definition": "A person or thing which is unpleasant, disreputable, or otherwise unwanted, especially one which repeatedly appears at inopportune times.", "example": "He always turns up like a bad penny.", "frequency": 0, "id": 956, "text": "turn up like a bad penny"}, {"category": "age", "definition": "This idiom means to be too young to be eligible for something.", "example": "This program is not for people under age.", "frequency": 77, "id": 960, "text": "under age"}, {"category": "food", "definition": "Frequent changes in one's life makes life interesting.", "example": "They frequently change the furniture of the house because they think that variety is the spice of life.", "frequency": 10, "id": 981, "text": "variety is the spice of life"}, {"category": "clothes", "definition": "To await a seemingly inevitable event, especially one which is not desirable.", "example": "He was waiting for the other shoe to drop once some of his companions had been captured by the official authorities,", "frequency": 0, "id": 986, "text": "wait for the other shoe to drop"}, {"category": "names", "definition": "A person, generally quite ordinary with unexceptional qualities, who is prone to fantastic daydreaming of personal triumphs.", "example": "If you are a Walter Mitty with Everest dreams, you need to bear in mind that when things go wrong up there, you may lose your life.", "frequency": 47, "id": 994, "text": "Walter Mitty"}, {"category": "war", "definition": "This idiom refers to a conflict using psychological techniques rather than direct violence in order to weaken the enemy.", "example": "In the future, war will not merely be one of men and machines, it will be a war of wills and a war of nerves.", "frequency": 5, "id": 995, "text": "war of nerves"}, {"category": "war", "definition": "An argument between two people or groups.", "example": "The war of words between the two tcountries hasn't ceased to for a long time.", "frequency": 43, "id": 996, "text": "war of words"}, {"category": "war", "definition": "This idiom refers to an area where war or some extreme violence is taking place.", "example": "It is heart breaking to see images of dead or injured children from a war zone.", "frequency": 195, "id": 997, "text": "war zone"}, {"category": "general", "definition": "To speak in a manner which is needless or futile, in discussion or argument to make points which are not appreciated or heeded.", "example": "Please don't waste your breath asking me ridiculous questions.", "frequency": 0, "id": 998, "text": "waste breath"}, {"category": "parts of the body", "definition": "To be careful about what one says, especially with regard to disrespectful or profane language.", "example": "Watch your mouth when you speak to him. He's the boss.", "frequency": 0, "id": 999, "text": "watch one's mouth"}, {"category": "time", "definition": "To keep noticing the clock because you are eager to stop what you are doing.", "example": "If you are someone who watches the clock, then this job is not for you.", "frequency": 11, "id": 1000, "text": "watch the clock"}, {"category": "general", "definition": "An indication that a development will follow.", "example": "He has ambitious plans. Watch this space!", "frequency": 5, "id": 1001, "text": "watch this space"}, {"category": "language", "definition": "This idiom means pay attention to what one is saying.", "example": "Don't talk that way! Watch your language.", "frequency": 1, "id": 1002, "text": "watch your language"}, {"category": "parts of the body", "definition": "To be affected by a strong emotion and to feel as if you are going to fall down.", "example": "She felt weak at the knees every time he spoke to her.", "frequency": 19, "id": 1004, "text": "weak at the knees"}, {"category": "clothes", "definition": "To exercise authority or to be the person in charge in a relationship.", "example": "He may seem authoritative, but the truth is that it's his wife who really wears the pants in that relationship.", "frequency": 5, "id": 1005, "text": "wear the pants"}, {"category": "clothes", "definition": "To display one's feelings openly.", "example": "Alan always has his heart on his sleeve. Everybody knows how he feels.", "frequency": 1, "id": 1006, "text": "wear your heart on your sleeve"}, {"category": "weather", "definition": "If the weather is fine.", "example": "Weather permitting, we will be able to go on a picnic tomorrow.", "frequency": 12, "id": 1007, "text": "weather permitting"}, {"category": "weather", "definition": "To experience a very difficult situation and survive it.", "example": "They lost everything they had, but somehow they weathered the storm.", "frequency": 17, "id": 1008, "text": "weather the storm"}, {"category": "sport", "definition": "A person who indulges in a sport or pastime on an infrequent basis, usually on weekends when work commitments are not present.", "example": "The most common foot related injury I see for the weekend warrior is heel pain", "frequency": 50, "id": 1009, "text": "weekend warrior"}, {"category": "general", "definition": "To cry a lot.", "example": "She cried buckets, because that was such a sad event.", "frequency": 0, "id": 1010, "text": "weep buckets"}, {"category": "technology and science", "definition": "This idiom refers to something that operates well.", "example": "Their office ran like a well-oiled machine.", "frequency": 13, "id": 1011, "text": "well-oiled machine"}, {"category": "furniture", "definition": "This idiom refers to a person who spoils other people's enthusiasm or enjoyment.", "example": "Don't invite John to the party. He's only going to be a wet blanket.", "frequency": 35, "id": 1012, "text": "wet blanket"}, {"category": "sport", "definition": "Said when you do not understand a situation or someone's behaviour.", "example": "What beats me is how he passed the exam.", "frequency": 0, "id": 1013, "text": "what beats me"}, {"category": "language", "definition": "This idiom is used for reminding a child to say 'please' when asking for something.", "example": "Can I have another candy, mummy? What's the magic word? Please.", "frequency": 0, "id": 1014, "text": "what's the magic word?"}, {"category": "travel", "definition": "Said about something that has failed, often after a laborious, tiring process.", "example": "Our team was doing well for a while, but they got tired and then the wheels fell off.", "frequency": 10, "id": 1015, "text": "wheels fall off"}, {"category": "nature", "definition": "Said when bad things occur in large numbers.", "example": "First, he had a terrible accident. Then, his wife had a heart attack. Really when it rains, it pours.", "frequency": 2, "id": 1016, "text": "when it rains, it pours"}, {"category": "animals", "definition": "This idiom means that something will never happen.", "example": "This phrase is used presumably due to the unlikelihood that pigs will ever evolve wings.", "frequency": 3, "id": 1017, "text": "when pigs fly"}, {"category": "food", "definition": "This idiom means to increase one's desire to have it or know more about it.", "example": "This is a book that will whet people’s appetite for literature.", "frequency": 111, "id": 1018, "text": "whet your appetite"}, {"category": "health", "definition": "Said about someone whose face is very pale because of illness, shock or fear.", "example": "Joe looks as white as sheet. He must be very ill.", "frequency": 0, "id": 1019, "text": "white as a sheet"}, {"category": "colors", "definition": "Said about someone who is totally fair and honest.", "example": "That little boy is whiter than white. He never does anything wrong.", "frequency": 14, "id": 1020, "text": "whiter than white"}, {"category": "music", "definition": "One who pays for something controls it.", "example": "If he pays for everything, he will have power over us all. You know, who pays the piper calls the tune", "frequency": 0, "id": 1021, "text": "who pays the piper calls the tune"}, {"category": "animals", "definition": "This idiom refers to a pursuit of something unattainable or non-existent", "example": "She began to suspect whether she had been sent on a wild-goose chase.", "frequency": 2, "id": 1022, "text": "wild-goose chase"}, {"category": "men and women", "definition": "This idiom refers to a prostitute.", "example": "He started a new relationship with a woman of ill repute.", "frequency": 6, "id": 1023, "text": "woman of ill repute"}, {"category": "language", "definition": "This idiom expresses shock, surprise or dismay, especially when one cannot find words to express ones thoughts and feelings about something one has just seen or heard about.", "example": "Have you seen how she treats badly her husband? Yes, words fail me. I've never seen anything quite like that!", "frequency": 28, "id": 1024, "text": "words fail me"}, {"category": "work", "definition": "To work very well.", "example": "I installed the application on my cell phone and it works like a charm.", "frequency": 32, "id": 1025, "text": "work like a charm"}, {"category": "dreams", "definition": "To work perfectly well.", "example": "The plan worked like a dream.", "frequency": 1, "id": 1026, "text": "work like a dream"}, {"category": "work", "definition": "To work extremely hard.", "example": "He works his fingers to the bone to help his five children grow up in a healthy environment.", "frequency": 1, "id": 1027, "text": "work your fingers to the bone"}, {"category": "money", "definition": "This idiom refers to someone or something that is valuable.", "example": "The new manager cut down the company's expenses by 30%. She is really worth her weight in gold.", "frequency": 245, "id": 1028, "text": "worth its weight in gold"}, {"category": "death", "definition": "Said about something that you would not like to do, or would rather die than do it.", "example": "I would not be caught dead in such a miniskirt.", "frequency": 28, "id": 1029, "text": "wouldn't be caught dead"}, {"category": "general", "definition": "Said to show the exact spot.", "example": "Would you mind moving that armchair here - X marks the spot.", "frequency": 1, "id": 1030, "text": "X marks the spot."}, {"category": "sexuality", "definition": "Not suitable for children.", "example": "Children ae not allowed to watch this film. It's X-rated.", "frequency": 55, "id": 1031, "text": "X-rated"}, {"category": "colors", "definition": "Journalism which is sensationalistic and of questionable accuracy and taste.", "example": "This paper is practising yellow journalism with its reports on sex scandals.", "frequency": 33, "id": 1032, "text": "yellow journalism"}, {"category": "parts of the body", "definition": "A burden.", "example": "They decided to buy the car on credit. This became a yoke around their neck.", "frequency": 0, "id": 1033, "text": "yoke around someone's neck"}, {"category": "life", "definition": "This idiom is used to mean that you are absolutely certain that something is true or will happen.", "example": "You can bet your life they'll get married.", "frequency": 2, "id": 1034, "text": "you can bet your life"}, {"category": "food", "definition": "This idiom means that it is much easier to get what you want by being polite rather than by being rude and insolent.", "example": "Just be polite when you ask for something. You know, you can catch more flies with honey than with vinegar", "frequency": 0, "id": 1035, "text": "you can catch more flies with honey than with vinegar"}, {"category": "relationship", "definition": "Making everyone happy is impossible no matter what you do.", "example": "When the boss chose Mary as the chief executive of the project, everybody complained. But you can't please everyone!", "frequency": 10, "id": 1036, "text": "you can't please everyone"}]